{"version":"https://jsonfeed.org/version/1","title":"David Brownman's Blog","description":"A little bit of everything","home_page_url":"https://davidbrownman.com/blog","feed_url":"https://davidbrownman.com/blog/feed.json","author":{"name":"David Brownman","url":"https://davidbrownman.com"},"items":[{"title":"David's Definitive Marvel Movies Ranking","id":"https://davidbrownman.com/blog/2018/04/26/marvel-movies-ranked/","url":"https://davidbrownman.com/blog/2018/04/26/marvel-movies-ranked/","date_published":"2018-04-26T00:00:00-07:00","tags":["movies","marvel","airtable"],"content_html":"<p>We&#39;re fast reaching the climax of the most ambitious film projects ever conceived: 18 movies over the course of 10 years, ranging from &quot;really good&quot; to &quot;I wish they hadn&#39;t made this, but here we are&quot;. To properly prepare myself for <em>Infinity War</em>, I went back and watched the entire canon of MCU movies. It was the perfect opportunity to compile my personal power ranking for all 18 films, which I&#39;m pleased to present to you now.</p>\n\n<p>While building this list, I watched each movie in order. Movies were judged loosely on categories such as humor, action, cohesiveness, and writing. Then I decided where it fit in based on those I had watched already.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup> All movies I watch fall into one of four categories: Awful, Bad, Good, and Great, which is also how I bracketed these. You probably won&#39;t agree with everything, but this is my list. If you need a refresher of what all the movies are, check out <a href=\"https://en.wikipedia.org/wiki/Marvel_Cinematic_Universe#Feature_films\">Wikipedia</a>.</p>\n\n<p>Without further ado, from worst to best, here&#39;s every Marvel Cinematic Universe film (so far).</p>\n\n<p></p>\n\n<p><strong>NOTE: EXTREME SPOILERS</strong> for all (pre-<em>Infinity War</em>) Marvel movies follow. Proceed at your own risk!</p>\n\n<p><img src=\"https://i.imgur.com/9YMqqIg.png\" alt=\"9ymqqig\" /></p>\n\n<h2 id=\"the-bad\">The Bad</h2>\n\n<p>With 18 films, there are bound to be some stinkers. For whatever reason, the following movies just don&#39;t stand up to the rest (or even as films as a whole).</p>\n\n<p><img src=\"https://i.imgur.com/0V8EMCt.png\" alt=\"0v8emct\" /></p>\n\n<h3 id=\"18-the-incredible-hulk\">18. The Incredible Hulk</h3>\n\n<p>Every series has its worst one, and I&#39;m glad we got the MCU&#39;s out of the way early. Watching it now, I can see what they&#39;re going for. They&#39;ve got Ed Norton, a great actor. They do the &quot;monster movie&quot; right by not really showing him until the end. There are some cute cameos and they reference Iron Man on a TV crawl. On the other hand, despite having a great leading actor, they do a lot of the storytelling via chat logs and the whole thing starts with a 3 minute flashback zooming (at high speed) how the Hulk was created. Plus, the animation hasn&#39;t aged well and it&#39;s hard to care about him or his lady-friend. A well deserved spot at the bottom of the list.</p>\n\n<p><img src=\"https://i.imgur.com/4Z0xqT4.png\" alt=\"4z0xqt4\" /></p>\n\n<h3 id=\"17-ant-man\">17. Ant-Man</h3>\n\n<p>Let me start by saying - I like Paul Rudd. He&#39;s a good actor and seems like a chill dude. That&#39;s why it pains me to see him flounder so spectacularly here. The tone is inconsistent (some of the family drama is <em>very</em> dramatic while everything else is pretty light). Michael Peña is hilarious, but we didn&#39;t get enough of him. There&#39;s an incompetent sub-villain in the ex-wife&#39;s husband and the character who is presumably the female lead feels like an afterthought. There&#39;s really only one good fight scene (the climax in the kid&#39;s bedroom is a neat backdrop!) while the rest are him running around while small. Definitely a cool perspective, but garner nothing more than a &quot;huh, that&#39;s kind of cool&quot;. Not to mention, there&#39;s gross bugs running around the whole time. NEXT.</p>\n\n<p><img src=\"https://i.imgur.com/lqM3J93.png\" alt=\"Lqm3j93\" /></p>\n\n<h3 id=\"16-thor-the-dark-world\">16. Thor: The Dark World</h3>\n\n<p>Let&#39;s start with the good: the sets are pretty cool and Hiddleston&#39;s Loki is a blast. Past that, this movie is thin. They took all of the worst parts of <em>Thor</em> (the stodginess and seriousness) and just made <em>more</em> of it. Gone is the humor where the God of Thunder is learning his way around Earth customs. Instead, we&#39;ve got his prop-of-a-girlfriend Jane (played by the tragically wasted Natalie Portman) who gets powerful for a bit and honestly, that&#39;s all I can remember about it. I know they kill Thor&#39;s mom, but she also only had a line or two previous, so there&#39;s not much in terms of emotional investment. It&#39;s salvaged above the other contenders by virtue of having some half-decent fight scenes, but the villain and everything else about it is so forgettable that it&#39;s hard to be sure.</p>\n\n<p><img src=\"https://i.imgur.com/LWIAOvb.png\" alt=\"Lwiaovb\" /></p>\n\n<h3 id=\"15-thor\">15. Thor</h3>\n\n<p>As one of the earliest movies (it was the fourth one made), it really shows its age. There&#39;s some cool worldbuilding about Asgard and the sets are more elaborate than other movies. Unfortunately for him, Hemsworth&#39;s first outing as Thor doesn&#39;t create a terribly likable character. His acclimation to earth is cute, but brief. There are multiple fights that feel like the climactic one, but none are satisfying enough (the destroyer, then Loki on Asgard). They spend a lot of time on this boring relationship between him and Jane, but the whole thing is unrealistic. I realize that&#39;s a weird complaint in a comic book movie, but suspension of belief only goes so far.</p>\n\n<p><img src=\"https://i.imgur.com/Q5cxMoo.png\" alt=\"Q5cxmoo\" /></p>\n\n<h3 id=\"14-guardians-of-the-galaxy-vol-2\">14. Guardians of the Galaxy Vol. 2</h3>\n\n<p>If you&#39;ve ever wondered how many competing storylines can fit in a movie, look no further. This 2 hours is <em>busy</em>. Some of the arcs (the Ravagers, Drax // Mantis) are awesome and/or emotional while others (Star Lord &amp; his daddy issues, Gold People) feel necessary, but unfulfilling. Nebula doesn&#39;t do a lot despite being an important character. Character development is surprisingly good amid a barrage of jokes (2/3 of which land). There&#39;s some cool tech, but ultimately this movie is fine.</p>\n\n<h2 id=\"the-good\">The Good</h2>\n\n<p>These are the films that start to put the pieces together and start cooking with gas. They&#39;re made up of good scenes with only a few flaws holding them back.</p>\n\n<p><img src=\"https://i.imgur.com/4IIffc1.png\" alt=\"4iiffc1\" /></p>\n\n<h3 id=\"13-iron-man\">13. Iron Man</h3>\n\n<p>We&#39;re getting there! Now, why is a movie typically so well-regarded so far down on the list? Simply, it&#39;s <em>good</em>. There&#39;s nothing awful about it, but RDJ is so good in all of the other movies he&#39;s in that this one fails to shine. It also feels surprisingly dated. This was apparently before Marvel put a ton of time designing Stark&#39;s fantasy computers. Instead, he&#39;s rocking an <a href=\"https://i.imgur.com/IzQPQpR.png\">LG VX9400</a> which is there to feel futuristic and expensive but now comes off antiquated. He&#39;s got a landline phone and makes jokes about MySpace. For all that, Bridges is an awesome villain and there&#39;s some good humor as he&#39;s building the first suits. Marvel has done worse, but they&#39;ve certainly done better since.</p>\n\n<p><img src=\"https://i.imgur.com/JDTGlf4.png\" alt=\"Jdtglf4\" /></p>\n\n<h3 id=\"12-avengers-age-of-ultron\">12. Avengers: Age of Ultron</h3>\n\n<p>This movie had the impossible task of being the sequel to <em>The Avengers</em> (which you haven&#39;t seen on this list yet because it&#39;s very good). It opens on a high note, with the already-together Avengers kicking ass. It&#39;s fun seeing them work together and there&#39;s some great freeze frames. There&#39;s good character work in each of the movie&#39;s vital &quot;small&quot; scenes <sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup> trying to pick up the hammer and the downtime at the farmhouse. Ultron (helped by an <em>exceedingly creepy</em> performance by Spader) is even an interesting adversary. Unfortunately, they spend a lot of screen time here setting up other MCU movies. Sometimes it&#39;s relevant (starting to emphasize personal accountability) but mostly, it&#39;s scenes that feel shoehorned in (Klaue in Wakanda, Infinity Stones in Thor&#39;s dream). Together, they make this movie feel unfocused. It definitely has its high points, but it&#39;s far from a complete package.</p>\n\n<p><img src=\"https://i.imgur.com/1Y7ZqrE.png\" alt=\"1y7zqre\" /></p>\n\n<h3 id=\"11-doctor-strange\">11. Doctor Strange</h3>\n\n<p>The hands down biggest thing this movie has going for it the visual effects. They really went above and beyond with the Inception-esque rotation, folding, and flattening of the world around the characters. I was pleasantly surprised at how utterly unlikable Strange is at the start and how, after seeing him get the snot kicked out of him a few times, we start to sympathize. The humor is great and his supporting cast (Wong, Ejiofor, Mikkelsen, and Swinton) really bring the whole thing together. The fight scenes are mostly hand-to-hand and choreographed well. There&#39;s definitely a lot of hand-wavy science, but given the supernatural nature of the movie, it doesn&#39;t bother me much. When it was all said and done, I was impressed by how well everything came together.</p>\n\n<p><img src=\"https://i.imgur.com/2wCC98b.png\" alt=\"2wcc98b\" /></p>\n\n<h3 id=\"10-iron-man-3\">10. Iron Man 3</h3>\n\n<p>IM3 does a really interesting thing when it focuses on Tony&#39;s problems with PTSD and anxiety, an unusual trait for the lead of a huge franchise. This marks a turning point in the MCU where besides being quality action movies, the films start to explore some emotional complexity that is unusual for the genre. This is one of the few Marvel movies with an actual twist (the identity of the Mandarin, who was awesome). I felt the actual villain (the smarmy dude behind it all) was less compelling. Tony interacting with the kid was great. Unfortunately, despite getting explosion powers, Pepper doesn&#39;t feel like much more than a damsel to be rescued, which is disappointing. The action is par for the Iron Man course and as you&#39;ve read, there are worse movies.</p>\n\n<p><img src=\"https://i.imgur.com/QxwrnC4.png\" alt=\"Qxwrnc4\" /></p>\n\n<h3 id=\"9-guardians-of-the-galaxy\">9. Guardians of the Galaxy</h3>\n\n<p><em>Guardians</em>, like the other movies in this bracket, doesn&#39;t have any glaring faults but doesn&#39;t excel at anything. The characters are actually pretty charming and grow together well. The energy of the soundtrack is infectious and the less traditional take on the humor in a sci-fi universe grew on me. More than anything, I think this willingness to try something out of the box helped them down the line when they were looking for options to salvage the <em>Thor</em> franchise. This also marks the first time Thanos has real dialogue during a movie. John C. Reilly has a great role and watching everyone else in the universe play the <a href=\"https://en.wikipedia.org/wiki/Straight_man\">straight man</a> to this gang of misfits is pretty fun.</p>\n\n<p><img src=\"https://i.imgur.com/BQcz3wX.png\" alt=\"Bqcz3wx\" /></p>\n\n<h3 id=\"8-captain-america-the-first-avenger\">8. Captain America: The First Avenger</h3>\n\n<p>Each time I watch this, it&#39;s better than I remember. The 40&#39;s aesthetic is well done and they spend a lot of non-action scenes showing the war effort. I think my biggest gripe here is how long the setup was - between him trying to get into the army, the training, and the showboating, our first big action scene (besides a fairly satisfying chase through the streets of New York) doesn&#39;t come until much later. When we get to him, Hugo Weaving plays a great villain. A lot of good pieces and a great setup of the Cap movies to come.</p>\n\n<h2 id=\"the-great\">The Great</h2>\n\n<p>Here we have them, the cream of the crop. The following films exemplify what a Marvel movie should be.</p>\n\n<p><img src=\"https://i.imgur.com/uPyKg4W.png\" alt=\"Upykg4w\" /></p>\n\n<h3 id=\"7-iron-man-2\">7. Iron Man 2</h3>\n\n<p>Of the three Iron Men, I think the second outing is the one where the pieces really come together. That may come as a surprise since this is widely considered the worst of the three. When I re-watched it, everything clicked. On one hand, you have a Tony who is finally a human. He&#39;s imperfect and dealing with that through the film. You&#39;ve got a great pair of villains in Rourke and Rockwell (who are great on their own but excel together).  This is also the intro of Senator Stern (the Ted Cruz of the MCU), a character I love to hate. It introduces Nick Fury and the Black Widow (the latter of whom spends the first half pretending to be Stark&#39;s assistant, which leads into a great reveal). Later, she helps Pepper (who is an actual character finally). Furthermore, they delve into the theme of accountability, which is important throughout the rest of the MCU. The action continues to be good, but we don&#39;t spend any time in a cave. Instead, we get functional suits, big set pieces, the Roadie we deserve (Don Cheadle), and a satisfying package.</p>\n\n<p><img src=\"https://i.imgur.com/GbOcvEj.png\" alt=\"Gbocvej\" /></p>\n\n<h3 id=\"6-captain-america-the-winter-soldier\">6. Captain America: The Winter Soldier</h3>\n\n<p>There&#39;s a lot going for <em>Winter Soldier</em>. There&#39;s no need to build Cap from scratch, so we get an opening scene of him running (literal) circles around mere mortals. We get Fury being an actual character and Widow with a lot of screen time. She and Cap have good chemistry, so it&#39;s refreshing to see them get to do some actual sleuthing. The Winter Soldier is frightening and capable. Robert Redford and his surveillance state is a surprisingly relevant message, even 4 years after the movie was originally released. Despite being buildup to <em>Civil War</em> (though we didn&#39;t know it at the time), this movie stands on its own legs as an engaging thriller that effectively sets up some of the moral quandaries that show up later.</p>\n\n<p><img src=\"https://i.imgur.com/Q9pSpDc.png\" alt=\"Q9pspdc\" /></p>\n\n<h3 id=\"5-thor-ragnarok\">5. Thor: Ragnarok</h3>\n\n<p>It&#39;s hard to say what went so <em>right</em> here. My only guess is that Marvel looked at the trash heap that was Thor 2 and &quot;let&#39;s do something completely different&quot;. And different they did! Harnessing the comedy genius of Taika Waititi, to throw all of the seriousness out the window and lean into the humor from the first movie. As it is said, &quot;To be born again, first you have to die&quot;. They take his cape, his hair, and his hammer. What&#39;s left is the funniest Marvel movie there&#39;s ever been. The humor is light and moves quickly; it drags remarkably little for a 2 hour movie. Goldblum is a great addition to the tone of the characters. The Asgard/Hela part of the plot is fine, but does give some cool actions. Cinematograhpically, this movie knocks it out of the park. I think it&#39;s second only to <em>Black Panther</em> for art design and sets. My biggest disappointment was that they didn&#39;t use AC/DC&#39;s <em>Thunderstruck</em> during the climax, but it&#39;s hard to go wrong with <em>The Immigrant Song</em>.</p>\n\n<p><img src=\"https://i.imgur.com/RQaop8D.png\" alt=\"Rqaop8d\" /></p>\n\n<h3 id=\"4-the-avengers\">4. The Avengers</h3>\n\n<p><em>Avengers</em> is greater than the sum of its parts and was for a long time, the best Marvel had to offer. Like a lot of the other intro-heavy movies, there&#39;s a lot of setup before we get to the meat of the movie. It&#39;s done well, with each character intro feeling distinct. The play between each team member feels fun. This is also the first time we get Ruffalo&#39;s Hulk, who is a breath of fresh air on an otherwise tough character. He doesn&#39;t transform until 1:15, so there&#39;s a lot of anticipation. His CGI is much more expressive, which helps him be a character both in and out of green mode. Loki is a great enemy who is equal parts cunning and powerful. The climactic fight through Manhattan is a string of compelling vignettes that tie together well. Also, Coulson&#39;s death (while partially expected <sup id=\"fnref3\"><a href=\"#fn3\" rel=\"footnote\">3</a></sup>), never stops hurting.</p>\n\n<p><img src=\"https://i.imgur.com/6qTpNl5.png\" alt=\"6qtpnl5\" /></p>\n\n<h3 id=\"3-black-panther\">3. Black Panther</h3>\n\n<p>On the surface, <em>Black Panther</em> shares a lot in common with <em>Thor</em>. It&#39;s a self-contained story about a ruler who has to come into his rule and there&#39;s a lot of world-building. The biggest difference is that this one is <em>phenomenal</em>. The supporting cast (Nyong&#39;o, Gurira, Freeman, and Wright) have a great balance between humor and action. They play off each other exceedingly well and feel realistic and human. Michael B Jordan&#39;s Killmonger is the most menacing, driven, sympathetic, and threatening villain in the entire MCU. The art direction is unparalleled; every piece of this movie from the costumes to the environments is gorgeous. The biggest knocks against it are some of the hokier scenes (Lion King-esque conversation and when the sister does her Q impression from the <em>007</em> series) and basically all details involving vibranium, but that can&#39;t do much to stop this mag-lev train from rolling toward the top of my list.</p>\n\n<p><img src=\"https://i.imgur.com/oy2BKRU.png\" alt=\"Oy2bkru\" /></p>\n\n<h3 id=\"2-spider-man-homecoming\">2. Spider-Man: Homecoming</h3>\n\n<p>The third time really is the charm. We finally got a Spiderman movie that didn&#39;t spend time killing Uncle Ben, instead replacing it with a great sequence about <em>Civil War</em> from Peter&#39;s point of view. The action is good, the villain is menacing, and the jokes are there. In fact, I think what impressed me most is how funny the supporting cast of high schoolers is without being annoying or overpowering. They all feel like actual high school students, which adds a lot to the environment. I still think Vulture being his lady friend&#39;s dad is a phenomenal reveal and the car ride he takes them on is stress I haven&#39;t felt since <em>Get Out</em>. <em>Spider-Man</em> is everything a Marvel movie should be and I look forward to what they do with him next.</p>\n\n<p><em>I also wrote about <strong>Spider-Man</strong> in my 2017 lookback <a href=\"/blog/2018/02/21/a-few-more-favorites/#movies\">here</a></em>.</p>\n\n<p><img src=\"https://i.imgur.com/xDwjluE.png\" alt=\"Xdwjlue\" /></p>\n\n<h3 id=\"1-captain-america-civil-war\">1. Captain America: Civil War</h3>\n\n<p>Captain America is the poster boy for a series getting better over time. It&#39;s no small feat to construct a movie that&#39;s both so action packed and so emotionally impactful. Though Zemo is clearly the villain, the writers do an exceptional job painting basically everyone as antagonists at some point. The viewpoints of each side of the Accords are well-presented and justified. The anxiety over seeing &quot;parents&quot; fight and neither side being purely right is tough, but rewarding. The airport fight brings a lot of characters together and is satisfying. Spidey and Ant Man have a chance to be funny without getting in the way, and each sequence feels important. The beats in the last half hour of the movie (Roadie getting injured, Stark putting his friends in jail, the reveal about who killed the Starks) are up there with <em>Logan</em>, redefining drama&#39;s place in the superhero genre. The climax with Bucky, Cap, and Stark beating the pulp out of each other feels so raw and driven that it&#39;s impossible to root for either too heavily. Everything about this movie excels, and that makes it, in my opinion, the single best Marvel movie.</p>\n\n<p><em>I also wrote about <strong>Civil War</strong> in my 2016 lookback <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/#movies\">here</a></em>.</p>\n\n<h2 id=\"onward\">Onward</h2>\n\n<p>Watching all these movies has been a blast and a half and I&#39;m really excited about <em>Infinity War</em>. These movies are the most ambitious cinematic undertaking in history and the fact that they&#39;ve grown this universe over the past 10 years is really astounding.</p>\n\n<p>If you want to play with some of this data, look no farther than <a href=\"https://airtable.com/shrlXSYnmHDqOCi11\">this airtable</a>, which will let you sort, filter, and group all of my rankings. It also has the stream-of-consciousness notes I took while watching if you&#39;re interested in reading a weird play-by-play of each one.</p>\n\n<p>Anyway, that&#39;s all I&#39;ve got today. Thanks for reading and go enjoy the movie!</p>\n\n<p><em>Big thanks to <a href=\"https://www.reddit.com/r/marvelstudios/comments/8b639o/all_18_title_cards_as_they_appear_in_the_movies/\">/u/Ragerodracir</a> for collecting all of the title card images and the inimitable <a href=\"https://vickystein.media/\">Vicky</a> for editing this post, wathing all these movies with me, and generally putting up with me.</em></p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>AKA insertion sort&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn2\">\n<p>just acting, no action&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn3\">\n<p><em>Avengers</em> director Joss Whedon always kills someone in his films. Why does he kill the ones we love the most? Maybe it&#39;s because <a href=\"https://www.reddit.com/r/IAmA/comments/s2uh1/i_am_joss_whedon_ama/c4ani27/?context=3\">we love stupid people</a>&nbsp;<a href=\"#fnref3\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/okc5zmq.png","summary":"Read my personal ranking of all currently-released MCU Movies. You won't believe how many there are! Seriously, they just keep making these things."},{"title":"A Few More of my Favorite Things","id":"https://davidbrownman.com/blog/2018/02/21/a-few-more-favorites/","url":"https://davidbrownman.com/blog/2018/02/21/a-few-more-favorites/","date_published":"2018-02-21T00:00:00-08:00","tags":["boardgames","books","lookback","movies","television","videogames"],"content_html":"<p><em>Editor&#39;s note: this list is a non-exhaustive list of my favorite media from the past year. There are things I like that aren&#39;t on the list (especially my girlfriend).</em></p>\n\n<p>In my advanced age, I&#39;ve found myself with the time and inclination to consume a lot of media. As part of that, I feel like I have am obligation to share the best things I experienced in the past year with you, the loyal reader. I wrote a similar article <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/\">last year</a>, but in case this is your first time (welcome!), I&#39;ll run through the rules for how media qualifies for the coveted &quot;Davy&quot; award:</p>\n\n<ul>\n<li>media qualifies for the list for the calendar year during which I finish it for the first time</li>\n<li>winners are picked based on what I enjoyed most, not what is objectively &quot;the best&quot;. You probably wouldn&#39;t rank stuff the same way, but that&#39;s okay. This is my list, not yours</li>\n<li>if something is critically acclaimed and I&#39;m just getting around to watching it, it probably won&#39;t win. Sorry, <em>The West Wing</em></li>\n</ul>\n\n<p>With that under our belts, let&#39;s dive in!</p>\n\n<p></p>\n\n<p><a name=\"TOC\"></a></p>\n\n<!-- START doctoc generated TOC please keep comment here to allow auto update -->\n\n<!-- DON'T EDIT THIS SECTION, INSTEAD RE-RUN doctoc TO UPDATE -->\n\n<ul>\n<li><a href=\"#board-games\">Board Games</a></li>\n<li><a href=\"#videogames\">Videogames</a>\n\n<ul>\n<li><a href=\"#home\">Home</a></li>\n<li><a href=\"#mobile\">Mobile</a></li>\n</ul></li>\n<li><a href=\"#movies\">Movies</a></li>\n<li><a href=\"#television\">Television</a>\n\n<ul>\n<li><a href=\"#newly-aired\">Newly Aired</a></li>\n<li><a href=\"#ended\">Ended</a></li>\n</ul></li>\n<li><a href=\"#books\">Books</a></li>\n<li><a href=\"#a-look-back\">A Look Back</a></li>\n<li><a href=\"#thats-all\">That&#39;s all!</a></li>\n</ul>\n\n<!-- END doctoc generated TOC please keep comment here to allow auto update -->\n\n<h2 id=\"board-games\">Board Games</h2>\n\n<p>Though I love my remote job dearly, without a doubt the biggest downside is the inability to play games in the office. I&#39;ve got some local friends I meet up with infrequently, but nothing beats a regularly-scheduled Tuesday evening at the office. That said, I&#39;ve still had time to squeeze in some games and try out some new ones.</p>\n\n<p><br />\nWinner: <strong>Secret Hitler</strong></p>\n\n<p>In college, I lived in an amazing <a href=\"https://www.google.com/search?ei=KXZYWoj4Ls_OjwOxw4LoAQ&amp;q=the%20burrow%20ann%20arbor&amp;npsic=0&amp;rflfq=1&amp;rlha=0&amp;rllag=42292958,-83707167,3202&amp;tbm=lcl&amp;rldimm=9798493477036629649\">house</a> with 7 other friends. Our social nature lead to us playing a lot of <a href=\"https://en.wikipedia.org/wiki/The_Resistance_(game)\">The Resistance</a>, a simple game that leans heavily on being able to deceive your close friends. For years I considered it my favorite game- it was fast to play, high tension, and lead to really memorable endings. It was my favorite right up until I had the change to play <em>Secret Hitler</em>.</p>\n\n<p>The game pits two teams against each other: the liberals and the fascists (the latter of whom have all of the info). They take turns nominating a government, which in turn lays a tile on the board that grants a point to one of the two teams. There&#39;s a little luck involved with which tiles are drawn (the deck is heavily stacked for the fascists), but members of both teams can pass legislation (tiles) belonging to each side of government. This uncertainty paired with a good bit of bluffing makes for a very compelling 45 minutes of gameplay.</p>\n\n<p>The lying, betrayal, and explosive resolution really sell this game for me. It&#39;s been an absolute hit at my remote company (when we see each other in person). The components are high quality and travel well. The theme is well-executed, but also easy to rework should it make you uncomfortable. On each level <em>Secret Hitler</em> succeeds.</p>\n\n<p><br />\nRunner-up: <strong>Fugitive</strong></p>\n\n<p>Ever since I moved in with my SO, I&#39;ve been looking for straightforward two-player games that I can get to our (card) table. I like asymmetric games, so the <a href=\"https://www.kickstarter.com/projects/fowers/fugitive\">Kickstarter</a> for <em><a href=\"https://boardgamegeek.com/boardgame/197443/fugitive\">Fugitive</a></em> from <a href=\"https://www.fowers.games/\">Tim Fowers</a> (who previously made <em>Burgle Bros</em>) was a no brainer.</p>\n\n<p>The game is straightforward - both players stockpile cards from a segmented deck. The more the fugitive has, the more options they can employ when laying cards to escape. The more cards the agent collects, the more information they have about the possible hideouts the fugitive could be escaping via. There&#39;s also a mechanic of event cards, but we&#39;ve had so much fun with the base game that we haven&#39;t even used them yet.</p>\n\n<p>If you&#39;re looking for something with a bit of bluffing, great art, compact size and very few &quot;bits&quot;, I can&#39;t recommend this enough.</p>\n\n<h2 id=\"videogames\">Videogames</h2>\n\n<p>This was an interesting year for me as far as videogames were concerned. I made a bet last December (2016) that I would be able to resist the siren call of the Steam sale and forgo all game purchases in the 2017 year. Not one to lose a bet, I stuck with it.</p>\n\n<h3 id=\"home\">Home</h3>\n\n<p>In the absence of a stream of new games I wasn&#39;t going to play, I turned my eyes towards my oft-neglected Steam backlog. There&#39;s a great set of games I had never touched (thanks, Humble Bundle), and I&#39;m glad I had the opportunity to get into them this year.</p>\n\n<p><br />\nWinner: <strong>Talos Principle</strong></p>\n\n<p>I had seen a lot of talk about<em>The Talos Principle</em> and heard it described as &quot;portal-like&quot;. That&#39;s a fair comparison, but there&#39;s a lot more going on here. It&#39;s a more serious game. Instead of a snarky computer, you&#39;ve got an omniscient voice directing you through pristine levels. Similar to <em>The Witness</em> (a favorite game from last year), the game has a lot of exploration and emergent narrative. The biggest (and best) difference is that <em>The Talos Principle</em> actually has a story when it&#39;s all said and done. It explains who you are and why you&#39;re solving, which provides much needed closure. The story is delivered in a series of text files and audio recordings that you find, which is really cool. It&#39;s centered around some event that happened in the past and the role of autonomy/life in robots (which is immediately relevant, given that you play as a robot).</p>\n\n<p><img src=\"https://i.imgur.com/ID0sVGw.jpg\" alt=\"Id0svgw\" /></p>\n\n<p>There are distinct named puzzles that involve manipulating an increasingly complex set of objects (fan, cube, etc) to reach your goal (a tetris piece).Though some of the later puzzles are pretty tough (especially when they throw in time manipulation), the game feels rewarding. There&#39;s a good sense of progression as the puzzle elements become more connected.</p>\n\n<p>The game looks great and the atmosphere is enjoyable. If you want a solid puzzle experience, look no further than <em>The Talos Principle</em>.</p>\n\n<p><br />\nRunner-up: <strong>Else Heart.break()</strong></p>\n\n<p><em>Else Heart.break()</em> takes some time to get rolling, but once it does it&#39;s a pretty cool experience. The story is largely forgettable, but the standout feature is that there&#39;s an entire programming language embedded in the game and every object is &quot;hackable&quot;. While a door&#39;s default behavior is to take you to what&#39;s on the other side, they can be modified to take you anywhere if you know the memory address.</p>\n\n<p>The biggest thing holding this back is the lack of a compelling story (it gets neat towards the end, but it takes ages r get there) and the unused potential. For such a cool idea, the practical uses of the hacking is fairly limited. Maybe that&#39;s for accessibility sake (non-programmers can still play this), but it limits what this game could have achieved.</p>\n\n<p><br />\nHonorable mention: <strong>Recettear, an Item Shop&#39;s Tale</strong> for cute writing and an original concept and <strong>Little Big Planet</strong> for some truly stylized levels and a &quot;whoa dude&quot; moment on the <a href=\"https://youtu.be/aNRPH3-h6yQ?t=4m24s\">large rotating wheel</a>.</p>\n\n<h3 id=\"mobile\">Mobile</h3>\n\n<p>This section is different from the others in two important ways: it&#39;s harder to track playtime on mobile games and as far as I can tell, I didn&#39;t play a lot of mobile games this year. When I&#39;m on the go and have time to kill I&#39;m usually reading. I play some tablet board games, but not much like my gaming experience home. That isn&#39;t to say I don&#39;t have anything to recommend, but take it with a grain of salt. I think these are the only two mobile games I played through this year.</p>\n\n<p><br />\nWinner: <strong>Pokémon: Sun</strong></p>\n\n<p>I&#39;ve been catching <em>most of &#39;em</em> since elementary school. I haven&#39;t played every single <a href=\"https://en.wikipedia.org/wiki/Pok%C3%A9mon_(video_game_series)#Generations\">generation</a> (I missed the past few), but I&#39;m glad I got back into the series in time for <em><a href=\"https://www.pokemon-sunmoon.com/en-us/\">Pokémon: Sun</a></em>. It was the first game I played on my new 3DS (I&#39;m very <a href=\"https://www.reddit.com/r/patientgamers/\">patient</a>) and it made a statement right away that it was <em>different</em>. Most notably, it removed HMs, the unforgettable moves your Pokémon had to know to explore new areas. No longer do I have to base my team on where I&#39;m going to explore. That&#39;s right, I get 6 Pokémon all ready for battle. They also tweaked battle experience distribution it so everyone in your party gets some, meaning no one Pokémon falls too far behind; a welcome boon. The graphics took a big step up and the world felt dynamic and explorable. Not being locked onto a grid helped with that, as did the multitude of biomes and Pokémon available to find.</p>\n\n<p>Improvements aside, the game wasn&#39;t perfect. For a story-focused outing, the story is on the weaker side. It&#39;s a little hokey and the talking Pokédex gets old quickly. The cities are fairly forgettable. The inconsistent nature of the island trials (the replacement for the gym system) was frustrating. The battle trials were cool, but the &quot;wander around and pick up item&quot; trials were not.</p>\n\n<p>When it came down to it, for all its faults, <em>Pokémon Sun</em> felt new and improved, an impressive feat after 20 years of games.</p>\n\n<p><br />\nRunner-up: <strong>Klocki</strong></p>\n\n<p>It&#39;s a tough balancing act to present a puzzle concept and build on it on a good curve. Impressively, <em><a href=\"http://klockigame.com/\">Klocki</a></em> does just that. The puzzles have clear objectives and the tactile-ness of their presentation feels great. Tiles spin, swap, shift, and rotate performantly and the sound effects pair nicely. It&#39;s short and sweet and well worth a few stints-before-bed of your time.</p>\n\n<p><img src=\"https://i.imgur.com/UUwbrP0.png\" alt=\"Uuwbrp0\" /></p>\n\n<p><br />\nHonorable Mention to <em><a href=\"http://altosadventure.com/\">Alto&#39;s Adventure</a></em>, which has beautiful graphics and music. Gameplay is pretty good and generally non-frustrating for an endless runner. The snowboarding theme is delivered well and its a pleasure to zoom down a mountain in search of llamas.</p>\n\n<h2 id=\"movies\">Movies</h2>\n\n<p>What a year for movies. Of all the sections, I had the most trouble picking the winners for this one.</p>\n\n<p>Winner(s): <strong>Spider-Man: Homecoming</strong>, <strong>Get Out</strong></p>\n\n<p><img src=\"https://i.imgur.com/Ab8yfOg.jpg\" alt=\"Ab8yfog\" /></p>\n\n<p>Let&#39;s get the biases out of the way- I love Spider-Man and I&#39;ve enjoyed nearly every modern modern Marvel movie. Even before seeing any trailers, I knew I would enjoy Peter Parker&#39;s first solo outing in the MCU. Never in my cautious optimism did I think it would be <em>this</em> good.</p>\n\n<p>I was most impressed by the pacing and balance of humor against drama. Peter Parker is finally a high school student (played by someone very near that age). His friends feel realistic, and his funny friend has great lines without trying to steal the show. The rest of the supporting cast complements him perfectly. Since this incarnation was introduced in Civil War, We got a full movie without them having to re-kill Uncle Ben. Nevertheless, we got a great character arc as Parker comes into his own as an avenger. They feature Robert Downey Jr well, but he doesn&#39;t overshadow anyone.</p>\n\n<p>This movie excelled on every level and I hope we see more films like this in the MCU.</p>\n\n<p><img src=\"https://i.imgur.com/42djrTL.jpg\" alt=\"42djrtl\" /></p>\n\n<p><em>Get Out</em>, on the other hand, is outside of my comfort zone. I don&#39;t frequently watch horror movies and probably would have skipped this entirely if not for my love for Jordan Peele and how good everyone said this was.</p>\n\n<p>What made the most lasting impression on me was how uncomfortable this made me feel. The way they communicated Daniel Kaluuya&#39;s feeling of being an outsider and an object were unsettlingly impressive. Every line in this movie was deliberate and purposeful, something that really sinks in the more times you see it. The rest of the cast, is great as well. The movie is just funny enough to not be terrifying the whole time. It delivers on every level and is most deserving of this (very prestigious) honor.</p>\n\n<p><br />\nRunner-up: <strong>Hidden Figures</strong></p>\n\n<p>I&#39;ve been making an effort to see more movies by and about people of color. Their experiences can differ so greatly from my own. Plus, I&#39;m a sucker for sure triumphant space movie. This also showed some cool computing history, so it checked a lot of boxes for me.</p>\n\n<p><br />\nHonorable mention for <strong>Logan</strong>, for showing that superhero movies can be so much more that just that; this was a standout drama.</p>\n\n<h2 id=\"television\">Television</h2>\n\n<p>This was the toughest section to write purely because it&#39;s unclear what exactly belongs in it. TV is changing and while some shoes air through the school year, others run over the summer or are released in a batch online. In the effort of simplicity, here&#39;s some shows that are online or completed an entire season in 2017. If you want new network shows, check out AV CLUB.</p>\n\n<h3 id=\"newly-aired\">Newly Aired</h3>\n\n<p><br />\nWinner: <strong>The Guest Book S1</strong></p>\n\n<p>Having been a frequent visitor of a <a href=\"https://en.wikipedia.org/wiki/Estes_Park,_Colorado\">small mountain town</a> much like the setting of <em>The Guest Book</em> in my youth, I was excited to see it explored in a comedy. I haven&#39;t watched Garcia&#39;s other popular show (<em>My Name is Earl</em>), but his reputation precedes him and I was excited for limited run. The show is framed around a consistent set of characters (the residents of fictional Mount Trace) and their interactions with the curious cast of folks that rent the vacation cabin each week. What follows is a delightful mix of thing-a-week, blackmail, misunderstandings, and a cute love story. Not needing to develop the weekly characters for more than 15 minutes leads to some really wonderful and light plots (that all interweave well with the local, ongoing plot lines). It&#39;s a taste of summer and the first season was an enjoyable run.</p>\n\n<p><br />\nRunner-up: <strong>The Orville S1</strong></p>\n\n<p>If you had told me the network sci-fi series I would be most excited about when the fall rolled around wasn&#39;t the triumphant return of Star Trek (to be honest, I haven&#39;t started it yet), but the Seth MacFarlane semi-parody? I don&#39;t even like him that much. Well, spoiler, past-me. <em>The Orville</em> hits a really good balance between seriousness and fun. It&#39;s got a lot of the same campy humor as TNG (unsurprising, given MacFarlane&#39;s history), but with some great plot lines. It took a couple of episodes to get rolling and not every episode was the best, but there were absolutely some standouts. I enjoyed the serial format, where each episode was mostly standalone. I&#39;m excited to see where they take the show when it returns in the fall!</p>\n\n<p><br />\nHonorable mention to <strong>Powerless</strong>, for being a breath of fresh air in the superhero genre. Great to see the world from &quot;our&quot; side. Like many loved shows, it was canceled.</p>\n\n<h3 id=\"ended\">Ended</h3>\n\n<p><br />\nWinner: <strong>Galavant</strong></p>\n\n<blockquote>\n<p>Will all the singing kill our Nielsen ratings?</p>\n</blockquote>\n\n<p>What if you took the musical genius behind some of the best Disney movies and instead had them write a bawdy medieval musical? You get Galavant.</p>\n\n<p>I fell in love with the show from the pilot. The music is phenomenal and the lyrics are clever as heck (related, I recommend you watch with the subtitles on). The show does a great job of subverting expectations at every turn. It does away with tired tropes like the damsel in distress and the evil king.</p>\n\n<p>The second season does a great job expanding on the plot set out by the first. Even though the show was canceled after the second season, it still manages to build to a great climax. In classic &quot;we&#39;re probably canceled so let&#39;s mostly wrap up except for some lose ends to build next season on just in case&quot; fashion, there&#39;s some cool potential for growth if it ever returns (hello, Netflix!). Add all that to the stream of delightful guest stars (Weird Al and John Stamos to name a few), and you&#39;ve got the read deal.</p>\n\n<p>Even after months, I still listen to the <a href=\"https://open.spotify.com/user/1286017453/playlist/4TPdCE51zxM4QA8pzuf1SQ\">soundtrack</a> weekly. There&#39;s something about a self-aware musical that just does it for me, and hopefully it&#39;ll do it for you too.</p>\n\n<iframe src=\"https://open.spotify.com/embed/user/1286017453/playlist/4TPdCE51zxM4QA8pzuf1SQ\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n\n<p><br />\nRunner-up: <strong>Scooby-Doo Mystery Inc</strong></p>\n\n<p>Let me start with this preface: <em>Mystery Inc</em> is super weird. They&#39;ve made some interesting character choices, namely Fred&#39;s near-sexual level of attraction to traps and how Shaggy and Velma start out dating. The show follows a monster-a-week blueprint, but also has an overreaching ark that ties the whole show together. It rises to a significant scale, especially for something that, on the surface, is a kid&#39;s show. There&#39;s a lot of jokes aimed at adults that keeps audiences of all ages on their toes. Consider me pleasantly surprised.</p>\n\n<h2 id=\"books\">Books</h2>\n\n<p><br />\nWinner: <strong>Mistborn 1: The Final Empire</strong></p>\n\n<p>There is something to be said for reading a thick fantasy paperback in a cabin in the wilderness. Whether its childhood memories or just the whole <em>vibe</em>, this is my ideal way to take in a new fantasy series. I won&#39;t pretend the environment didn&#39;t influence how much I enjoyed the first installment of <em><a href=\"https://brandonsanderson.com/books/mistborn/the-final-empire/\">Mistborn</a></em>, but to do so would devalue how great the book actually is. Though the book&#39;s size (and that of the huge world that all of Sanderson&#39;s novels inhabit) was intimidating, it flies by. The tone strikes a really good balance description an action, so no part of it really drags. The world he paints feels vibrant, the magic well-thought out (an easy thing for a fantasy author to mess up), and the city alive. There&#39;s a great sense of scale, both in the seriousness of the plot locally (in the capital city in which it mostly occurs) and how it affects the world around it (that we don&#39;t see much of). To my friends that recommended this so heartily: thank you, and I&#39;m sorry it took so long.</p>\n\n<p><br />\nRunner-up: <strong>Artemis</strong></p>\n\n<p>I really enjoyed Weir&#39;s previous book, <em>The Martian</em>. My biggest complaints were that it was a little drawn out, repetitive, and mathy (I appreciate explanation, but don&#39;t need an entire proof on the subject). <em><a href=\"http://www.andyweirauthor.com/books/artemis-hc\">Artemis</a></em> addressed each of these complaints and wrapped the whole thing in a moon heist. I really enjoyed the way Weir expanded on the day-to-day challenges of living on a moon base and how Earth culture might adapt. Characters were fun, diverse, and expressive. It was paced well with good suspense. Characters were likable and the conclusions was satisfying. Overall, highly recommend.</p>\n\n<p>Honorable mention to <em>Shadow of the Wind</em> because it was both good and very different from what I&#39;ve read before. A change of pace, but an enjoyable one!</p>\n\n<h2 id=\"a-look-back\">A Look Back</h2>\n\n<p>A year (ish) out from <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/\">last year&#39;s post</a>, here&#39;s a quick look back to much I&#39;m enjoying some of the media that was awarded a coveted &quot;Davy&quot; award last year.</p>\n\n<p><em>Factorio</em> is still awesome. The devs put out a weekly <a href=\"https://www.factorio.com/blog/\">blog</a> detailing their progress for the week. I follow the game, but have to play it only once in a while, lest I get sucked in and lose all other productivity. <em>The Witness</em> received an iOS port, opening it up to a whole new audience. My SO is a prime example of someone without the inclination to sit down in front of her computer for a long game, but is never without her with. Due to this port, she&#39;s been able to play through one of my favorite games from last year. The game looks great on her phone, and the island is a pleasure to explore.</p>\n\n<p>I got the expansion for <em>7 Wonders: Duel</em> which, impossibly, improves on a really fun game. It incentivizes some of the tiles that were previously less desirable and opens up new avenues for points if you&#39;re crafty with your card selection. If you enjoyed the base game, this complements it well. Lastly, <em>The Good Place</em> is halfway through its second season (and has been <a href=\"https://www.avclub.com/shrimp-for-everyone-the-good-place-is-forking-renewed-1820650663\">renewed</a> for a third). It&#39;s still forkin&#39; great and I&#39;m excited to see what&#39;s coming next.</p>\n\n<h2 id=\"thats-all\">That&#39;s all!</h2>\n\n<p>Putting together this article every year has encouraged me to track everything I read/watch/play more dutifully, a hobby I&#39;ve put an embarrassing amount of time into. <a href=\"https://airtable.com/invite/r/7A1YRa26\">Airtable</a> is key for this, and I&#39;ll be detailing my use of in an upcoming post.</p>\n\n<p>Until then, enjoy what you watch and let me know if you&#39;ve got any recommendations!</p>\n","banner_image":"https://i.imgur.com/NwGZMyR.png","summary":"A look back at some of my favorite media in 2017"},{"title":"Bogosort in Practice","id":"https://davidbrownman.com/blog/2017/09/05/bogosort-in-practice/","url":"https://davidbrownman.com/blog/2017/09/05/bogosort-in-practice/","date_published":"2017-09-05T00:00:00-07:00","tags":["ruby","programming","statistics"],"content_html":"<p>For whatever reason, there&#39;s a lot of humor in programming. From bogus HTTP <a href=\"https://en.wikipedia.org/wiki/Hyper_Text_Coffee_Pot_Control_Protocol\">responses</a> to <a href=\"https://blog.codinghorror.com/new-programming-jargon/\">fun jargon</a>, we&#39;re a funny bunch. In practice, the only thing funnier than an idea is an idea that actually runs, so I decided to see how awful Bad Code could really be.</p>\n\n<p>The searching and sorting of arrays is a popular (and central) topic in computer science. There&#39;s been a lot of time and effort spent ensuring we can sort array as efficiently as possible. Typically, efficiency in sorting methods is <a href=\"https://en.wikipedia.org/wiki/Big_O_notation\">measured</a> as a function of input length vs number of loops. A great sort won&#39;t appreciably increase ruznning time as the input gets longer. A bad sort, on the other hand...</p>\n\n<p>When the topic of bad searches come up (at parties or whatever, as it does), a crowd favorite is always the infamous <a href=\"https://en.wikipedia.org/wiki/Bogosort\">bogosort</a>. The idea is simple: take an array, randomize it, and check if it&#39;s sorted. If not, repeat! In the best case, you got really lucky and this sort is <em>very fast</em>. Most of the time, you&#39;re less lucky and this is actively awful. Let&#39;s see how this would shake out in practice.</p>\n\n<p></p>\n\n<p>The following is a simple implementation of bogosort using Ruby&#39;s <a href=\"https://ruby-doc.org/core-2.4.0/Array.html#method-i-shuffle-21\">#shuffle!</a> method (plus some extra code to track how many shuffles it took before the array was sorted). It also adds the <code>sorted?</code> method to arrays, to help us know when we&#39;ve (eventually) sorted the array.</p>\n<pre class=\"highlight ruby\"><code><span class=\"k\">class</span> <span class=\"nc\">Array</span>\n  <span class=\"k\">def</span> <span class=\"nf\">sorted?</span>\n    <span class=\"mi\">1</span><span class=\"p\">.</span><span class=\"nf\">upto</span><span class=\"p\">(</span><span class=\"n\">size</span> <span class=\"o\">-</span> <span class=\"mi\">1</span><span class=\"p\">)</span> <span class=\"k\">do</span> <span class=\"o\">|</span><span class=\"n\">i</span><span class=\"o\">|</span>\n      <span class=\"c1\"># if i &gt; i-1, we good</span>\n      <span class=\"k\">return</span> <span class=\"kp\">false</span> <span class=\"k\">if</span> <span class=\"nb\">self</span><span class=\"p\">[</span><span class=\"n\">i</span><span class=\"p\">]</span> <span class=\"o\">&lt;</span> <span class=\"nb\">self</span><span class=\"p\">[</span><span class=\"n\">i</span> <span class=\"o\">-</span> <span class=\"mi\">1</span><span class=\"p\">]</span>\n    <span class=\"k\">end</span>\n    <span class=\"kp\">true</span>\n  <span class=\"k\">end</span>\n<span class=\"k\">end</span>\n\n<span class=\"c1\"># Performs the bogosort, lets us know how many tries it took</span>\n<span class=\"k\">def</span> <span class=\"nf\">num_shuffles</span><span class=\"p\">(</span><span class=\"n\">arr</span><span class=\"p\">)</span>\n  <span class=\"n\">c</span> <span class=\"o\">=</span> <span class=\"mi\">0</span>\n  <span class=\"c1\"># the sort itself</span>\n  <span class=\"k\">until</span> <span class=\"n\">arr</span><span class=\"p\">.</span><span class=\"nf\">sorted?</span>\n    <span class=\"n\">arr</span><span class=\"p\">.</span><span class=\"nf\">shuffle!</span>\n    <span class=\"n\">c</span> <span class=\"o\">+=</span> <span class=\"mi\">1</span>\n  <span class=\"k\">end</span>\n  <span class=\"n\">c</span>\n<span class=\"k\">end</span>\n</code></pre>\n\n<p>Since the randomness of the sort begets such a high variance in results, we&#39;ll want to do a fair number of trails and take the average.</p>\n<pre class=\"highlight ruby\"><code><span class=\"k\">def</span> <span class=\"nf\">bogosort_counter</span><span class=\"p\">(</span><span class=\"n\">n</span><span class=\"p\">)</span>\n  <span class=\"n\">arr</span> <span class=\"o\">=</span> <span class=\"mi\">1</span><span class=\"p\">.</span><span class=\"nf\">upto</span><span class=\"p\">(</span><span class=\"n\">n</span><span class=\"p\">).</span><span class=\"nf\">to_a</span>\n  <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n\n  <span class=\"mi\">5000</span><span class=\"p\">.</span><span class=\"nf\">times</span> <span class=\"k\">do</span>\n    <span class=\"c1\"># start in a random order</span>\n    <span class=\"n\">res</span> <span class=\"o\">&lt;&lt;</span> <span class=\"n\">num_shuffles</span><span class=\"p\">(</span><span class=\"n\">arr</span><span class=\"p\">.</span><span class=\"nf\">shuffle</span><span class=\"p\">)</span>\n  <span class=\"k\">end</span>\n\n  <span class=\"nb\">puts</span> <span class=\"s2\">\"It took an average of </span><span class=\"si\">#{</span><span class=\"n\">res</span><span class=\"p\">.</span><span class=\"nf\">average</span><span class=\"p\">.</span><span class=\"nf\">round</span><span class=\"p\">(</span><span class=\"mi\">2</span><span class=\"p\">)</span><span class=\"si\">}</span><span class=\"s2\"> shuffles to sort an array of length </span><span class=\"si\">#{</span><span class=\"n\">n</span><span class=\"si\">}</span><span class=\"s2\">\"</span>\n<span class=\"k\">end</span>\n</code></pre>\n\n<p>With our measurement tools in hand, I ran the trials with increasingly long arrays. It&#39;s tough to graph numbers that have such a large range (2 element array sorted fairly quickly, large ones... did not), so we used a logarithmic scale. The lines on either side of the dots show the middle 50% of the number of shuffles. As you can see, the number of shuffles scales pretty aggressively with the length of the input.</p>\n\n<p><img src=\"https://i.imgur.com/Tz1cT87.png\" alt=\"Tz1ct87\" /></p>\n\n<table><thead>\n<tr>\n<th>Array Length</th>\n<th>Average Number of Shuffles (5k Trials)</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>2</td>\n<td>0.97</td>\n</tr>\n<tr>\n<td>3</td>\n<td>5.07</td>\n</tr>\n<tr>\n<td>4</td>\n<td>22.8282</td>\n</tr>\n<tr>\n<td>5</td>\n<td>121.59</td>\n</tr>\n<tr>\n<td>6</td>\n<td>715.84</td>\n</tr>\n<tr>\n<td>7</td>\n<td>5019.65</td>\n</tr>\n<tr>\n<td>8</td>\n<td>40985.28</td>\n</tr>\n<tr>\n<td>9</td>\n<td>369657.95</td>\n</tr>\n</tbody></table>\n\n<p>Each array length follows a remarkably similar pattern, known as a <a href=\"https://en.wikipedia.org/wiki/Negative_binomial_distribution\">negative binomial distribution</a> (I am told), meaning the number of shuffles is quite variable. For array length 5, it takes 10^5 shuffles. but it&#39;s just as likely for it to take many more tries. This causes the (incredibly) long tail you see out to the right.</p>\n\n<p><img src=\"https://i.imgur.com/QPR1IQ4.png\" alt=\"Qpr1iq4\" /></p>\n\n<p>If you think those numbers are big, it&#39;s because they are. Big numbers don&#39;t mean anything without context though. To help provide that context, I modified the script to measure the actual clock-on-the-wall time you would spend sorting an array length <code>n</code>. Note that the table skips the first few values of <code>n</code>, as they were sorted too fast for Ruby to capture (which is a good thing, I guess).</p>\n\n<table><thead>\n<tr>\n<th>Array Length</th>\n<th>Average time to be sorted (5 trials, seconds)</th>\n</tr>\n</thead><tbody>\n<tr>\n<td>8</td>\n<td>0.02</td>\n</tr>\n<tr>\n<td>9</td>\n<td>0.25</td>\n</tr>\n<tr>\n<td>10</td>\n<td>1.19</td>\n</tr>\n<tr>\n<td>11</td>\n<td>10.28</td>\n</tr>\n<tr>\n<td>12</td>\n<td>304.68</td>\n</tr>\n<tr>\n<td>13</td>\n<td>2029.58</td>\n</tr>\n<tr>\n<td>14</td>\n<td>Ran computer all night, didn&#39;t complete 5 trials</td>\n</tr>\n</tbody></table>\n\n<p>These results are... not inspiring. Each element added to the array adds roughly a factor of 10 to how long the script takes to run.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup> And again, the precious seconds you spend sorting doesn&#39;t actually guarantee your array will end up sorted anyway. Unless you&#39;re feeling incredibly lucky, I&#39;d stick to something faster and more reliable. Maybe a nice bubble sort.</p>\n\n<p><em>Huge thanks to Evan Batzer for his time and expertise with chart creation. You can find out more about him and his work <a href=\"https://ebatzer.github.io/\">here</a>.</em></p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>These results were gathered using Ruby <code>2.4.1</code> running on an <code>i7-7820HQ CPU @ 2.90GHz</code>&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/zhqbTVt.png","summary":"If you actually implemented Bogosort, how bad could it be?"},{"title":"How Hackers Steal Your Data (and How to Make it Harder for Them)","id":"https://davidbrownman.com/blog/2017/07/05/how-hackers-steal-your-data/","url":"https://davidbrownman.com/blog/2017/07/05/how-hackers-steal-your-data/","date_published":"2017-07-05T00:00:00-07:00","tags":["security"],"content_html":"<p>Your data is in constant danger.</p>\n\n<p>Your address, credit card number, and anything else you have available online is ripe for the taking should an attacker gain access to your accounts. If you use the internet at all (and you&#39;re reading this, I know you do), there are people out there that would happily sell access to your account to the highest bidder, forever compromising that password and any data associated with it.</p>\n\n<p>When you think of a hacker, you might think about <a href=\"https://www.reddit.com/r/itsaunixsystem/top/?sort=top&amp;t=all\">ridiculous scenes</a> from movies. A shadowy figure&#39;s fingers fly over a keyboard in a poorly lit room as green text cascades down their four monitors. The reality of the situation is much more banal; programs run over the course of hours, breaking protected versions of passwords into their plaintext form. Once that&#39;s done, a hacker has unfettered access to any accounts they unlocked directly, plus anything else that reused that password. While nothing can keep you <em>completely</em> safe from a dedicated hacker, you can make yourself as tough of a target as possible. To best understand this, let&#39;s take a journey through the steps of a typical hack, what makes it dangerous, and steps you can take to mitigate your risk.</p>\n\n<p></p>\n\n<h2 id=\"the-anatomy-of-a-hack\">The Anatomy of a Hack</h2>\n\n<p>So here I am, a hacker. I&#39;m looking to make a quick buck, so I&#39;m going to spend my afternoon breaking into your account(s) and putting them up for <a href=\"https://www.theatlantic.com/technology/archive/2016/02/the-black-market-for-netflix-accounts/462321/\">sale</a>. Don&#39;t take it personally. Unless you&#39;re rich and/or famous, I&#39;m probably not targeting you. In fact, I hardly know you exist; you&#39;re a line in a file. Rather than focus on specific people, I&#39;m going to target accounts in bulk. I just bought a dump of 400,000 hashes leaked from a (hypothetical) forum hack a few years ago.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup></p>\n\n<p>When I buy user data like this, at minimum, each entry will have an email and a password.<sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup> The password can be stored in a number of ways. If the company is stupid, the password will be stored in plaintext, exactly how the user wrote it. In that case, I don&#39;t have to do any cracking at all - I just know your password. Let&#39;s hope for your sake, this isn&#39;t the case.</p>\n\n<p>The more likely scenario is that the site will store your password <strong>hashed</strong> and <strong>salted</strong>. These are techniques for making stored passwords more secure (and by extension, leaked passwords harder to crack).</p>\n\n<p>A website needs to save your password in some form (to validate subsequent logins). Instead of storing the plaintext, most sites record your password with the help of a program called a <strong>cryptographic hashing function</strong>. There&#39;s a great writeup about how they work <a href=\"http://www.unixwiz.net/techtips/iguide-crypto-hashes.html#howused\">here</a>, but the gist is that given your password as input, the function produces a <strong>hash</strong> with some special properties. Namely, the output is:</p>\n\n<ol>\n<li><strong>deterministic</strong>; the same input always gives the same output</li>\n<li><strong>unique</strong>; no two inputs should produce the same output</li>\n<li><strong>irreversible</strong>; there&#39;s no way to recover the input from the output</li>\n</ol>\n\n<p>A service can store a hashed version of your password (such as <code>5f4dcc3b5aa765d61d8327deb882cf99</code>) and compare later login attempts against that string. On the surface, this is a great approach for securing data. I bought all these hashes, but because of rule 3 above, I have no <em>direct</em> way to turn them back into usable passwords. Unfortunately for you, I do have an <em>indirect</em> way.</p>\n\n<p>It turns out most users are not very inventive when creating passwords. A recent <a href=\"https://blog.keepersecurity.com/2017/01/13/most-common-passwords-of-2016-research-study/\">security report</a> showed that of a sample of 10 million passwords leaked in 2016, a full 50% of them were among the 25 most commonly used passwords. Most of that list are keyboard patterns (like <code>123456</code> or <code>zxcvbnm</code>) or words straight out of the dictionary (like <code>password</code> or <code>google</code>). Given that so many people use such a small subset of passwords, it&#39;s well worth my time to build a <a href=\"https://en.wikipedia.org/wiki/Rainbow_table\">rainbow table</a>, or a pre-computed list of hashes for the most common passwords (and their variants; <code>password1</code> isn&#39;t fooling anyone). So, if you use a common password you might as well just <a href=\"mailto:beamneocube@gmail.com?subject=My%20Bank%20Account%20Info\">email me</a> your bank account info now. In an effort to defeat my rainbow tables, any service worth it&#39;s (<em>ahem</em>) salt will store your password with a bit of extra text at the front called a <strong>salt</strong>. For example, <code>salt+password1</code> hashes totally differently than <code>password1</code>. If the same salt is used for each password, I have to recreate my rainbow table. If a random salt is used with each password, I have to do them each separately, which definitely slows me down.</p>\n\n<p>If that&#39;s the case, I&#39;ve hit my worst case scenario. Each password is salted separately and I have to crack them one at a time. There are two ways to approach this. I could brute force them, trying every single possible password until I get it. This is akin to playing hangman by guessing each letter in order. It might work, but I&#39;d be better off trying the common letters first (<code>e</code>, <code>t</code>, etc). The same principle applies here. Rather than exhausting every possibility, my time is much better spent running through a huge set of the most likely passwords. This list will consist of the thousand most common passwords (a few of which were mentioned above), all the words from the dictionary, and common variants on each. From there, I can use <a href=\"https://en.wikipedia.org/wiki/John_the_Ripper\">a program</a> to automatically detect which hashing function to use. It will run through my list for each hash, noting the ones it successfully cracks. If I can&#39;t crack a hash at this point, I&#39;ll probably skip it; it&#39;s not worth my time. It should be your goal to have functionally uncrackable passwords. What that entails is the focus of a well-known xkcd comic.</p>\n\n<p><a href=\"https://xkcd.com/936/\"><img src=\"https://imgs.xkcd.com/comics/password_strength.png\" alt=\"https://xkcd.com/936/\" /></a></p>\n\n<p>It highlights two important things: common substitutions (like <code>e -&gt; 3</code>) add negligable security and that the single most important factor in a strong password is <strong>length</strong>. Password strength is a common theme on Jeff Atwood&#39;s <a href=\"https://blog.codinghorror.com\">Coding Horror</a> and he&#39;s got a great piece on <a href=\"https://blog.codinghorror.com/your-password-is-too-damn-short/\">passwords being too short</a>. If your passwords is 8 characters or less, it takes at <em>max</em> 1 minute to guess (and that&#39;s only if you&#39;ve got letters, numbers, etc.</p>\n\n<p>To ensure I can&#39;t crack yours, make sure any password you use:</p>\n\n<ul>\n<li>has at least one of each type of character (upper, lower, number, symbol)</li>\n<li>is 12 characters, <em>minimum</em> (and more is strictly better)</li>\n<li>is unique across all sites you use</li>\n</ul>\n\n<p>Passwords with all of those qualities are basically impossible to remember though. That&#39;s where our first tip comes in:</p>\n\n<h3 id=\"1-use-a-password-manager-to-store-complex-passwords\">1. Use a password manager (to store complex passwords)</h3>\n\n<p>If you want to keep me out, you need to have complex, unique passwords for every site. There&#39;s no reasonable way to expect you to remember these without some help, but help is here. Password managers are a class of software that perform two main functions for passwords: storage and generation.</p>\n\n<p>Password managers act as a secure vault. They typically store usernames, passwords, and matching urls for login pages. Each time you try to log in, they&#39;ll see if they have a matching entry. If so, they&#39;ll auto-fill your password and you never have to think about the jumble of characters you&#39;re subjecting the site to. If not, you&#39;ll log into the site as normal. It&#39;ll then ask you if you want to save that login for later use. That&#39;s all there is to it! The great thing about this approach is that you don&#39;t have to move everything at once. Most people install the app and go about their business, moving sites as they get used. This provides a seamless transition into password security.</p>\n\n<p><img src=\"https://i.imgur.com/FR5ArUX.png\" alt=\"password generation\" /></p>\n\n<p>This same flow integrates with the &quot;update password&quot; forms if you realize your existing passwords aren&#39;t up to snuff. Should that be the case, password managers can generate a password to your specification at the press of a button (pictured above). It also automatically stores your new password for later use, so you never even have to worry about remembering it or writing it down. Some managers even have a feature that will flag bad or repeated passwords to help you know where to focus your energy during the transition.</p>\n\n<p>In my personal life, all of my passwords are random 20+ character strings with a few of each character type. Much like my friends&#39; phone numbers, I don&#39;t know any of my passwords, I just know how to find them. Better yet, according to the <a href=\"https://www.grc.com/haystack.htm\">GRC calculator</a> that Atwood linked to in his post, any one of my passwords would take <em>9.38 hundred billion trillion centuries</em> to crack (which I&#39;m not even totally sure is a real number). I personally use <a href=\"https://1password.com/\">1Password</a> and have found it to have the best balance of security, price, and features.<sup id=\"fnref3\"><a href=\"#fn3\" rel=\"footnote\">3</a></sup> App recommendation site <em>The Sweet Setup</em> <a href=\"http://thesweetsetup.com/apps/best-password-manager-and-why-you-need-one/\">agrees</a> with my assessment and recommends a few others in case you don&#39;t.</p>\n\n<p>As I&#39;m going through the passwords in this hypothetical hack scenario, I&#39;m going to check each hash against the million items in my starting list above. More than likely, that approach will crack half of the passwords with minimal effort. I won&#39;t even bother moving onto the harder half. You see, I&#39;ve got a bunch of plaintext emails and passwords now. There&#39;s an unfortunate correlation with people who have bad passwords: they have bad passwords everywhere. I&#39;m going to use a program that tests the credentials I cracked with other services. If your <a href=\"https://www.theguardian.com/technology/2013/nov/07/adobe-password-leak-can-check\">Adobe</a> password is used for your Twitter account, I now own both of them. I can check accounts quickly, testing hundreds per second. So here&#39;s your second tip:</p>\n\n<h3 id=\"2-dont-reuse-passwords\">2. Don&#39;t reuse passwords</h3>\n\n<p>A lot can go wrong in information security. Given the worst, you want to ensure the damage is localized to the offending site. With unique passwords, even if one account is compromised, I don&#39;t gain any ground for other accounts. You want to make it your mission to make every action I take slow and painful. Any shortcuts you provide me can and will be used to ruin your day.  Of course, you&#39;re reading this article; this isn&#39;t news to you. You&#39;ve heard that it&#39;s bad to re-use passwords (just like you&#39;ve heard you&#39;re supposed to floss regularly). Now you&#39;ll make a pledge to yourself to do better (seriously, flossing is good for you).</p>\n\n<p>You&#39;re also using a password manager (correctly, with hilariously complex passwords). Good for you! Much like a zombie attack, you don&#39;t need to be the fastest person, you just want to avoid being the slowest. By taking 30 minutes to start using good passwords, you&#39;ve put yourself head and shoulders above other internet users. If you want to double down for you most sensitive accounts (like your main email), there&#39;s one more trick up our sleeves.</p>\n\n<p>What if the worst happens and your password is leaked in plaintext (or otherwise leaked to the world)? Then it doesn&#39;t matter how strong your passwords are; you&#39;re vulnerable from the time it&#39;s out in the open until the site resets your password. In the meantime, you can protect yourself by requiring a second factor be present to log into your account. The last big tip is:</p>\n\n<h3 id=\"3-use-2-factor-authentication\">3. Use 2 Factor Authentication</h3>\n\n<p>While authenticating online normally only requires something you <em>know</em> (your password), <strong>2 Factor Authentication</strong> adds the requirement of something you <em>have</em>. A real-world example of this is unlocking your house. To open the door, an attacker needs both something you <em>know</em> (your address) and something you <em>have</em> (your key). Even if I know your address, I can&#39;t get into your house without having your key. 2FA adds a similar level of protection to your online accounts. In addition to your password, someone hoping to log in as you needs an extra piece of information, typically tied to a physical device.</p>\n\n<p><img src=\"https://i.imgur.com/kfH3X5r.png\" alt=\"authy\" /></p>\n\n<p>The most common form of 2FA is a 6 digit code that rotates every 30 seconds, known as a <a href=\"https://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm\">Time-based One-time Password</a> (pictured). Your phone and the server agree on a shared secret during setup, so only a device that knows this secret will be able to generate the correct code. This is a great approach, as I need physical access to a device with your codes on it to break into that account.<sup id=\"fnref4\"><a href=\"#fn4\" rel=\"footnote\">4</a></sup> This method is also great when paired with Touch ID on Apple devices. Unless you&#39;ve got my phone in your hand and my thumb on that hand, my password isn&#39;t enough to get you into my account. There are a lot of good options for 2FA apps, namely <a href=\"https://support.google.com/accounts/answer/1066447?hl=en&amp;co=GENIE.Platform%3DiOS&amp;oco=0\">Google Authenticator</a> (more secure) and <a href=\"https://authy.com/\">Authy</a> (more convenient, but still pretty secure).</p>\n\n<p>If you want to go the extra step (say, for your central gmail account that secures all others), you might invest in a <a href=\"https://smile.amazon.com/Yubico-Y-123-FIDO-U2F-Security/dp/B00NLKA0D8?sa-no-redirect=1\">UTF security key</a> for ~$18. Once attached to an account it acts as a second factor, verifying that the person logging in is the one holding the physical key. Right now it has the major downside of being desktop-only (unless you have a certain Android phone), but justifies that being the absolute most secure option on the market. If you&#39;re interested in adding it to Google, there&#39;s a great walkthrough <a href=\"https://techsolidarity.org/resources/security_key_gmail.htm\">here</a>.</p>\n\n<p>As you&#39;re looking for the 2FA solution that fits you best, remember to <strong>avoid SMS</strong>. This <a href=\"https://techsolidarity.org/resources/security_key_faq.htm\">FAQ</a> goes into detail about the vulnerability of text-message based 2FA:</p>\n\n<blockquote>\n<p>Many sites encourage you to add your phone number to secure your account. But there are at least three reasons why you should avoid using text messages for two-factor authentication.</p>\n\n<ol>\n<li>Your phone number can be easily hijacked by someone who calls the phone company and pretends to be you. <sup id=\"fnref5\"><a href=\"#fn5\" rel=\"footnote\">5</a></sup></li>\n<li>The text message can be viewed or redirected while en route to your phone.</li>\n<li>Many phones are configured to display text messages on the lock screen.</li>\n</ol>\n\n<p>If text messages are the only way to add two-factor authentication to your account, they are better than nothing. But if you can use an alternative method, like an authenticator app or a security key, use that instead.</p>\n</blockquote>\n\n<p>Whichever method(s) you use, it will make you basically impervious to the attack described in this article.</p>\n\n<p>&quot;So... is that it?&quot;, you might be thinking. &quot;If I have good, unique passwords and use 2FA wherever I can, my accounts will be safe?&quot;</p>\n\n<p>The short answer is <em>probably</em>. The longer answer is that nothing is guaranteed, but these tips will keep your accounts as safe as you can reasonably make them. That being said, there are a couple of easy tasks you can complete to cover non-password vectors. You&#39;ve made it this far, might as well take 3 minutes to go the distance.</p>\n\n<h2 id=\"extra-credit\">Extra Credit</h2>\n\n<p>The hack described here (a large-scale brute forcing of hashed passwords) is a common attack vector, but it&#39;s not the only one. The single best way to keep yourself safe is <strong>constant vigilance</strong>. Be overly cautious in all things. To that end, I&#39;ve got two last bonus tips to send you off with.</p>\n\n<h3 id=\"4-use-https-everywhere\">4. Use HTTPS, Everywhere</h3>\n\n<p>Accessing the internet without using <code>https</code> is like shouting everything you type as you do so. If you&#39;re uncomfortable with anyone hearing your passwords, payment info, and any other sensitive information, make sure you only access sites that include <code>https://</code> at the start of their name. The &quot;s&quot; stands for &quot;secure&quot;, which means any data you send to the site is encrypted, safe from any prying eyes. Some sites redirect you by default. A lot more support it, but don&#39;t enforce it. The Electronic Frontier Foundation has a great <a href=\"https://www.eff.org/https-everywhere\">browser extension</a> appropriately called <strong>HTTPS Everywhere</strong> that will redirect you to a secure version of a page if it&#39;s available. It&#39;s easy to install and forget about, and I recommend you do exactly that.</p>\n\n<h3 id=\"5-update-your-computer\">5. Update Your Computer</h3>\n\n<p>Annoying though they may be, operating system updates are <em>vital</em> to keeping your hardware secure. The most recent example is the <a href=\"https://en.wikipedia.org/wiki/WannaCry_ransomware_attack\">WannaCry ransomware</a>, which used known vulnerabilities in Windows 7 to forcibly encrypt over 230,000 computers in 150 countries. These types of attacks are totally preventable, but only if you&#39;ve installed the security patch that fixed it. Apple products aren&#39;t totally safe either; they recently <a href=\"https://support.apple.com/en-us/HT207797\">fixed</a> set a set of vulnerabilities across their operating systems (though they weren&#39;t widely exploited, if at all). Once issues are fixed, attackers have a much narrower range of what vulnerabilities exist in un-updated systems and the race begins. As long as you&#39;re up-to-date every 24 hours you <em>should</em> be safe enough. Then again, it&#39;s never too soon to download a security update.</p>\n\n<p>Listen, I get it. Your computer always prompts you when you&#39;re in the middle of something and you don&#39;t want to break the flow. Wait until the end of the day, or set your computer to apply the update overnight. Just please, <em>please</em> don&#39;t leave them for months or years. The only person you hurt is yourself.</p>\n\n<h2 id=\"you-can-see-clearly-now\">You Can See Clearly Now</h2>\n\n<p>This whole attack might sound far-fetched. Well it turns out, large-scale password breaches happen all the time. There&#39;s a great site called <a href=\"https://haveibeenpwned.com/\">HaveIBeenPwned</a> that maintains a list of all the services that have announced that they&#39;ve been hacked. You can check whether or not your data has ever known to have been compromised by inputting your email.<sup id=\"fnref6\"><a href=\"#fn6\" rel=\"footnote\">6</a></sup> Scary, huh? Even if you&#39;ve gotten lucky and you&#39;ve never been pwned, their extensive <a href=\"https://haveibeenpwned.com/PwnedWebsites\">list of sites</a> is concerning (to say the least).</p>\n\n<p>Anyway, while nothing is 100% in internet security, you owe it to yourself to become as aggravating a target as possible. If you&#39;re interested in reading more, I recommend <a href=\"https://decentsecurity.com/#/introduction/\">decentsecurity.com</a>, this great <a href=\"https://www.reddit.com/user/Kalabaster/m/supasec/\">security muiltireddit</a>, and generally lurking on <a href=\"https://news.ycombinator.com/\">Hacker News</a>.</p>\n\n<p>If you&#39;ve implemented all these tips (an impressive feat!), feel free to <a href=\"https://twitter.com/intent/tweet?hashtags=security&amp;text=I%27ve%20taken%20steps%20to%20make%20my%20online%20life%20more%20secure%20thanks%20to%20@xavdid!%20Learn%20more%20here:%20&amp;url=https://davidbrownman.com/blog/2017/07/05/how-hackers-steal-your-data/\">tweet</a> your accomplishment. No cheating!</p>\n\n<p>Past that, I appreciate you reading this far. I&#39;ve done my best to make a fairly technical subject approachable. Definitely reach out with questions, suggestions, or thoughts. Until then, good luck!</p>\n\n<hr>\n\n<p><em>Many thanks to <a href=\"http://www.andrewaxtell.com/\">Andrew</a>, <a href=\"https://www.instagram.com/agentredsquirrel/\">Vicky</a>, and <a href=\"http://www.plantsciences.ucdavis.edu/plantsciences_faculty/eviner/main/people.htm\">Evan</a> for use of their editing prowess.</em></p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>Hacks happen all the time, and companies are not always prompt about announcing that it&#39;s happened. Just because you haven&#39;t heard about a breach doesn&#39;t automatically mean your data is safe.&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn2\">\n<p>If you&#39;re unlucky, I&#39;ve got phone numbers, birthdays, and/or and location information. If you&#39;re extra unlucky, there could be SSN data there as well.&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn3\">\n<p>I used to use LastPass, but the repeated <a href=\"https://blog.lastpass.com/2017/03/important-security-updates-for-our-users.html/\">security issues</a> drove me away. The LP team did a great job fixing these quickly, but I didn&#39;t want the inevitable next vulnerability to be exploited before they responded to it.&nbsp;<a href=\"#fnref3\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn4\">\n<p>There&#39;s a narrow exception where you can still get phished while using a TOTP. If an attacker can capture your password and token, they have the full 30 second window to use them to compromise this account. This attack is explored in the <a href=\"https://gimletmedia.com/episode/97-what-kind-of-idiot-gets-phished/\">Reply All podcast</a>. For the purposes of prevent a brute force attack as described here, TOTP is more than sufficient. It also talks about how anyone can be phished (even you!). Don&#39;t be overconfident in your abilities.&nbsp;<a href=\"#fnref4\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn5\">\n<p>While a targeted vector like <a href=\"https://motherboard.vice.com/en_us/article/mg7bd4/how-a-hacker-can-take-over-your-life-by-hijacking-your-phone-number\">sim hijacking</a> is separate from the bulk-based attack we&#39;ve been stepping through, it&#39;s definitely something to be aware of.&nbsp;<a href=\"#fnref5\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn6\">\n<p>Normally putting your email into a site that talks about hacking isn&#39;t a great idea. On the surface, it feels like supplying your full credit card to see if anyone else has it. In this case, HIBP? is a reputable site run by a <a href=\"https://www.troyhunt.com/about/\">security researcher</a> and you can act without fear.&nbsp;<a href=\"#fnref6\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/FLGJEW0.png","summary":"The ins and outs of password security"},{"title":"A Few Good X-Men","id":"https://davidbrownman.com/blog/2017/03/19/a-few-good-x-men/","url":"https://davidbrownman.com/blog/2017/03/19/a-few-good-x-men/","date_published":"2017-03-19T00:00:00-07:00","tags":["movies","X-Men"],"content_html":"<p><em>Spoiler note: Everything up until the Big Bold Warning is strictly spoiler free!</em></p>\n\n<p>Spanning multiple reboots, timelines, and source material, Fox&#39;s X-Men franchise can be a lot to get a handle on. In preparation for seeing Logan, I wanted to go back through and watch all of the X-Men movies. There&#39;s a hitch though- there&#39;s no defined order to watch them in. Star Wars has <a href=\"http://www.nomachetejuggling.com/2011/11/11/the-star-wars-saga-suggested-viewing-order/\">Machete Order</a>, but with the X-Men&#39;s contradicting timelines, it&#39;s hard to know the best way to experience them as a first time (or repeat) viewer.</p>\n\n<p>As a series, the X-Men movies tell the saga of Wolverine. As the only character (and actor) in every movie, he is the thread that binds them all. Following his journey gives us a fairly straightforward look into how it actually happens.</p>\n\n<p></p>\n\n<h2 id=\"the-order\">The Order</h2>\n\n<p>If all you want from this article is the definitive chronological order in which to watch the X-Men movies, look no further:</p>\n\n<ol>\n<li>X-Men: First Class</li>\n<li>X-Men Origins: Wolverine*</li>\n<li>X-Men</li>\n<li>X2: X-Men United</li>\n<li>X-Men: The Last Stand (aka X3)*</li>\n<li>The Wolverine*</li>\n<li>X-Men: Days of Future Past*</li>\n<li>X-Men: Apocalypse*</li>\n<li>Logan</li>\n</ol>\n\n<p>* <em>Denotes movie has a post-credit scene</em></p>\n\n<p>That&#39;s it! This order follows Logan&#39;s journey through time as he experiences it. It traverses both timelines (Original and Revised) and covers everything between childhood to old age. Enjoy!</p>\n\n<p>That&#39;s not all you&#39;re here for though, is it? You&#39;re curious about <em>why</em> this is the best order, and you should be! Well, today&#39;s your lucky day.</p>\n\n<h2 id=\"the-explanation\">The Explanation</h2>\n\n<p><strong>SPOILER WARNING</strong>: To best discuss the details of why my order makes sense, the rest of the post contains major details and character fates of the entire series. If reading that will affect the way you watch the movies, <a href=\"#the-order\">turn back</a> now.</p>\n\n<p><img src=\"https://i.imgur.com/rXe8law.jpg\" alt=\"Rxe8law\" /></p>\n\n<p>For everyone else, onward!</p>\n\n<h3 id=\"the-original-timeline\">The Original Timeline</h3>\n\n<p><img src=\"https://i.imgur.com/qSezBoy.jpg\" alt=\"Some of the original cast\" /></p>\n\n<p>Like I said, the series is comprised of two timelines. We&#39;ll start in the Original, comprised of <em>First Class</em> and all the other movies before the time travel in <em>Days of Future Past</em> overwrites things.</p>\n\n<h4 id=\"where-to-begin\">Where To Begin</h4>\n\n<p>There are two reasonable movies to start with: <em>First Class</em> or <em>Origins: Wolverine</em>. Both take place around the same time (the early/mid 1970&#39;s) and act as origin stories for important characters. Assuming Logan is the focal point of the saga (and he is), it makes sense to start with his beginnings in <em>O:W</em>. Between the two, this is the first movie. Plus without seeing this, Jackman&#39;s awesome cameo in <em>FC</em> doesn&#39;t make any sense.</p>\n\n<p>That being said, <em>O:W</em> ends with a young, walking, and bald Patrick Stewart (see <a href=\"#plot-holes\">plot holes</a>) rescuing mutants from the 3-Mile facility. From a continuity standpoint going from that ending to McAvoy is confusing because besides that last scene, Prof. X isn&#39;t in the movie. Furthermore, <em>FC</em> is just a much better movie; starting new watchers on <em>O:W</em> isn&#39;t putting a good foot forward.</p>\n\n<p>Given that either option is doable, <em>First Class</em> is the better choice, followed by <em>Origins: Wolverine</em>.</p>\n\n<p>The latter sees a confused Logan, recently relieved of his memories, running off into the wilderness (which is a recurring destination for him).</p>\n\n<h4 id=\"the-trilogy\">The Trilogy</h4>\n\n<p>Following the aforementioned 3-Mile rescue, Professor Xavier continues leading and expanding his school for gifted youngsters. Logan, lacking any memories, lives his days as a Canadian cage fighter. One day he runs into the hitchhiking Rogue and lives through the events of the original trilogy: <em>X-Men</em>, <em>X2</em>, and <em>The Last Stand (X3)</em>. He makes The order here is simple, as they&#39;re all direct sequels of each other. Logan grows close with everyone in the mansion and becomes a pseudo-uncle figure to them. It helps show that even as a lone wolf, he benefits emotionally from having a pack around him. This of course makes the ending to <em>X3</em> that much sadder.</p>\n\n<h4 id=\"the-bridge\">The Bridge</h4>\n\n<p>Following <em>X3</em>, <em>The Wolverine</em> finds Logan wracked with guilt over his involvement in Jean&#39;s death and fleeing (once again) into the Canadian wilderness. His path soon takes him to Japan where he gets his first taste of a weakened (or non-existent) healing factor. The post-credits scene shows Prof. X and Magneto rejoined as friends recruiting Logan to help them defeat the ultimate risk to mutant-kind: The Sentinels.</p>\n\n<p>Flash forward to 2023 and everything sucks. Not in the sorta-fun <a href=\"https://en.wikipedia.org/wiki/Idiocracy\">Idiocracy</a> way, either. In (the series&#39; peak) <em>Days of Future Past</em>, Sentinels have hunted down and killed nearly all of the mutants. The few survivors hide out in mountains and use time travel to warn their past selves of impending attack. Using this strategy, they send Logan back in time to prevent the sentinel program from ever happening. This leads us to...</p>\n\n<h3 id=\"the-revised-timeline\">The Revised Timeline</h3>\n\n<p><img src=\"https://i.imgur.com/xXIZa7D.jpg\" alt=\"Seriously the best poster\" /></p>\n\n<p>From the moment Logan arrives in 1973, he&#39;s rewriting history. Everything he does, he does with knowledge of the future, meaning all of his actions are inherently different than they were before. In this timeline, he meets Prof. X, Magnteo, Beast, and Quicksilver years before he would have otherwise. They save the day, rewrite history, and everyone goes home happy.</p>\n\n<p>Well, mostly everyone. After the climactic fight, 1970&#39;s Logan is impaled with rebar and drowned in the Patomic river. He&#39;s fished out by William Stryker, who&#39;s here once again to ensure Logan&#39;s enrollment in the RT&#39;s incarnation of the Weapon X project.</p>\n\n<p>There&#39;s also a flash-forward scene that shows the fruits of the revision in the present day, but I&#39;ll get to that <a href=\"#and-then-there-was-one\">later</a>.</p>\n\n<h4 id=\"firster-class\">Firster Class</h4>\n\n<p>We&#39;re in full reboot mode! Now that we&#39;re clear of any transition from the old timeline, Bryan Singer is free to make an awesome movie without any plot restrictions, so he made <em>X-Men: Apocalypse</em>. This ancient powerful mutant wakes up in 1983 and the world almost gets destroyed or whatever. The main cast from <em>X-Men</em> is reintroduced in their younger forms, presumably to keep making movies about.</p>\n\n<p>Logan is seen briefly as he slaughters some guards and escapes the very military facility that most of the other main cast members are in. Young Jean Grey helps restore some of his memory and then he runs off into the woods (see? theme). The post-credits scene shows that though they lack his body, a mysterious corporation has his blood (which could be the key to reproducing the healing factor).</p>\n\n<h4 id=\"and-then-there-was-one\">And Then There Was One</h4>\n\n<p>As of 2017, there&#39;s a pretty large chronological gap in Logan&#39;s story. In <em>Apocalypse</em> (summer of 1983) we saw him as the newly-minted Weapon X freed from Stryker&#39;s facility. Later (presumably the Revised 2023?) he&#39;s in the mansion with his old teammates during the flash-forward from <em>Days of Future Past</em>. After that, all that&#39;s left is <em>Logan</em> in 2029.</p>\n\n<p>As Jackman has <a href=\"http://comicbook.com/2015/05/07/hugh-jackman-confirms-wolverine-3-will-be-his-last-time-as-chara/\">said</a>, <em>Logan</em> is his last outing as the eponymous character. Seeing as we&#39;re tracking Logan&#39;s story, this feels like a fitting place to end our journey.</p>\n\n<h4 id=\"what-about-deadpool\">What about Deadpool?</h4>\n\n<p>Technically, <em>Deadpool</em> should fit somewhere. The presence of the mansion and Colossus cement this (<a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/#movies\">totally delightful</a>) movie as part of the universe. At this point it doesn&#39;t have any plot connections to anything, but it&#39;s a fun watch. Since the Wade Wilson we saw in <em>O:W</em> was part of the erased Original Timeline, the standalone version can safely coexist.</p>\n\n<p>There&#39;s no specific date in the movie, but it&#39;s clearly in modern day and, the mansion exists. Somewhere around 2016 makes sense. Chronologically, that puts it after <em>Apocalypse</em> but before <em>Logan</em> (which is a 45 year gap). There&#39;s a more comprehensive answer about <em>Deadpool</em>&#39;s role <a href=\"https://movies.stackexchange.com/a/47739\">here</a> for the extra curious.</p>\n\n<h2 id=\"plot-holes\">Plot Holes?</h2>\n\n<p>There&#39;s no shortage of articles about the plot holes in this series. Since it wasn&#39;t designed with iron-clad continuity in mind (especially across reboots), this is unavoidable. Some of the common complaints are misunderstandings about what gets Revised, but the rest are actual oversights. Honestly though, that&#39;s okay. Though X-Men lacks the cohesion of the MCU, it&#39;s still a fun set of films (and no fewer than 4 more bad movies can change that).</p>\n\n<p>If you are having trouble keeping everything straight in your head, remember a key tip: <em>First Class</em> always happens. No matter what, regardless of the timeline, <em>FC</em> kicks everything off. Past that, everything is flexible. That&#39;s something the production team has <a href=\"http://collider.com/x-men-apocalypse-new-timeline-explained-bryan-singer/\">discussed</a> too. Most major events will always happen (like the Weapon X project, and Wade Wilson&#39;s transformation), but the how and the when will very across timelines. To see literally everything, I&#39;d check out the X-Men wiki&#39;s <a href=\"http://xmenmovies.wikia.com/wiki/Timeline\">timeline</a>, which compiles all the movie-canon information into a 2-column monolith.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>There you have it: a definitive order to watch the X-Men movies to see the entire Wolverine Saga. It&#39;s got its ups and downs, but as a package it&#39;s wide-reaching, imaginative, and fulfilling.</p>\n\n<p>It&#39;s been a pretty awesome ride.</p>\n","banner_image":"https://i.imgur.com/BGyS1Rq.jpg","summary":"The cannonical order in which to watch the X-Men movies"},{"title":"A Few of My Favorite Things","id":"https://davidbrownman.com/blog/2017/02/11/a-few-of-my-favorite-things/","url":"https://davidbrownman.com/blog/2017/02/11/a-few-of-my-favorite-things/","date_published":"2017-02-11T00:00:00-08:00","tags":["boardgames","books","lookback","movies","television","videogames"],"content_html":"<p><em>Editor&#39;s Note: This was originally written to go out on Dec 31 but it was delayed. Nevertheless, it&#39;s written as if it was posted then.</em></p>\n\n<p>As 2016 draws to a close, it&#39;s a convenient time to look back on the last 12 months to some of the media I&#39;ve enjoyed the most this past year. It might have been a tire fire as far as politics and celebrity deaths go, but there are a lot of metrics <a href=\"https://www.youtube.com/watch?v=wei8M9IuqPc\">trending</a> in the right <a href=\"https://www.youtube.com/watch?v=aThmAZ9yXqE\">direction</a>.</p>\n\n<p>On a personal level, I started getting into tracking what I read, watched, and played in earnest this year. In an effort to share the fruits of that labor, I thought I&#39;d make a year-end list of some of my favorites. This endeavor is inspired in no small part by <a href=\"https://www.macstories.net/roundups/my-must-have-ios-apps-web-services-2016-edition/\">Viticci&#39;s list</a> of a similar nature. Though my picks weren&#39;t necessarily released in 2016, this calendar year is the first time I experienced (or finished) them. It&#39;s highly subjective, but hopefully there&#39;s interests we have that overlap.</p>\n\n<p>Let&#39;s get to it!</p>\n\n<p></p>\n\n<p><a name=\"toc\"></a></p>\n\n<!-- START doctoc generated TOC please keep comment here to allow auto update -->\n\n<!-- DON'T EDIT THIS SECTION, INSTEAD RE-RUN doctoc TO UPDATE -->\n\n<ul>\n<li><a href=\"#board-games\">Board Games</a></li>\n<li><a href=\"#videogames\">Videogames</a>\n\n<ul>\n<li><a href=\"#pcconsole\">PC/Console</a></li>\n<li><a href=\"#mobile\">Mobile</a></li>\n</ul></li>\n<li><a href=\"#movies\">Movies</a></li>\n<li><a href=\"#television\">Television</a>\n\n<ul>\n<li><a href=\"#newly-aired\">Newly Aired</a></li>\n<li><a href=\"#ended\">Ended</a></li>\n</ul></li>\n<li><a href=\"#books\">Books</a></li>\n<li><a href=\"#tldr\">tl;dr</a></li>\n</ul>\n\n<!-- END doctoc generated TOC please keep comment here to allow auto update -->\n\n<h2 id=\"board-games\">Board Games</h2>\n\n<p>There&#39;s never been a better time to have a board game habit.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup> Sitting around a table with friends is totally back in <a href=\"http://www.hollywoodreporter.com/features/behind-hollywoods-closed-doors-a-912169\">vogue</a>. This increased demand has lead to an <a href=\"http://www.military.com/off-duty/games/2016/09/06/physical-board-games-are-experiencing-golden-age.html\">golden age</a> of game production. Kickstarter&#39;s continued popularity has helped; across the site&#39;s history, games are still the <a href=\"https://www.kickstarter.com/help/stats\">most backed</a> category.</p>\n\n<p>Since I took a remote job at <a href=\"https://zapier.com\">Zapier</a> my group&#39;s game sessions aren&#39;t as frequent (compared to when we all worked in the same office), but we make sure they still happen. I played a lot of new games this year and a few new ones stuck out from among the crowd.</p>\n\n<p><br>\nWinner: <strong>Machi Koro</strong></p>\n\n<p>I think what cements <em><a href=\"https://boardgamegeek.com/boardgame/143884/machi-koro\">Machi Koro</a></em> as one of my favorite games from this year is that as soon as I finish playing it with a group for the first time, everyone immediately wants a second go. There&#39;s not always that level of enthusiasm with new games but the pleasant design and wealth of choices make this a great game to jump into. This is a lighter game that mechanically finds itself between Settlers of Catan and Dominion. You get resources based on everyone&#39;s dice rolls, but you have a bit more agency with your luck as you can choose which rolls benefit you based on which cards you buy. There&#39;s an expansion that changes which cards are available in the middle (it makes the piles random instead of static) if you find the game isn&#39;t varied enough. It also adds some nautical features which can help pad game length. There&#39;s a lot of simple tweaks to adjust the game to your group&#39;s preference and play style, and the game feels fun no matter which you choose. Again, it&#39;s light, but undeniably fun.</p>\n\n<p><br>\nRunner-up: <strong>7 Wonders: Duel</strong></p>\n\n<p>Living in an 8 person house in college, <em>7 Wonders</em> was a great way to include everyone in a single game. Strictly speaking it&#39;s got a 2 player variant but it&#39;s shoehorned in and not well-implemented; <em><a href=\"https://boardgamegeek.com/boardgame/173346/7-wonders-duel\">7 Wonders Duel</a></em> is designer Antoine Bauza&#39;s rectification of this problem. It&#39;s a 2 player standalone game that borrows heavily from the mechanics of the original, but does so with 2 players in mind. Victory comes one of three ways- military or scientific supremacy, or points if all 3 rounds complete. Instead of drafting from a deck, the cards are shuffled and laid out on the table where each player takes turns drawing from the display. Once the cards are dealt, there&#39;s very little luck (as both players have access to the same information and cards) which is vital for a 2 player game to be competitive. There&#39;s enough control over your actions (and how they affect your opponent) that victories are satisfying and losses are avoidable. There&#39;s enough variation in the Wonders and the way the cards are laid out that the game has a ton of replay value. The game is well balanced and has a lot of depth. If you find yourself in a position to play a lot of 2 player games, make sure <em>7 Wonders: Duel</em> is in your collection.</p>\n\n<p><br>\nHonorable Mention: <strong>Tokaido</strong>, for a beautifully spiteful game about a leisurely journey up the Japan&#39;s <a href=\"https://en.wikipedia.org/wiki/T%C5%8Dkaid%C5%8D_(road)\">Eastern Sea Road</a>. The components are beautiful and the iconography is clear. Also <strong>Codenames</strong> for being fun as heck and a great party game.</p>\n\n<h2 id=\"videogames\">Videogames</h2>\n\n<p>These days most of my gaming happens on my home-built PC, but I&#39;ve also been making an effort to play through my PS3 backlog in anticipation eventual of Kingdom Hearts 3 and a PS4. When I&#39;m on the go, I stick mostly to my iPad and more recently, my new 3DS. Each year more games come out then ever before, but there&#39;s a few diamonds in the rough.</p>\n\n<h3 id=\"pc-console\">PC/Console</h3>\n\n<p>This has been a weird year for me as far as PC games are concerned. When picking games I tend to prioritize story above most other factors; neither of my picks have much of a story. I&#39;ve been making a concerted effort to not buy any new games (despite sales) and to instead work on my backlog; both of my picks this year were newly purchased for full price.<sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup> Exceptions must be made for excellence, and that&#39;s what these games are.</p>\n\n<p><br>\nWinner: <strong>Factorio</strong></p>\n\n<p>I&#39;ve always had a thing for <a href=\"/blog/2014/12/16/augmenting-automation-on-ios/\">automation</a> and when I saw there was a mining game designed around that very concept, I couldn&#39;t stay away. I bought <em><a href=\"https://www.factorio.com/\">Factorio</a></em> for my birthday and proceeded to play 35 hours that week (placing it squarely in one of my <a href=\"https://steamcommunity.com/id/xavdidtheshadow/games/?tab=all\">most-played</a> steam games of all time). After destroying my sleep schedule and finally launching the rocket, I had only scratched the surface of the game. <sup id=\"fnref3\"><a href=\"#fn3\" rel=\"footnote\">3</a></sup></p>\n\n<p><img src=\"https://i.imgur.com/6WvZjm5.jpg\" alt=\"6wvzjm5\" /></p>\n\n<p>In <em>Factorio</em>, you play the role of a space traveler stranded on a hostile planet. Your ultimate goal is to build a rocket and escape. You start from scratch, mining coal by hand to power your single drill. Manual labor sucks though, so you build some belts and an inserter to make your coal self-sustaining. Before you know it, you&#39;ve constructed a complex automated system that ensures resources will continue to flow through your factory. Along the way you&#39;ll produce science packs that fuel your research. As you progress down the tech tree, you&#39;ll unlock military armaments, automation tools, and the technology necessary to build a rocket.</p>\n\n<p>What impressed me most about this game was the number of ways the player has to automate their factory. There are chests that can offer or request supplies, a full <a href=\"https://www.reddit.com/r/factorio/comments/43giwy/i_made_a_programmable_turingcomplete_computer_in/\">Turing complete</a> system of wires and number-counters, and a programmable train system. The <a href=\"http://guide.factorio.com/07-automation.html\">guide</a> goes into more detail if you&#39;re interested, but suffice it to say that the sky really is the limit.</p>\n\n<p>Much like programming, there are many paths to success when building a factory, some better than others. During play, most of your time is spent iterating and improving your existing designs. The road to perfection is paved by &quot;just 5 more minutes, I want to fix one thing&quot;. There&#39;s an addictive quality to perfection and this game is the dealer. It entices you with a series of small improvements and asks only for your entire day in return.</p>\n\n<p><img src=\"https://i.redd.it/zlx1pgqmlkcy.jpg\" alt=\"Zlx1pgqmlkcy\" /></p>\n\n<p>Multi-player mode and headless servers mean that you can collaborate with friends (synchronously or otherwise). Add that with the joy of designing a well-thought-out base and extensive <a href=\"http://mods.factorio.com\">mod</a> support and you&#39;ve got a masterpiece that you can play basically forever.</p>\n\n<p>The developers have taken a unique <a href=\"https://www.factorio.com/FAQ\">no sale</a> stance on their pricing. Though I was initially annoyed, their choice to give both a Steam key and a DRM download is generous. Continuous active development (nuclear power coming soon!) and support illustrate a clear love of the game and its community. Let me reassure you that this game is indeed worth the Jackson ($20, or local equivalent) it&#39;ll cost you. My only complaint is the game&#39;s sparse soundtrack. To combat it, I&#39;ve been working on a <a href=\"https://open.spotify.com/user/1286017453/playlist/51csweJzekf7uSFkWgeb5b\">playlist</a> that fits the game nicely. Past that, any gripes I&#39;ve got can be solved through mods.</p>\n\n<p>I&#39;d say more, but the enthusiasm on the <a href=\"https://www.reddit.com/r/factorio/\">subreddit</a> speaks for itself. Plus, I&#39;ve got a factory to build.</p>\n\n<p><br>\nRunner-up: <strong>The Witness</strong></p>\n\n<p>At it&#39;s surface, <em>the Witness</em> is a game about increasingly complex line puzzles. There&#39;s no combat, no story to speak of, and no music. You walk around and draw lines through grids to satisfy unexplained constraints. What makes the game so great?</p>\n\n<p><img src=\"https://i.imgur.com/r61H5qm.jpg\" alt=\"R61h5qm\" /></p>\n\n<p>Let&#39;s start with the most obvious: the game is drop-dead gorgeous. Color is used well and the island feels equal parts alive and abandoned. The developers clearly took great care in the design of every aspect of the island. Everything from the foliage to the architecture serves a purpose, usually to build and inform the theme of nearby puzzles. Atmosphere plays a large role in puzzle design and vice versa. There&#39;s a wonderful moment about 30 minutes into the game as you&#39;re solving a series of paired panels. Your drawing on one is mirrored on the other and solutions must satisfy both panels simultaneously. As you walk down a path from the first section towards the second, you&#39;re flanked by strangely shaped pairs of vases. On first pass they&#39;re fairly unremarkable, but nothing in the game is placed on accident. The vases are inverses of each other, strengthening the theme of the mirrored panels.</p>\n\n<p><img src=\"https://i.imgur.com/JXT5w5d.jpg\" alt=\"Jxt5w5d\" /></p>\n\n<p>In addition to its meticulous environment design, the pedagogy of the puzzles shines. There&#39;s no dialog or formal tutorial, but the game teaches you the rules to 7(ish) symbols and how they affect a solution. A reddit user summarizes it better than I can:</p>\n\n<blockquote>\n<p>The Witness is the only game I&#39;ve ever played that bottled that sense of discovery, that made me feel it over and over again. More than anything, it&#39;s a game about language. ... [I]nstead of finding items that let you solve puzzles, you find knowledge that does the same. He took the inventory away from a screen in the game and put it in the player&#39;s head, and he does it all without using any English. He creates a new language and teaches it to you.</p>\n\n<ul>\n<li>/u/Teuthex (<a href=\"https://www.reddit.com/r/Games/comments/5jxpek/the_witness_end_of_2016_discussions/dbjqjx2/\">source</a>)</li>\n</ul>\n</blockquote>\n\n<p><em>The Witness</em> is unique in the <a href=\"https://en.wikipedia.org/wiki/Metroidvania\">metroidvania</a> genre. There&#39;s no enforced order to solving the puzzles in the 10(ish) areas of the island. Your travel is limited only by the sorts of puzzles you&#39;re able to solve. This mechanic results in very rewarding exploratory opportunities as the benefits of your gained knowledge are immediate and obvious. This tight feedback loop is similarly rewarding when solving puzzles as the unfulfilled elements flash red and you&#39;re immediately given a chance to try again.</p>\n\n<p><img src=\"https://i.imgur.com/MYIFqeQ.jpg\" alt=\"Myifqeq\" /></p>\n\n<p>Despite this praise, the game isn&#39;t perfect. For me, the biggest letdown was the lack of narrative payoff. Throughout the game the locations and mysterious statuses paint a story that begs to be explained, but nothing is offered. Also, while most of the puzzles are situated deliberately, there are a few puzzle rooms that are just a pile of panels on a wall without any deeper theme.</p>\n\n<p>For your time and money, <em>The Witness</em> does a lot of things right. I&#39;m glad I got it and look forward to circling back around to completed the areas I skipped in the coming months. Until then, I&#39;ll keep seeing circles and paths everywhere I look.</p>\n\n<p><br>\nHonorable mention: <strong>Ratchet &amp; Clank: Into the Nexus</strong>, for doing a lot with a little. Despite its fairly short campaign, there&#39;s a lot of rewarding exploration do be done to do and I found coming back to <em>Into the Nexus</em> long after I needed to.</p>\n\n<h3 id=\"mobile\">Mobile</h3>\n\n<p>Truth be told I don&#39;t play a lot of mobile games- none on my phone and a few on my iPad. When I do, I mostly puzzle games or action ones with a &quot;solving&#39; component. I got a 3DS on Black Friday and have been making an effort to play it instead of the iPad.<sup id=\"fnref4\"><a href=\"#fn4\" rel=\"footnote\">4</a></sup> It&#39;s been great so far and I&#39;m looking forward to shifting my focus away from an app store plagued with scummy in-app-purchases. Until then, there are a couple of great games that you can play in short bursts on the go.</p>\n\n<p><br>\nWinner: <strong>Blackbox</strong></p>\n\n<p>Puzzle games need a premise, whether it&#39;s line puzzles or a 9 by 9 grid with digits int it. <em><a href=\"http://blackboxpuzzles.com/\">Blackbox</a></em> is unique in that its premise takes advantage of the thing you think about least of all: your iPhone itself. The game consists of a series of puzzles requiring you to light up a little square. There aren&#39;t instructions, strictly speaking, and the answer isn&#39;t always clear. The game&#39;s design does a great job and instructing you tutorial shows you how the puzzles are explicitly device related.</p>\n\n<p><img src=\"https://i.imgur.com/tivxcN1.png\" alt=\"Tivxcn1\" /></p>\n\n<p>One of the intro puzzles is solved with the device&#39;s physical buttons. In others, the graphics mimic part of the iOS interface and are solved by interacting with the real version. Some puzzles are location based. They once led me to drive 20 miles in the wrong direction because I was just close enough to a solution to make the time worth it. There&#39;s also a set of puzzles that are time related and require you to be patient (or a dirty cheater). The wide spectrum of puzzles is continually impressive.</p>\n\n<p><img src=\"https://i.imgur.com/HImz3LG.png\" alt=\"Himz3lg\" /></p>\n\n<p>One of the most unique features is being able to chat with the developer once you&#39;ve completed enough levels. <a href=\"https://twitter.com/warpling\">Ryan</a> is a really friendly guy and it&#39;s been fun picking his brain about the game. He also has a great <a href=\"https://medium.com/mobile-growth/how-i-got-10-000-five-star-reviews-in-4-weeks-5246cc4c55c7#.gdrgzid31\">writeup</a> about asking for device permissions in a non-invasive way. His app asks for most of the available permissions and it could be really annoying if not done tactfully. Once you complete all of the puzzles, there&#39;s not a lot to do until he releases more puzzles. Otherwise, <em>Blackbox</em> has a lot of good going for it.</p>\n\n<p><br>\nRunner-up: <strong>Mini Metro</strong></p>\n\n<p>Planted squarely between very relaxing and very stressful, <em><a href=\"http://dinopoloclub.com/minimetro/\">Mini Metro</a></em> is a subway map simulator. The goal is simple- to not leave anyone waiting at a station too long. Throughout a game (which lasts up to ~15 minutes), shapes (aka stations) pop up around your map. It starts off easy- there are only circle, square, and triangle stations/riders. You place subway lines between stations in order to best aid your geometrically shaped citizens in getting to their destination. As the game progresses, the shapes get more diverse, forcing your system to become more inter-connected and efficient. The difficulty curve is gentle yet firm, leading to satisfying gameplay as you hustle to keep folks moving.</p>\n\n<p><img src=\"https://i.imgur.com/C8npRiX.jpg\" alt=\"C8nprix\" /></p>\n\n<p>The game&#39;s graphics provide an undeniable charm and its pleasant music goes a long way toward making you feel relaxed. Though the people and stations are fictional, all of the maps are based on real cities and the layout of rivers/bridges/tunnels is at least semi-realistic. If I were to make one improvement, it would be about the information you have on the system. Being able to see which lines had which shapes would go a long way towards identifying problems before it&#39;s too late. Nevertheless, a quick <em>Mini Metro</em> session goes a long way to putting me in a good mood.</p>\n\n<p><br>\nHonorable mention: <em><a href=\"https://theguidesapp.com/\">The Guides</a></em>, which plays like a <a href=\"https://en.wikipedia.org/wiki/Capture_the_flag#Computer_security\">CTF</a> game that requires almost no specific technical knowledge. Each level requires a code word (found by correctly decoding written or visual clues) to progress. There seems to be some sort of cryptic story related to aliens, but even without it the game feels satisfying.</p>\n\n<h2 id=\"movies\">Movies</h2>\n\n<p>It wasn&#39;t until I started looking back through the movies that came out in the past year that I realized how many awesome releases there were. I tend to see a lot of movies in the theater and this year was no exception. Until then, here&#39;s the best (and worst) of what I saw in theaters this year.</p>\n\n<p>Winner(s)<sup id=\"fnref5\"><a href=\"#fn5\" rel=\"footnote\">5</a></sup>: <strong>Captain America: Civil War</strong>, <strong>Arrival</strong></p>\n\n<p><img src=\"https://i.imgur.com/CjHIgKA.jpg\" alt=\"Cjhigka\" /></p>\n\n<p><em>Captain America: Civil War</em> was basically everything I might want from a <a href=\"https://en.wikipedia.org/wiki/Marvel_Cinematic_Universe\">MCU</a> movie. I might be biased a huge fan of comic book movies, but that doesn&#39;t stop me from seeing this for what it is: probably the best superhero movie to date.<sup id=\"fnref6\"><a href=\"#fn6\" rel=\"footnote\">6</a></sup> An ensemble cast that was a good mix of funny and serious, quality fight scenes in interesting locations, and character development through a lot of dialog give the audience the feeling of a complete movie. Directors <a href=\"https://en.wikipedia.org/wiki/Russo_brothers\">Joe &amp; Anthony Russo</a> paced it surprisingly well, which is tough to do in a (nearly) 3 hour movie. They&#39;re set to direct the upcoming <em>Infinity War</em> and its sequel, which with any luck will be more of a great thing. Here&#39;s to the continued health and longevity of the MCU (and the hope that they know when to quit).</p>\n\n<p><img src=\"https://i.imgur.com/kJAhVx4.jpg\" alt=\"Kjahvx4\" /></p>\n\n<p><em>Arrival</em> was a breath of fresh air in what can be a stale genre. I&#39;m a sucker for badass lady-scientists (see also: <a href=\"https://en.wikipedia.org/wiki/Contact_(1997_American_film)\">Contact</a>), so this was an easy sell. There was a big focus on linguistics and how words affect our perception. In a modern day where words and speech have become increasingly meaningful and scrutinized, this was especially engaging. It also deals with fear on a national (and international) level, which made it feel especially relevant. There was a good setup, a purposeful build, and a satisfying payoff. I left this movie feeling engaged and satisfied and look forward to watching it again soon.</p>\n\n<p><br>\nRunner-up: <strong>Deadpool</strong></p>\n\n<p>I almost didn&#39;t see this. I was nervous about the character, because I was nearly certain that however he was portrayed he would be annoying and overbearing. I was never more happy to be wrong. In an (arguably over-saturated) field of superhero movies, <em>Deadpool</em> was self aware and managed to balance an emotional story against some absolutely hysterical moments. I was pleased to see them testing including some X-Men in the MCU proper and hope for more. The film&#39;s underdog success makes me a little concerned about more studio interference in the sequel, but who says lightning can&#39;t strike twice?</p>\n\n<p><br>\nHonorable mention(s):  <em>Storks</em> and <em>Zootopia</em>, for proving that there&#39;s space for a serious (and often meaningful) story while providing jokes that cater to all ages. Lastly <em>Rogue One</em>, for a pleasant surprise.</p>\n\n<p>Dishonorable mention: <em>Kung-Fu Panda 3</em>, for completing the series&#39; decline from the pinnacle of cinema to a fairly generic children&#39;s movie. The per-character in-fight catchphrases were a letdown.</p>\n\n<h2 id=\"television\">Television</h2>\n\n<p>It&#39;s no secret that I watch a lot of TV. I enjoy the long-form stories that are told over the course of a season. I aim to balance a collection of running shows with a backlog from Netflix and elsewhere. This is something I&#39;ve tracked in a couple of different places, but never well. New years resolutions, I guess!</p>\n\n<h3 id=\"newly-aired\">Newly Aired</h3>\n\n<p>As the shows I watch end, I&#39;m always on the lookout for new things to supplement my weekly rotation. My running count had dipped low this season, so I made an effort to pick up something new.</p>\n\n<p><br>\nWinner: <strong>The Good Place</strong></p>\n\n<p>On the whole, I really like NBC comedies (see: Community, 30 Rock, Scrubs, etc) and they&#39;ve hit it out of the park again with <em>The Good Place</em>. It&#39;s been a really fun season slowly growing our knowledge about the characters. Normally I only put things on here I&#39;ve finished, but having seen everything but the finale so far in 2016, I&#39;m confident I&#39;ll still feel this way when the season concludes (<em>2017 edit: the finale exceeded expectations</em>). The show is quirky without being overbearing and weaves its characters together well. I like how it approaches the afterlife in a factual, straightforward manner and ruminates on what makes people good (a topic I&#39;ve thought <a href=\"#\">a lot</a> about). None of the characters are quite as they seems and it&#39;s been a delight untangle the lives of the people in <em>The Good Place</em>. The show has been a breath of fresh air in am otherwise fairly stale fall lineup.</p>\n\n<p><br>\nRunner-up: <strong>Stranger Things</strong>\nHopefully by now, you&#39;ve heard how good this show is. Some of it is hype, but a lot of it is engaging characters, great theme music, and a mysterious organization. The child actors are great and there&#39;s a surprising amount of depth in their relationships with their friends and their drive to do what&#39;s right. It also feels a bit like <em>The Goonies</em> in that it captures the spirit of 1980&#39;s America well (so I&#39;ve heard, I wasn&#39;t around for them). Though in some cases it can be dangerous to buy into hype, in this case it&#39;s well deserved. Set aside 8 hours and enjoy what <em>Stranger Things</em> has to offer.</p>\n\n<h3 id=\"ended\">Ended</h3>\n\n<p>Thanks to Netflix and other online providers, it&#39;s easier than ever to watch old shows that are recommended to me. Hopefully when you&#39;re reading this these are all still readily available, as they shouldn&#39;t be missed.</p>\n\n<p><br>\nWinner: <strong>Better off Ted</strong>\nThis show blew me out of the water. It follows Ted, a well-meaning exec at a fairly evil corporation. The writing is tight and the jokes come fast. They do a great job fleshing out supporting characters and Portia de Rossi nails it as Ted&#39;s tone deaf boss. Like many great shows it was taken top soon, but not before it left a lasting impact on comedy. It&#39;s 2 short seasons, why don&#39;t you give it a go?</p>\n\n<p><br>\nHonorable Mention: <em>The West Wing</em> for being equal parts prophetic and wonderful throughout its run. It seems silly to give an award to a 10 year old (and highly decorated) show, so I didn&#39;t. Its writing, acting, and political relevance are truly astounding though, so if you haven&#39;t watched it yet, do yourself a favor and rectify that.</p>\n\n<h2 id=\"books\">Books</h2>\n\n<p>This was the year I really started to get into audio-books (thanks to a few lengthy road trips). Working from home, I don&#39;t have a lot of time to listen to them anymore but they really helped transform some long drives. I had a pretty good <a href=\"https://airtable.com/shr4iBau1Ewwu5kxB\">reading list</a> this year. I&#39;ve talked about them each briefly at that link, but I wanted to highlight a couple that were really special.</p>\n\n<p><br>\nWinner: <strong>Gone Girl</strong>, by Gillian Flynn</p>\n\n<p>I always make a point to read the book before a movie comes out, and that was my primary motivation for picking up <em><a href=\"http://gillian-flynn.com/gone-girl/\">Gone Girl</a></em>. In hindsight, I chose correctly. It&#39;s a thriller about the murder of a man&#39;s wife. It adheres to a great frame where chapters alternate between their points of view: him in present day (dealing with her murder) and her in her diary, staring from when they met and running forward until her untimely demise.</p>\n\n<p>This book is equal parts thrilling and chilling as we get an insightful dive into the minds of a pair of realistic and engaging characters. Flynn&#39;s writing is frank, addressing how people change over time and how they inflict misery on others. It&#39;s gripping all the way through and I wholeheartedly recommend it.</p>\n\n<p><br>\nRunner-up: <strong>The Mirage</strong>, by Matt Ruff</p>\n\n<p>Alternate history is a genre I don&#39;t read nearly enough of, so I jumped at the chance to read <em><a href=\"http://www.bymattruff.com/my-novels/the-mirage/\">The Mirage</a></em>. Written by the author of one of my favorite books of all time (Bad Monkeys, for you trivia buffs), Ruff paints an engaging picture of how the world could have looked given a big &quot;what if&quot;. In his version of events, the UAE and the USA switch roles, and Christian fundamentalists bomb the twin Tigris and Euphrates towers. This story follows the aftermath and the political climate therein. The lives of the (FBI equivalent) agents we follow take a turn for the bizarre as artifacts from a &quot;time that wasn&#39;t&quot; begin popping up- Bush-era political propaganda and unknown technology. Especially in the current day, <em>The Mirage</em> is well worth your time.</p>\n\n<p><br>\nHonorable Mention: Joel McHale&#39;s <em>Thanks for the Money</em>. I listened to this as an audiobook and besides being funny, there were some audiobook specific jokes that made it feel special. Also, he calls friends and cast mates and has them introduce chapters over the phone, which was cute. It also becomes surprisingly touching for a largely parodic work.</p>\n\n<p><br>\nDishonorable mention: <em>The Adjacent</em>, for being an un-engaging knock off of <em>Cloud Atlas</em> where we bounce between characters, but they&#39;re all so dull that it&#39;s not worth discovering why or how they&#39;re connected.</p>\n\n<!-- extra anchor, see https://github.com/vmg/redcarpet/issues/602 -->\n\n<p><a name=\"tldr\"></a></p>\n\n<h2 id=\"tl-dr\">tl;dr</h2>\n\n<p>The word count on this one sort of got away from me, so here&#39;s just my best-ofs without any explanation: (in order of preference):</p>\n\n<ul>\n<li><em>Board Games</em>: Machi Koro, 7 Wonders: Duel</li>\n<li><em>Videogames</em>: Factorio, The Witness; Blackbox, Mini Metro</li>\n<li><em>Movies</em>: Captain America: Civil War, Arrival, Deadpool</li>\n<li><em>Television</em>: The Good Place, Stranger Things; Better off Ted</li>\n<li><em>Books</em>: Gone Girl, The Mirage</li>\n</ul>\n\n<p>Back to the <a href=\"#toc\">table of contents</a></p>\n\n<hr>\n\n<p>And there you have it! If you took the time to read all the way down here, I&#39;d like to thank you. Time is precious and I&#39;m flattered that you decided to spend some on me.</p>\n\n<p>If you feel so inclined, I&#39;d love to hear what you thought of my picks or what some of your own were. Past that, let me know if you&#39;ve got a recent favorite and I&#39;ll see you in 2017!</p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>Or the worst time, as far as my wallet is concerned. Maybe I should try cocaine instead, save a few bucks&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn2\">\n<p>This is especially rare because of the prevalence of sales for PC games. I&#39;m a very <a href=\"https://www.reddit.com/r/patientgamers\">patient gamer</a> and am reticent to buy games at full price&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn3\">\n<p>Talking to other engineering friends who have played this game, everyone had a remarkably identical experience. At the end of the week they either beat the game or were forcibly cut off by their SO&nbsp;<a href=\"#fnref3\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn4\">\n<p><em>Pokémon Sun</em> has been awesome, but it won&#39;t be eligible until next year&#39;s list at the earliest.&nbsp;<a href=\"#fnref4\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn5\">\n<p>Two winners? Yeah whatever, this is my list and there were a lot of good movies this year&nbsp;<a href=\"#fnref5\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn6\">\n<p>At the top, it faces stiff competition from <em>The Avengers</em>, <em>The Dark Knight</em>, <em>Iron Man</em>, and <em>Deadpool</em>, but at this point I&#39;m pretty sure it takes the cake.&nbsp;<a href=\"#fnref6\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/wPU9lMu.jpg","summary":"A lookback at the best (and worst) of media in 2016"}]}
