{"version":"https://jsonfeed.org/version/1","title":"David Brownman's Blog","description":"A little bit of everything","home_page_url":"https://davidbrownman.com/blog","feed_url":"https://davidbrownman.com/blog/feed.json","author":{"name":"David Brownman","url":"https://davidbrownman.com"},"items":[{"title":"My Favorite Media (2018 Edition)","id":"https://davidbrownman.com/blog/2019/02/05/my-favorite-media-2018-edition/","url":"https://davidbrownman.com/blog/2019/02/05/my-favorite-media-2018-edition/","date_published":"2019-02-05T03:00:00-05:00","tags":["lookback","books","movies","television","videogames","Airtable"],"content_html":"<p>Hello my friends! Here we are again for my <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/\">third</a> <a href=\"/blog/2018/02/21/a-few-more-favorites/\">annual</a> celebration of my favorite media.</p>\n\n<p>Like most years, 2018 was a year of change. I moved twice (once across the country) with my wonderful partner. Living together has brought changes to the way I consume media: there’s a lot less binging old TV shows on my own, and a lot more videogames played on the TV, so my girlfriend can make helpful comments.</p>\n\n<p>Current events have also left their mark. We started <em>The Americans</em> once we were settled in DC, and gearing up to watch a tense show about Russian agents infiltrating American government strikes a little close to home these days.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup> This is also my first “favorites” post without a board game section, since they are a hard habit to keep up while moving a lot and working remotely.</p>\n\n<p>What hasn&#39;t changed is how much awesome media there is out there. It&#39;s my pleasure to produce a list of what made the biggest impact on me this calendar year.</p>\n\n<p>If it&#39;s your first time, here&#39;s the lowdown. This is a list of the best media I experienced for the first time this year. It might not have been released this year, but it&#39;s new to me. It also might not be the objectively best, but it&#39;s what I enjoyed the most. You might have a different opinion, and that&#39;s great; you can get your own list. Each section will begin with a link to the <a href=\"https://airtable.com/invite/r/7A1YRa26\" target=\"_blank\" rel=\"nofollow\">Airtable</a> that I used to track my consumption of that media type. Each table has slightly different columns, but they all use a unified <a href=\"/blog/2018/06/05/on-the-rating-of-media/\">rating system</a> out of 4 stars for consistency&#39;s sake. Check those out if you want to see blurb reviews and everything that didn&#39;t make the cut.</p>\n\n<p>I&#39;m known for many things but brevity in writing is not one of them. If you&#39;re just curious about my picks, I won&#39;t hold it against you. You can <a href=\"#just-the-list\">jump to the results</a>.</p>\n\n<p>For those of you who are still reading, let&#39;s get down to it!</p>\n\n<p></p>\n\n<p><a name=\"TOC\"></a></p>\n\n<!-- START doctoc generated TOC please keep comment here to allow auto update -->\n\n<!-- DON'T EDIT THIS SECTION, INSTEAD RE-RUN doctoc TO UPDATE -->\n\n<ul>\n<li><a href=\"#videogames\">Videogames</a>\n\n<ul>\n<li><a href=\"#pc-console\">PC + Console</a></li>\n<li><a href=\"#mobile\">Mobile</a></li>\n</ul></li>\n<li><a href=\"#movies\">Movies</a></li>\n<li><a href=\"#television\">Television</a></li>\n<li><a href=\"#books\">Books</a></li>\n<li><a href=\"#just-the-list\">Just The List</a></li>\n</ul>\n\n<!-- END doctoc generated TOC please keep comment here to allow auto update -->\n\n<h2 id=\"videogames\">Videogames</h2>\n\n<p>By my count, I played <a href=\"https://airtable.com/shrtjeL4g3gP53xI2\" target=\"_blank\" rel=\"nofollow\">46 games this year</a> over a total of ~750 hours. Major changes in behavior were mostly driven by getting a PS4 at the end of 2017, which lead to a lot of time with the Kingdom Hearts 1.5 + 2.5 disc. Those were old news though, what&#39;s new and good?</p>\n\n<h3 id=\"pc-console\">PC + Console</h3>\n\n<blockquote>\n<p>Winner(s): <strong>God of War</strong> and <strong>Horizon: Zero Dawn</strong></p>\n</blockquote>\n\n<p>When I took a step back and looked at my full list, there were really only two choices for my games of the year: <a href=\"https://www.playstation.com/en-us/games/god-of-war-ps4/\" target=\"_blank\" rel=\"nofollow\"><em>God of War</em></a> and <a href=\"https://www.playstation.com/en-us/games/horizon-zero-dawn-ps4/\" target=\"_blank\" rel=\"nofollow\"><em>Horizon: Zero Dawn</em></a>. That may feel obvious, as they were both the most widely lauded PS4 exclusives to come out the past couple of years (and rightfully so). I spent a lot of time thinking about which I would pick as my #1 and have chosen to take the cowardly route of &quot;neither&quot;. They&#39;re both stupendous games in their own right, but each excels in certain areas where the other falters. Playing both of these within a few months of each other allowed me to compile a wordy, nerdy venn diagram of what sets GoW and HZD apart from each other (and from every other game I played this year).<sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup></p>\n\n<p><strong>The World</strong></p>\n\n<p>Before these, I hadn&#39;t played many (any?) modern open-world games, so I was doubly stunned by <em>Horizon: Zero Dawn</em>&#39;s setting; once because it was so beautiful, and again because I&#39;d never seen anything with its breadth or detail before. Each region felt perfectly natural: I wasn&#39;t in a manufactured world. I was in a real place where there happened to be a videogame taking place. Vertical space is used very well-- there&#39;s a lot of topography and you can climb most of it. To that end, the mechanic of paint/discoloration on climbable elements didn&#39;t break immersion, which I was impressed by. There&#39;s a set of collectibles that involves summiting high points around the map which was one of my favorite ways to spend time in the game. This is one of the only worlds where I&#39;ve just stopped in awe to slowly pan the camera and admire the scenery.</p>\n\n<p><img src=\"https://i.imgur.com/SFlz57a.png\" alt=\"Sflz57a\" />\n<img src=\"https://i.imgur.com/SB1xg2v.png\" alt=\"Sb1xg2v\" />\n<img src=\"https://i.imgur.com/xLXkAGf.png\" alt=\"Xlxkagf\" /></p>\n\n<p>Each of those pictures is a screenshot taken live with the PS4&#39;s capture tool. See the <a href=\"https://imgur.com/a/bbNbC0J\" target=\"_blank\" rel=\"nofollow\">full album</a>.</p>\n\n<p><em>God of War</em> is also ostensibly open-world, but the player experiences it very differently. While in HZD I often felt compelled to wander and explore, GoW&#39;s world felt like a series of pretty rooms connected by pretty hallways. It&#39;s a gorgeous setting, but it doesn&#39;t feel alive in the same way <em>Horizon</em>&#39;s does. Pair that with a map that doesn&#39;t really help the player navigate and the result is me mostly sticking to the linear story quests. There are some areas to explore off the beaten path, but they feel inorganic: picturesque dead ends rather than a world I happen to find myself in. All that said, GoW is graphically triumphant game, despite its detail being allocated to the characters rather than the expanse of the world.</p>\n\n<p><strong>The Story</strong></p>\n\n<p>Each game sets out with very different storytelling goals. <em>God of War</em> tells a small story. At its core, it is a father and son honoring the final wishes of the most important woman in their lives. Though there are gods and obstacles along the way, it stays true to that goal. Cinematographically, the game is precise: the whole game from opening title to credits rolling is a single unbroken shot. In contrast to the tightness of the main narrative, the side quests (and in fact, the story objectives themselves) are largely mundane fetch quests. They make sense in context, but going to fetch certain gems or magical items &quot;for uhh... reasons&quot; felt a little underwhelming.</p>\n\n<p>There weren&#39;t an abundance of side characters, but the few you encounter were portrayed with movie-level acting. The voice, the motion capture, and the delivery are all straight out of Hollywood. It&#39;s impossible to understate the nuance Santa Monica Studio was able to capture here. Every interaction, no matter how small, serves the detailed characterization this game perfectly. If you&#39;ve already played the game (or don&#39;t care about spoilers), my friend Lauren goes into much more detail in <a href=\"https://memorylinkgames.wordpress.com/2018/07/12/god-of-war-dialogue/\" target=\"_blank\" rel=\"nofollow\">their essay</a> about it.</p>\n\n<p><em>Horizon: Zero Dawn</em> is grander in scale: it tells of the whole world and how we got here. You travel the world, unravel a mystery, and turn the tide in a war to save the world. There are scores of characters littered throughout the map, each with individual backstories, prejudices, and motivations. Most provide side quests, which had a surprising amount of variation. Though there was a lot of &quot;go to this place and kill the enemies&quot;, each had compelling narrative to drive it and typically, some dialogue that affected how the mission played out. I was surprised at how real each minor villager felt. Each was compelling in their own way and I was motivated to help them all.<sup id=\"fnref3\"><a href=\"#fn3\" rel=\"footnote\">3</a></sup> There were definitely some cheesy moments, but I really enjoyed the scale of the world-building.</p>\n\n<p>Though they took different paths to get there, each game triumphs in its individual style. Neither is definitely better, but GoW is more in line with what society considers &quot;an award winning drama.&quot; Both can safely consider narrative a strong suit.</p>\n\n<p><strong>Combat</strong></p>\n\n<p>Each game has a lot of fighting and, as with story, each does certain things really well.\n<img src=\"https://i.imgur.com/Z7sSj3L.png\" alt=\"Z7ssj3l\" /></p>\n\n<p>In <em>God of War</em>, the weapon of choice is the brand new Leviathan Axe (above). Visually, it&#39;s a fairly plain weapon, albeit infused with ice energy. In motion, it feels better than anything else I&#39;ve ever &quot;held&quot;. Santa Monica Studios put a lot of work into making the axe feel powerful and they detail it in this <a href=\"https://www.youtube.com/watch?v=zpr-EE2In1M\" target=\"_blank\" rel=\"nofollow\">great video</a>. It has a supremely satisfying heft and swing to it. My absolute favorite part of using it is the recall ability. Once thrown (into an enemy, puzzle element, or nearby lake), you can call it back your hand with a <em>very</em> satisfying &quot;zoom&quot; followed by a &quot;thunk&quot;.</p>\n\n<p>The enemies you spend your days cleaving are mostly variations of soldier, werewolf, elf, troll, and rock monster. They&#39;re cool the first few times you see them, but get repetitive over the course of the game. The combat mechanics themselves are great though. Combos feel good and the skill trees give access to cooler attacks as the game progresses. You feel powerful throughout but are never far from death, which keeps you on your toes (in a good way). There&#39;s a lot of depth to which attacks are the most effective and it definitely rewards players who excel at it; there&#39;s a very high skill cap.</p>\n\n<p><img src=\"https://i.imgur.com/aUnwuYN.jpg\" alt=\"Aunwuyn\" /></p>\n\n<p><em>Horizon: Zero Dawn</em> really shines via its enemies. There are 22 species of robot in the base game and they each have their own personality, fighting style, and weaknesses. They&#39;re all found naturally in the world, so it&#39;s fun to see something that ripped you apart earlier grazing peacefully in the distance. They each react to threats differently and some species are more observant than others. They mostly travel in herds and different species travel together symbiotically. For example, extra-vigilant robots will guard a herd of grazers in exchange for food, a level of detail I was impressed by. I also loved the scale of the bigger monsters- gazing up at some of the bigger offerings really makes you feel like lunch.</p>\n\n<p>As for weapons, there are a number of options. You always have access to your melee spear and can complement it with a few versions of slingshot, bow, and net. This sounds like cool customization in theory, but in practice, I found one bow I liked, put all my good upgrades on it, and stuck with it. Combat itself lacked the depth GoW had, but made up for it in excitement/terror. You&#39;re out in the field with wild animals and they won&#39;t think twice about ripping you to shreds. You&#39;ve got tools to fight them, but it&#39;s up to you to use those tools effectively. This leads to a lot of organic moments of panicked running, rolling, and shooting that were thrilling every time. Even in the late game, when I had maxed out skill trees and weapon upgrades, I never felt like I was the most dangerous thing around. I liked that. It made the fauna feel that much more realistic and forced you to maintain a healthy respect for everything around you. There were also some optional stealth sections where you can kill bandits. This provided welcome variation to otherwise enjoyable monster combat.</p>\n\n<p>A now, a rapid-fire list of things that needed improving:</p>\n\n<ul>\n<li>Economics in HZD are pretty meaningless for most of the game. I bought the 3 weapons I wanted and never bought anything else expensive again. There are also a few versions of each, but you have access to the best pretty early so the rest don&#39;t matter.</li>\n<li>Flying enemies in HZD, while defeatable, are huge pains in the butt always</li>\n<li>GoW has some cool bonus areas, but they feel a little tacked on. I&#39;m glad they&#39;re there and they provide good end-game challenge, but they were clearly added to flesh out the realm-hopping</li>\n<li>I appreciated GoW not doing any hand-holding with regards to its collectibles (Odin&#39;s ravens) but the thought of wandering aimlessly looking for them made me want to cry</li>\n<li>Neither game really had bosses, they just had strong versions of regular monsters. This is especially notable for GoW, which comes from a series previously know for its over-the-top fights. That said, it&#39;s done a lot of work to distance itself from the original trilogy, so this makes a little sense. It doesn&#39;t make up for the lack of bosses, though.</li>\n</ul>\n\n<p>Despite their flaws, these were both phenomenal games. They&#39;re each well worth your time.</p>\n\n<blockquote>\n<p>Runner(s)-up: <strong>Opus Magnum</strong> and <strong>Shadow Tactics: Blade of the Shogun</strong></p>\n</blockquote>\n\n<p>Having played a number of <a href=\"http://www.zachtronics.com\" target=\"_blank\" rel=\"nofollow\">Zachtronics</a> games, there&#39;s a set of tropes that I expect: light story, a thematic solitaire game, and algorithmic puzzles. <a href=\"http://www.zachtronics.com/opus-magnum/\" target=\"_blank\" rel=\"nofollow\"><em>Opus Magnum</em></a> acknowledges them, refines them, and excels in every regard. It is the steampunk realization of a visual programming concept that gained popularity with <em>SpaceChem</em>. Though the puzzles are the main focus, there&#39;s a story that engages without distracting. The music and UI complement the game&#39;s themes of science and magic well. More than the code-based games, watching levers and molecules rotate and move is mesmerizing (see below).</p>\n\n<p><img src=\"https://i.imgur.com/wUppS60.gif\" alt=\"Wupps60\" /></p>\n\n<p>While past Zachtronics games paired increasingly complex puzzles with fixed amount of space, OM allows any valid solution, no matter how inefficient. I really like this choose-your-own difficulty approach. It has something for players of all skill levels without excluding anyone; each player can experience exactly as much challenge as they want.</p>\n\n<p><a href=\"http://www.shadow-tactics.com/\" target=\"_blank\" rel=\"nofollow\"><em>Shadow Tactics: Blade of the Shogun</em></a> was precise in its design. I was impressed by how organic the levels felt. Lots of games tout open-ended levels, but ST really embraces it. There are many paths to an objective and every time I thought I was clever by thinking around a problem, the game supported it appropriately. It also managed its difficulty well. This game was hard, but never felt unfair -- a hard balance to strike. I spent a lot of time saving and reloading key moments and my eventual success was all the more satisfying for it. The real-time controls rewarded adroit performance and the ability to queue up actions for simultaneous execution lead to some incredibly satisfying moments:for example, when 3 of my characters dropped from a roof together, killing a pod of guards before any of them knew what was happening. Lastly, I&#39;d be remiss not to mention the story. Games like this can usually skate by on the strength of their gameplay alone, but I was honestly surprised by the an engrossing narrative that ties the levels and objectives together. Going into <em>Shadow Tactics</em> I wasn&#39;t sure quite what to expect, but I&#39;m sure glad I gave it a shot.</p>\n\n<p><strong>Honorable Mentions</strong> to:</p>\n\n<ul>\n<li><a href=\"https://www.playstation.com/en-us/games/marvels-spider-man-ps4/\" target=\"_blank\" rel=\"nofollow\"><em>Spider-Man</em></a>, for really capturing the essence of the character. I rarely fast-traveled because it was just so enjoyable swinging around. Story was great (and gorgeous) and the combat felt good. 100%ing the game got pretty repetitive (there are only a few types of crimes to stop, and you have to stop a lot of them), but I enjoyed it immensely. I&#39;ve loved the character of Spider-man as long as I can remember and this game really did him justice. It&#39;s a testament to everything I played this year that this is only an honorable mention.</li>\n<li><a href=\"https://www.orithegame.com/\" target=\"_blank\" rel=\"nofollow\"><em>Ori and the Blind Forest</em></a>, mostly for its superb use of motion. This is another game where controls feel tight and navigating the world is enjoyable. The art and music are superb and it doesn&#39;t overstay its welcome.</li>\n<li><a href=\"https://www.playstation.com/en-us/games/ratchet-and-clank-ps4/\" target=\"_blank\" rel=\"nofollow\"><em>Ratchet &amp; Clank (PS4)</em></a>, for another stellar entry that retains the series&#39; action and humor without compromising the core gameplay. There are no districts to liberate nor skins to buy. You explore, collect, power up, and enjoy every minute. The graphics are also astounding - it looks like a Pixar movie.</li>\n</ul>\n\n<p>return to the <a href=\"#TOC\">table of contents</a></p>\n\n<h3 id=\"mobile\">Mobile</h3>\n\n<p>Though I&#39;ve got a 3DS, I played it fairly sparingly and when I did, a hilarious amount of my time was spent playing <em>Fire Emblem: Awakening</em>.<sup id=\"fnref4\"><a href=\"#fn4\" rel=\"footnote\">4</a></sup> It had a lot going for it, but all of my top picks were played on an iPad.</p>\n\n<blockquote>\n<p>Winner: <strong>Gorogoa</strong>:</p>\n</blockquote>\n\n<p><a href=\"http://gorogoa.com/\" target=\"_blank\" rel=\"nofollow\"><em>Gorogoa</em></a> is a rare combination of art, beauty, and complexity. I&#39;ve never played anything quite like it. It&#39;s based entirely around 4 panels that can be moved between corners. It plays with perspective really well, where moving items in front of one another causes them to interact in inventive ways. I&#39;ve taken three tries at describing it more specifically here and failed, so I&#39;ll let the trailer speak for itself:</p>\n\n<div class=\"video-responsive\">\n  <iframe width=\"800\" height=\"434\" src=\"https://www.youtube-nocookie.com/embed/xtZVVW17oCY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n\n<p>I was really impressed by the marriage of art and design. Each puzzle felt natural and precise. Though solutions weren&#39;t always obvious, stepping back and considering the scene brought the answer to light. Though it&#39;s also available on <a href=\"https://store.steampowered.com/app/557600/Gorogoa/\" target=\"_blank\" rel=\"nofollow\">Steam</a>, I&#39;m glad I played it on an iPad. The game elements felt wonderfully tactile as you slid them around.</p>\n\n<p>More than anything else, <em>Gorogoa</em> felt fresh and unique and for that, I salute it.</p>\n\n<blockquote>\n<p>Runner(s)-Up: <strong>Florence</strong> and <strong>Up Left Out</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.florencegame.com/\" target=\"_blank\" rel=\"nofollow\"><em>Florence</em></a> doesn&#39;t have a ton of &quot;gameplay&quot; in its game, but it is a lot of fun. It a thoughtful story about young love told with a beautiful art style and a delicate soundtrack. Both pieces pair together well. It&#39;s a short game (maybe 2 hours), but uses its time really well. I was emotionally invested in the happiness of these two people right away. The intimacy of the story was particularly outstanding in the realm of games, which are usually more exciting or supernatural. <em>Florence</em> doesn&#39;t reinvent anything, but it executed its story well and is worth your time.</p>\n\n<p><a href=\"http://upleftout.com/\" target=\"_blank\" rel=\"nofollow\"><em>Up Left Out</em></a> is the second game from developer <a href=\"https://twitter.com/targaciej\" target=\"_blank\" rel=\"nofollow\">Maciej Targoni</a> I&#39;ve picked as a winner. The puzzles were certainly good, but there are two features that really make this a standout experience: the physicality and the sound design. The puzzles center around moving squares and circles around the board and connecting lines to form a circuit. The difficulty curve is smooth and it adds new and expanded versions of the puzzles well. I usually play tablet games muted, but I&#39;m really glad I happened to turn on the sound this time. Despite being bubbly and pastel colored, the elements on the screen have a very tactile feel to them. The sound design contributes to this. You <em>hear</em> a square <em>thunking</em> against a peg when you slide it in a direction it&#39;s not supposed to go. There&#39;s a really pleasing powered-up and powered-down sound as certain elements turn on and off. The sound, just as much as the visuals, direct the experience in <em>Up Left Out</em>, and I am frankly impressed.</p>\n\n<p><strong>Honorable Mentions</strong> to:</p>\n\n<ul>\n<li><a href=\"http://www.donutcounty.com/\" target=\"_blank\" rel=\"nofollow\"><em>Donut County</em></a>, for taking an interesting premise and expanding on it well. The gameplay itself is simple and largely without challenge. It takes clear inspiration from Katamari Damacy and that&#39;s not a bad thing. There were creative tweaks in the second half of the game that expand on a tried-and-true gameplay loop, a welcome adjustment.</li>\n<li><a href=\"http://www.matthewbrowngames.com/index.html\" target=\"_blank\" rel=\"nofollow\"><em>Hexcells</em></a>, for being a well crafted puzzler. Much like sudoku and similar logic games, there&#39;s zero guessing required to succeed. iOS controls were tight. The flashes of insight leading to solutions were universally satisfying.</li>\n</ul>\n\n<p>return to the <a href=\"#TOC\">table of contents</a></p>\n\n<h2 id=\"movies\">Movies</h2>\n\n<p>I saw <a href=\"https://airtable.com/shrzSlNeUQtkN9LPZ\" target=\"_blank\" rel=\"nofollow\">74 movies</a> for the first time this year; 39 at home and 35 in the theater. Thanks, <del>Moviepass</del> AMC A-List!<sup id=\"fnref5\"><a href=\"#fn5\" rel=\"footnote\">5</a></sup></p>\n\n<blockquote>\n<p>Winner(s): <strong>3 Billboards Outside Ebbing Missouri</strong> and <strong>Coco</strong></p>\n</blockquote>\n\n<p><img src=\"https://i.imgur.com/5cChQNX.jpg\" alt=\"5cchqnx\" /></p>\n\n<p>Most movies are lucky enough to have a single great performance among a good cast. <a href=\"https://www.justwatch.com/us/movie/three-billboards-outside-ebbing-missouri\" target=\"_blank\" rel=\"nofollow\"><em>3 Billboards</em></a> inexplicably has nothing but great performances and a few absolutely astounding ones. Frances McDormand is absolutely unbelievable in her range; her portrayal of Mildred Hayes moves seamlessly between anger, love, hatred, fear, frustration, contentedness, and everything in between. I&#39;ve never been happier to see someone win an acting Oscar and it&#39;s worth <a href=\"https://youtu.be/4gU6CpQk6BE?t=2m06s\" target=\"_blank\" rel=\"nofollow\">watching her speech</a> if you haven&#39;t. Her performance is complimented by similarly brilliant ones by Sam Rockwell, Woody Harrelson, and the rest of the cast (though they were merely &quot;great&quot; and not &quot;transcendent&quot;).</p>\n\n<p>The story is dark, but poignant, with plenty of laughs along the way. The tone will feel familiar if you&#39;ve watched any of Martin McDonagh&#39;s other movies.<sup id=\"fnref6\"><a href=\"#fn6\" rel=\"footnote\">6</a></sup></p>\n\n<p>This movie was timely, of course -- the theme of police action/inaction is especially relevant in today&#39;s America. This town in Missouri is presented in totality: both its sense of community and prejudiced tendencies are laid bare to better paint this picture. I never felt like the film held back to make the characters more likable. It felt real, and I applaud it for that.</p>\n\n<p><img src=\"https://i.imgur.com/Tu4e6VO.jpg\" alt=\"Tu4e6vo\" /></p>\n\n<p><a href=\"https://www.justwatch.com/us/movie/coco\" target=\"_blank\" rel=\"nofollow\"><em>Coco</em></a> utilizes its themes so completely that it&#39;s nothing short of a masterpiece. They took a story that was as emotionally impactful as the opening of <em>Up</em> and stretched it into a full length feature about family, death, and love. The breakaway track &quot;Remember Me&quot;<sup id=\"fnref7\"><a href=\"#fn7\" rel=\"footnote\">7</a></sup> compliments the central challenge of the movie: family members disappear entirely if their living relatives don&#39;t continue to celebrate them during the holiday of Día de Muertos. Its musical cues weave throughout the soundtrack and characters, such as the title character &quot;Coco&quot;, whose ability to remember has begun to fade in her age. The artistry and detail can&#39;t be understated either--the animators use the bright palette of the spirit world and companions (alebrijes) to great effect throughout. <em>Coco</em> delivers a complete and satisfying experience. It is sinister, hopeful, spiteful, loving, and above all, enjoyable throughout.</p>\n\n<p><img src=\"https://i.imgur.com/x5Z0Qen.jpg\" alt=\"X5z0qen\" /></p>\n\n<blockquote>\n<p>Runner-Up: <strong>Black Panther</strong></p>\n</blockquote>\n\n<p>My first viewing of <a href=\"https://www.justwatch.com/us/movie/black-panther\" target=\"_blank\" rel=\"nofollow\"><em>Black Panther</em></a> suffered from overhype. Early reviewers pitched it as God&#39;s gift to cinema. When I saw it and it was &quot;just a movie&quot;, my initial impression was more negative than it should have been. Repeated viewings since have helped me identify and appreciate what set it apart from other MCU films: the villain and the art direction.</p>\n\n<p>While the entire cast is great (as per usual in the MCU), Michael B. Jordan&#39;s performance blows me away. Killmonger has sympathetic motives and an unwavering belief, making him dangerous and compelling.<sup id=\"fnref8\"><a href=\"#fn8\" rel=\"footnote\">8</a></sup> His crusade is supported by an outstanding setting. The detail in the world of Wakanda, conveyed through costume, music, and the buildings themselves combine into much more than the sum of their parts. Each of the 5 tribes has a distinct clothing style and the few palaces we see highlight varied styles of interior designers that must work there. While there are some kooky moments, the design of each and every element (right down to the <a href=\"https://creativemarket.com/blog/beyno-black-panther\" target=\"_blank\" rel=\"nofollow\">font</a> for location transitions) feels intricate in a satisfying way.</p>\n\n<p><strong>Honorable Mentions</strong> to:</p>\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/movie/tag-2018\" target=\"_blank\" rel=\"nofollow\"><em>Tag</em></a>, for being an impressive combination of action, hilarity, and heartfelt. I&#39;ve got a soft spot for people taking something silly too seriously (see also: <em>The League</em>)</li>\n<li><a href=\"https://www.justwatch.com/us/movie/searching\" target=\"_blank\" rel=\"nofollow\"><em>Searching</em></a>, for being both gripping and the most visually unique movie I&#39;ve ever seen</li>\n<li><a href=\"https://www.justwatch.com/us/movie/game-night\" target=\"_blank\" rel=\"nofollow\"><em>Game Night</em></a>, for balancing a silly story with good action (take notes, <em>A Simple Favor</em>)</li>\n<li><a href=\"https://www.justwatch.com/us/movie/a-quiet-place\" target=\"_blank\" rel=\"nofollow\"><em>A Quiet Place</em></a>, for being intense, unsettling, and cinematically beautiful. I can&#39;t say that I &quot;enjoyed&quot; it, but I am glad I was dragged to see it.</li>\n</ul>\n\n<p><strong>Dishonorable Mention</strong> to:</p>\n\n<ul>\n<li><em>Blockers</em> for having some very good comedy but ultimately failing on its message of parents understanding their daughters&#39; bodily autonomy. The hardest part is that the characters even consider their position (out loud) and then decide their way is still right.</li>\n</ul>\n\n<p>return to the <a href=\"#TOC\">table of contents</a></p>\n\n<h2 id=\"television\">Television</h2>\n\n<p>All told, I finished <a href=\"https://airtable.com/shryat9XhhhnljGy2\" target=\"_blank\" rel=\"nofollow\">25 seasons of TV</a> this year. That also includes live shows that started in 2017, so it&#39;s a little misleading. I mostly watched new shows this year (outside of <em>Breaking Bad</em>, which you&#39;ve already heard is good), so all I&#39;ve got is newly aired excellence.</p>\n\n<p><img src=\"https://i.imgur.com/B08bbNF.jpg\" alt=\"B08bbnf\" /></p>\n\n<blockquote>\n<p>Winner: <strong>Barry</strong></p>\n</blockquote>\n\n<p><em>Barry</em> does a really superb job combining two unlike things to great effect; it&#39;s the peanut butter &amp; jelly of television. Bill Hader stars as a hitman who wants to leave that violent life behind and strike out as an actor. This is easier said than done. His past life is full of unsavory characters and he finds it increasingly tough to leave it behind. The show strikes an astounding balance between hilarious and dark-as-hell. Meanwhile, the tension escalates beautifully as the FBI investigates suspicious deaths in the area. Compound that with an increasingly involved acting class and you arrive at the first season of <em>Barry</em>. Hader&#39;s performance is truly award worthy. His ability to oscillate between ruthless killer and nervous actor is truly a sight to behold -- this performance cements his legacy as as an actor who can carry a show. Stephen Root disappears into his character per usual, and Anthony Carrigan as &quot;NoHo Hank&quot; is a personal favorite. This show began with a (literal) bang and I&#39;m excited to see where it goes from here.</p>\n\n<p><img src=\"https://i.imgur.com/N8ZIih0.jpg\" alt=\"N8ziih0\" /></p>\n\n<blockquote>\n<p>Runner-Up: <strong>Ducktails (2018)</strong></p>\n</blockquote>\n\n<p>I&#39;ve always enjoyed cartoons that appeal to all ages, and <em>Ducktales</em> delivers in spades. The episodes are independent enough to stand on their own and there&#39;s an overarching plot that rewards viewers who watch them all. The cast is phenomenal. Though I had never watched much of the original, I was sold on the prospect of a remake based on the cast alone. Particular props to the trio that voice the kids (Pudi, Schwartz, and Moynihan) for bringing so much character and individuality to them. There&#39;s also a string of great guest stars (Lin-Manuel Miranda and Jim Rash were personal favorites) that keep everything feeling fresh. The theme song is a total ear worm, even when <a href=\"https://www.youtube.com/watch?v=zZek9PFMYOw\" target=\"_blank\" rel=\"nofollow\">sung by the cast</a>; learn why <a href=\"https://www.youtube.com/watch?v=2lQVG7Gf7I4\" target=\"_blank\" rel=\"nofollow\">here</a>. The show seamlessly blends weird slapstick comedy, supernatural monsters, and really heartfelt family moments into an experience that appeals to everyone without catering specifically to anyone.</p>\n\n<p><strong>Honorable Mentions</strong> to:</p>\n\n<ul>\n<li><em>Trial &amp; Error</em> (Seasons 1 &amp; 2; cancelled), for having a really charming take on <em>My Cousin Vinny</em> that manages to have its dumb characters be incredibly endearing. This show, reminiscent of <em>Parks &amp; Rec</em>, has really nailed small silent comedy moments. Great cast as well; I&#39;ll never get tired of Kristin Chenoweth&#39;s drawled &quot;law-yer.&quot;</li>\n<li><em>Big Little Lies</em> (Season 1; returning), for telling a tight crime story with a great cast. Visually, it really felt like the nailed the Monterey Bay color scheme.</li>\n</ul>\n\n<p>return to the <a href=\"#TOC\">table of contents</a></p>\n\n<h2 id=\"books\">Books</h2>\n\n<p>This year, I read <a href=\"https://airtable.com/shruxgGniiL33dyAN\" target=\"_blank\" rel=\"nofollow\">9 books</a>. Definitely fewer than I would like, so I&#39;ve thought about changes in 2019 I can make to get those numbers up. Before we get to that though, let&#39;s look at the best things I read this year.</p>\n\n<p><img src=\"https://i.imgur.com/OZ4T9B9.jpg\" alt=\"Oz4t9b9\" /></p>\n\n<blockquote>\n<p>Winner: <strong>The Lies of Locke Lamora</strong></p>\n</blockquote>\n\n<p>It&#39;s no secret - I&#39;m a sucker for heist movies. Scott Lynch&#39;s <em>The Lies of Locke Lamora</em> perfects a tried-and-true formula. An ensemble cast, costumes, intrigue, villainous enforcers, twists, and betrayal come together in a supremely satisfying package. Lynch does a great job fleshing out his cast through flashback scenes. He also builds an entire world more naturally than most writers. The gang&#39;s plan is well thought out, daring, and believable. My biggest complaint is the total lack of any non-male characters. There are some mentioned and it seems like they&#39;ll play a larger role in later books (this will eventually be the first in a 7 book series, though as of time of writing, only the first 3 have been published) (and I&#39;ve only read the first).<sup id=\"fnref9\"><a href=\"#fn9\" rel=\"footnote\">9</a></sup> That said, <em>Lies</em> is still worth picking up. I&#39;m already late to the party (it was originally published in 2006), but it&#39;s never too late to join the fun.</p>\n\n<p><img src=\"https://i.imgur.com/zA8vxtf.jpg\" alt=\"Za8vxtf\" /></p>\n\n<blockquote>\n<p>Runner-Up: <strong>The Fifth Season</strong></p>\n</blockquote>\n\n<p>N.K. Jemisin&#39;s <em>The Fifth Season</em> is a rare fantasy story. The world-building is impeccable, happening naturally as we jump between viewpoints. It doesn&#39;t stray from tragedy or death, yes comes across as hopeful. The system of magic is well-realized and the story is tightly told. The modern social commentary is impossible to ignore, yet subtle. I never felt beaten over the head with it. I really enjoyed reading a SF/F story by someone other than a straight white man. They write great stories too, but Jemisin&#39;s life experiences give a new and unfamiliar (to me) perspective to her characters and the book is the better for it. If you enjoy well-told (and already completed!) trilogies, this is a great one to pick up. I&#39;m excited to see where it goes.<sup id=\"fnref10\"><a href=\"#fn10\" rel=\"footnote\">10</a></sup></p>\n\n<p><strong>Dishonorable Mention</strong> to:</p>\n\n<ul>\n<li><em>Devil in the White City</em>, for being a book about the architectural history of Chicago sold under the guise of a true-crime thriller. Clearly the author thought history wouldn&#39;t sell well enough, so there&#39;s this wholly uninspiring detective story shoehorned in. To its credit, the history portion (80% of the book) is pretty interesting, but I nonetheless feel misled.</li>\n</ul>\n\n<p>return to the <a href=\"#TOC\">table of contents</a></p>\n\n<h2 id=\"just-the-list\">Just The List</h2>\n\n<!-- prettier-ignore -->\n\n<ul>\n<li>Videogames\n\n<ul>\n<li>PC + Console:\n\n<ul>\n<li>Winners:\n\n<ul>\n<li><a href=\"https://www.playstation.com/en-us/games/god-of-war-ps4/\" target=\"_blank\" rel=\"nofollow\">God of War</a></li>\n<li><a href=\"https://www.playstation.com/en-us/games/horizon-zero-dawn-ps4/\" target=\"_blank\" rel=\"nofollow\">Horizon: Zero Dawn</a></li>\n</ul></li>\n<li>Runners-Up:\n\n<ul>\n<li><a href=\"http://www.shadow-tactics.com/\" target=\"_blank\" rel=\"nofollow\">Shadow Tactics</a></li>\n<li><a href=\"http://www.zachtronics.com/opus-magnum/\" target=\"_blank\" rel=\"nofollow\">Opus Magnum</a></li>\n</ul></li>\n<li>Honorable Mentions:\n\n<ul>\n<li><a href=\"https://www.playstation.com/en-us/games/marvels-spider-man-ps4/\" target=\"_blank\" rel=\"nofollow\">Spider-Man</a></li>\n<li><a href=\"https://www.orithegame.com/\" target=\"_blank\" rel=\"nofollow\">Ori &amp; the Blind Forest</a></li>\n<li><a href=\"https://www.playstation.com/en-us/games/ratchet-and-clank-ps4/\" target=\"_blank\" rel=\"nofollow\">Ratchet &amp; Clank</a></li>\n</ul></li>\n</ul></li>\n<li>Mobile\n\n<ul>\n<li>Winner:\n\n<ul>\n<li><a href=\"http://gorogoa.com/\" target=\"_blank\" rel=\"nofollow\">Gorogoa</a></li>\n</ul></li>\n<li>Runners-Up:\n\n<ul>\n<li><a href=\"http://www.florencegame.com/\" target=\"_blank\" rel=\"nofollow\">Florence</a></li>\n<li><a href=\"http://upleftout.com/\" target=\"_blank\" rel=\"nofollow\">Up Left Out</a></li>\n</ul></li>\n<li>Honorable Mentions:\n\n<ul>\n<li><a href=\"http://www.donutcounty.com/\" target=\"_blank\" rel=\"nofollow\">Donut County</a></li>\n<li><a href=\"http://www.matthewbrowngames.com/\" target=\"_blank\" rel=\"nofollow\">Hexcells</a></li>\n</ul></li>\n</ul></li>\n</ul></li>\n<li>Movies\n\n<ul>\n<li>Winners:\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/movie/three-billboards-outside-ebbing-missouri\" target=\"_blank\" rel=\"nofollow\">3 Billboards</a></li>\n<li><a href=\"https://www.justwatch.com/us/movie/coco\" target=\"_blank\" rel=\"nofollow\">Coco</a></li>\n</ul></li>\n<li>Runner-Up:\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/movie/black-panther\" target=\"_blank\" rel=\"nofollow\">Black Panther</a></li>\n</ul></li>\n<li>Honorable Mention:\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/movie/tag-2018\" target=\"_blank\" rel=\"nofollow\">Tag</a></li>\n<li><a href=\"https://www.justwatch.com/us/movie/searching\" target=\"_blank\" rel=\"nofollow\">Searching</a></li>\n<li><a href=\"https://www.justwatch.com/us/movie/game-night\" target=\"_blank\" rel=\"nofollow\">Game Night</a></li>\n<li><a href=\"https://www.justwatch.com/us/movie/a-quiet-place\" target=\"_blank\" rel=\"nofollow\">A Quiet Place</a></li>\n</ul></li>\n<li>Dishonorable Mention:\n\n<ul>\n<li>Blockers</li>\n</ul></li>\n</ul></li>\n<li>Television\n\n<ul>\n<li>Winner:\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/tv-show/barry\" target=\"_blank\" rel=\"nofollow\">Barry</a></li>\n</ul></li>\n<li>Runner-Up:\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/tv-show/ducktales-2017\" target=\"_blank\" rel=\"nofollow\">DuckTales</a></li>\n</ul></li>\n<li>Honorable Mentions:\n\n<ul>\n<li><a href=\"https://www.justwatch.com/us/tv-show/big-little-lies\" target=\"_blank\" rel=\"nofollow\">Big Little Lies</a></li>\n<li><a href=\"https://www.justwatch.com/us/tv-show/trial-and-error\" target=\"_blank\" rel=\"nofollow\">Trial &amp; Error</a></li>\n</ul></li>\n</ul></li>\n<li>Books\n\n<ul>\n<li>Winner:\n\n<ul>\n<li>Lies of Locke Lamora, by <a href=\"http://www.scottlynch.us/\" target=\"_blank\" rel=\"nofollow\">Scott Lynch</a></li>\n</ul></li>\n<li>Runner-Up:\n\n<ul>\n<li>The Fifth Season, by <a href=\"http://nkjemisin.com/\" target=\"_blank\" rel=\"nofollow\">N. K. Jemisin</a></li>\n</ul></li>\n<li>Dishonorable Mention:\n\n<ul>\n<li>Devil in the White City</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<h2 id=\"until-next-time\">Until Next Time</h2>\n\n<p>And there it is. Thanks for reading this far! Inexplicably, putting this list together and sharing it with you all is a highlight of my year. In the coming year, I plan to write about how I collect this data (hint, a <em>whole</em> lot of Zapier and <a href=\"https://airtable.com/invite/r/7A1YRa26\" target=\"_blank\" rel=\"nofollow\">Airtable</a>), so <a href=\"/blog/feeds\">stay tuned</a> if you feel like you might find that interesting.</p>\n\n<p>Until then.</p>\n\n<hr>\n\n<p><em>This post was edited expertly and patiently by <a href=\"https://vickystein.media/\" target=\"_blank\" rel=\"nofollow\">Vicky Stein</a>. Images courtesy of <a href=\"https://www.themoviedb.org/\" target=\"_blank\" rel=\"nofollow\">The Movie DB</a> or captured directly by me.</em></p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>It was a toss-up between <em>The Americans</em>, <em>Veep</em>, and <em>House of Cards</em>&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn2\">\n<p>HZD in May, GoW in July&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn3\">\n<p>Unless they needed help with a bunch of flying enemies. Then they were out of luck in the hero department&nbsp;<a href=\"#fnref3\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn4\">\n<p><em>Fire Emblem</em> was great, but repeated frustration with enemy spawn mechanics soured my experience&nbsp;<a href=\"#fnref4\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn5\">\n<p>I saw 123 movies total!&nbsp;<a href=\"#fnref5\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn6\">\n<p><em>In Bruges</em> is another favorite of mine, in case this entire article isn&#39;t enough media recs for you&nbsp;<a href=\"#fnref6\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn7\">\n<p>Equivalent to Frozen&#39;s &quot;Let It Go&quot;&nbsp;<a href=\"#fnref7\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn8\">\n<p>Much like the Operative from <em>Serenity</em>, another favorite villain&nbsp;<a href=\"#fnref8\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn9\">\n<p>You would think I&#39;d have learned my lesson to only start long-running fantasy series once the final book has been announced, but here we are again&nbsp;<a href=\"#fnref9\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn10\">\n<p>As of writing, I&#39;ve finished the second book in the series, which was also good. It was a 2019 book, so you won&#39;t see it in this list, but I figured it was worth mentioning&nbsp;<a href=\"#fnref10\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/A0r1KlG.jpg","summary":"A look back at the best and brightest media of 2018"},{"title":"Thunderbolts and Lightning","id":"https://davidbrownman.com/blog/2018/11/05/thunderbolts-and-lightning/","url":"https://davidbrownman.com/blog/2018/11/05/thunderbolts-and-lightning/","date_published":"2018-11-05T03:00:00-05:00","tags":["hardware"],"content_html":"<p>When moving into my new apartment, the outlets and the cable were arranged in such a way that it wasn’t convenient to plug the modem into a power strip. &quot;So what,&quot; I thought. &quot;If lightning does strike, worst case I lose my modem and I’ve got an excuse for an upgrade! Plus, how often are there thunderstorms anyway?&quot; I mused, foolishly forgetting that I had lived in weather-less California for years. I didn’t have a great handle on the dangers of lightning, but I was about to.</p>\n\n<p></p>\n\n<p>I had a fair amount of hardware wired together. There was the modem and router, plus Ethernet cables going to my gaming PC and an old laptop I used for streaming media.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup> Here&#39;s how everything was connected:</p>\n\n<!--\nremove the \\ in the comment enders below\ngraph TB\nwall[Wall Outlet]\nmodem(Modem)\nsurge[Surge Protector]\nrouter(Router)\nlaptop(Media Laptop)\ngaming(Gaming Computer)\nwall --\\> modem\nsurge --\\> router\nwall --\\> surge\ngaming -- Ethernet --- router\nlaptop -- Ethernet --- router\nrouter  -- Ethernet --- modem\n-->\n\n<p><img class=\"svg\" src=\"https://gist.githubusercontent.com/xavdid/9691c907a61ee538f39d3a33c1f4bd3c/raw/c726af6a29f60e647bee16e33ec49ec5ea695440/start.svg?sanitize=true\" /></p>\n\n<p>Everything was peachy until our first big lightning storm. At first we were excited about the novelty, but as strikes started landing closer and closer to our apartment, the charm quickly wore off. I was on the PS4 at the time and got nervous about losing power while playing. I took the precautionary step of shutting it down. Before long, the lights flickered and I was glad I was prepared. Little did I know.</p>\n\n<p>Before heading to bed, I noticed I a couple of oddities. Firstly, the power was out in half of the apartment. Given that it was only half, I (correctly) assumed it was a thrown breaker. I hadn&#39;t yet found the breaker box in our new apartment, so that was a problem best left for the next day. Secondly, the little lights on the front of router were off. Given that the power was partially out, this didn’t jump out to me a the time and I (incorrectly) assumed it would resolve itself in the morning.</p>\n\n<p>Morning arrived, and I found the breaker box. Power was restored, but the internet was still down. I did some manual testing- some other items in that power strip still worked, others were totally unresponsive. I wasn’t sure quite how, but something was busted.</p>\n\n<p>I set out to the electronics store for a universal AC adapter and a backup router. A quick test confirmed that the router itself was dead and the problem wasn&#39;t isolated in the power adapter. Frustrating and mysterious, but not the end of the world. It wasn’t until I started unplugging Ethernet cables that the root cause became clear:</p>\n\n<p><img src=\"https://i.imgur.com/NbdRbtg.png\" alt=\"Scorched Ethernet\" /></p>\n\n<p>It turns out Ethernet cables, when properly motivated, can carry a fair amount of charge. The lightning not only fries whatever box it&#39;s in, but it can travel the path of least resistance to everything else. In my case, that path was a series of Ethernet cables and the entrance point was the unprotected modem:</p>\n\n<!--\ngraph TB\nwall[Wall Outlet]\nmodem(Modem)\nsurge[Surge Protector]\nrouter(Router)\nlaptop(Media Laptop)\ngaming(Gaming Computer)\nlightning(Lightning)\nwall -.- modem\nsurge --\\> router\nwall --\\> surge\ngaming -. Ethernet .- router\nlaptop -. Ethernet .- router\nrouter  -. Ethernet .- modem\nlightning -.- wall\n\nclassDef lightning fill:#ffae42,stroke:red,stroke-width:3px;\nclassDef fried stroke:red,stroke-width:3px;\nclass lightning lightning\nclass wall,modem,router,laptop,gaming fried\n-->\n\n<p><img class=\"svg\" src=\"https://gist.githubusercontent.com/xavdid/9691c907a61ee538f39d3a33c1f4bd3c/raw/e212c6403cdc577fcc380ad7062f5b524f266e62/end.svg?sanitize=true\" /></p>\n\n<p>Despite the surge protector doing its job, a single unprotected entry point left the whole system vulnerable.<sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup> Off the bat, I could confirm that the modem and router were hosed. My media laptop wasn’t charging, but I was hoping that was an issue with anything besides the laptop itself (there was a lot of wishful thinking that day). Most troubling of all, my gaming desktop wasn’t turning on.</p>\n\n<p>When there’s something low-level wrong with a Mac laptop (such as not charging at all), the easiest resolution is an <a href=\"https://support.apple.com/en-us/HT201295\" target=\"_blank\" rel=\"nofollow\">SMC reset</a>. This resets the thing that controls low-level hardware function (such as charging and USB ports). Given that my laptop was still non-responsive, I needed to isolate whether the problem was the battery not taking a charge or the SMC no longer able to route power to the battery. The folks at the Apple store made it clear that the laptop was older than what they would work on, so I was on my own. I used my iFixit tool set (and their handy <a href=\"https://www.ifixit.com/Guide/MacBook+Pro+15-Inch+Unibody+Mid+2010+Battery+Replacement/3024\" target=\"_blank\" rel=\"nofollow\">guide</a>) to <a href=\"https://i.imgur.com/KnJgIA0.png\" target=\"_blank\" rel=\"nofollow\">open the case up</a>. Once I did, it was obvious what the issue was.</p>\n\n<p><img src=\"https://i.imgur.com/MbZmEZ6.png\" alt=\"Scorched Case\" /></p>\n\n<p>See that big black mark in the center? That&#39;s a scorch mark on the interior of the case, right under where the Ethernet port is. There’s also some slight discoloration on that corner of the logic board, but it’s hard to tell if it’s always been like that. Either way, the laptop was the third victim. Luckily, I was able to salvage the RAM and (one SATA adapter later) the SSD as well.</p>\n\n<p>On a happier note note, my gaming rig somehow escaped without serious damage. The onboard Ethernet port no longer seems to be recognized, but I&#39;ll count that as a win. Plus, my question about how to protect home electronics from lightning was answered on <em>ATP</em>, one of my favorite podcasts! You can <a href=\"https://overcast.fm/+CdTbsx2Q/1:15:20\" target=\"_blank\" rel=\"nofollow\">listen to the clip here</a>.</p>\n\n<p>The big takeaway from all this is that lightning damage isn&#39;t limited to what&#39;s plugged directly in the wall. Plug <em>everything</em> into a surge protector if it&#39;s at all sensitive to electricity. Furthermore, as noted in the <em>Accidental Tech Podcast</em> clip above, surge protectors don&#39;t last forever. The <a href=\"https://thewirecutter.com/reviews/best-surge-protector/\" target=\"_blank\" rel=\"nofollow\">Wirecutter recommendation</a> stops providing power once it&#39;s no longer protected, making it very clear that it&#39;s time for a replacement.</p>\n\n<p>Lightning. Who knew?</p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>Netflix, Amazon Prime Video, etc&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn2\">\n<p>Remeber, the TV and everything else on the surge protector were totally fine&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/nfx8NXh.png","summary":"In which a surge protector does not protect as much as is expected"},{"title":"The Party of Lincoln","id":"https://davidbrownman.com/blog/2018/10/28/the-party-of-lincoln/","url":"https://davidbrownman.com/blog/2018/10/28/the-party-of-lincoln/","date_published":"2018-10-28T03:00:00-04:00","tags":["politics","sports"],"content_html":"<!-- I wrote this because of this comment: https://www.facebook.com/RepAnnaEshoo/posts/10156535267089228?comment_id=10156535333009228 -->\n\n<p>When I was in middle school, I was struck by the story of Jackie Robinson. He was the first black major league baseball player when he was signed by the Brooklyn Dodgers in 1947 (a <em>very</em> controversial move at the time). Years later, they moved to Los Angeles. They left seasons behind and came to year-round sun. They could no longer take the train to games; LA is a city of cars. Though the teams share a name, the Dodgers of today share little else with the team that broke the major league color barrier in 1947.</p>\n\n<p></p>\n\n<p>Here in the present day, I was watching the Cruz // O’Rourke debate the other night. Senator Cruz mentioned that he was a Republican in part because the Civil Rights Act (of 1964) was passed with the overwhelming support of Republicans. Furthermore, it was <em>southern Democrats</em> who were enforcing Jim Crow in the first place. He was proud to instead be a member of the party of Lincoln.</p>\n\n<p>Listen to the quote here:</p>\n\n<div class=\"video-responsive\">\n  <iframe width=\"800\" height=\"434\" src=\"https://www.youtube-nocookie.com/embed/efTm9eZ1qvM?rel=0&amp;showinfo=0&amp;start=848\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n\n<p>It struck me as odd that President Lincoln, a man most famous for <em>literally abolishing slavery</em>, would have been a part of a party that today prides itself in being &quot;tough on crime&quot; and incarcerating people of color at the highest rate in the world. Time for a fact check. To start, I looked up the <a href=\"https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964#Vote_totals\" target=\"_blank\" rel=\"nofollow\">voting records</a> from 1964.</p>\n\n<p><em>Percentage &quot;Yes&quot; Votes on the final version of the Civil Rights bill</em></p>\n\n        <div class=\"table-container\">\n          <table>\n            <thead><tr>\n<th></th>\n<th>Democrats</th>\n<th>Republicans</th>\n</tr>\n</thead>\n            <tbody><tr>\n<td>Senate</td>\n<td>69%</td>\n<td>82%</td>\n</tr>\n<tr>\n<td>House of Representatives</td>\n<td>63%</td>\n<td>80%</td>\n</tr>\n</tbody>\n          </table>\n        </div>\n      \n<p>Senator Cruz is technically correct; a higher percentage of people with <code>(R)</code> next to their name voted for the bill than did those with <code>(D)</code>. Here is the &quot;party of Lincoln&quot; coming through for civil rights yet again. This begs the question - how did we get from the Republicans of the 60s to those we&#39;re stuck with today? To answer, we have to go back to when the Republican party was founded.</p>\n\n<p>When Lincoln was elected the first Republican president in 1860, the party was neither grand nor old. In 1854, the <code>Kansas–Nebraska Act</code> was drafted. If passed, it would create the aforementioned territories. More importantly, it would allow local voters (exclusively white men) to decide whether slavery should be legal in the newly created territories. A group of northerners concerned about the potential spread of slavery decided to band together and form a political party. True to their name, they favored a strong federal government that could force each state to abolish slavery. They also valued high taxes, powerful business, and lenient immigration policies.</p>\n\n<p>Flash forward 100 years to the 1960s. The Republican Party was still going strong, as was, on the surface, their support for civil rights. Let’s re-examine the voting data, but split by both party affiliation <em>and</em> whether the state was a former member of the confederacy or not:</p>\n\n<p><em>Percentage &quot;Yes&quot; Votes on the final version of the Civil Rights bill</em></p>\n\n        <div class=\"table-container\">\n          <table>\n            <thead><tr>\n<th></th>\n<th><code>(D)</code> &amp; Union</th>\n<th><code>(R)</code> &amp; Union</th>\n<th><code>(D)</code> &amp; Confederacy</th>\n<th><code>(R)</code> &amp; Confederacy</th>\n</tr>\n</thead>\n            <tbody><tr>\n<td>Senate</td>\n<td>98%</td>\n<td>84%</td>\n<td>5%</td>\n<td>0%</td>\n</tr>\n<tr>\n<td>House of Representatives</td>\n<td>95%</td>\n<td>85%</td>\n<td>9%</td>\n<td>0%</td>\n</tr>\n</tbody>\n          </table>\n        </div>\n      \n<p>Northerners, regardless of party affiliation, supported civil rights; southerners were the opposite.</p>\n\n<p>This stark regional split represents the tipping point in a conflict that had been bubbling in American politics for decades. While the Republican Party had originally been comprised entirely of northerners, over time, business-friendly southerners had joined as well. Though they agreed on economic policy, you can see that they were still widely split on social issues. This vote proved to be the beginning of the end of the party as Lincoln knew it.</p>\n\n<p>Southern Democrats (lead by Strom Thurmond), were frustrated by the idea that all people should be treated equal. They defected to a Republican Party that shared their social views; an inverse transition happened in the north. Over the course of the next 40 years, the political landscape of the US would shift into the parties we have today.</p>\n\n<p>So here we are. More Republicans <em>did</em> vote for the civil rights act of 1964, but much like the Dodgers, that team had little in common with the one we we know today. Cruz’s assertion that he’s a member of the “party of Lincoln” is at best misinformed and at worst, intentionally disingenuous rhetoric. He&#39;s playing for a team that shares a name with Lincoln&#39;s, but that&#39;s where the similarities end.</p>\n\n<p>I&#39;m very glad the Civil Rights act got passed, but there&#39;s very little in the modern Republican party to thank for it.</p>\n\n<hr>\n\n<h3 id=\"sources\">Sources</h3>\n\n<p>While accurate, this post is a vast over-simplification of great swaths of American history. If you&#39;re interested in reading more, here are most of the links I used as sources:</p>\n\n<ul>\n<li>Quora: <a href=\"https://www.quora.com/Is-it-true-that-Democrats-used-to-be-the-conservative-party-and-Republicans-used-to-be-the-progressive-party-Is-the-whole-truth-more-complex-than-two-parties-switching-their-main-ideologies?share=1\" target=\"_blank\" rel=\"nofollow\">Is it true that Democrats used to be the conservative party and Republicans used to be the progressive party?</a></li>\n<li>US History.org: <a href=\"http://www.ushistory.org/gop/origins.htm\" target=\"_blank\" rel=\"nofollow\">The Origins of the Republican Party</a></li>\n<li>FactMyth.com: <a href=\"http://factmyth.com/factoids/democrats-and-republicans-switched-platforms/\" target=\"_blank\" rel=\"nofollow\">Democrats and Republicans Switched Platforms</a></li>\n<li>Wikipedia:\n\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964\" target=\"_blank\" rel=\"nofollow\">Civil Rights Act of 1964</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Kansas%E2%80%93Nebraska_Act\" target=\"_blank\" rel=\"nofollow\">Kansas-Nebraska Act</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Strom_Thurmond\" target=\"_blank\" rel=\"nofollow\">Strom Thurmond</a></li>\n</ul></li>\n</ul>\n","banner_image":"https://i.imgur.com/cZ6Rk4O.png","summary":"The GOP claims to be the party of Lincoln  Let's examine that claim."},{"title":"On the Rating of Media","id":"https://davidbrownman.com/blog/2018/06/05/on-the-rating-of-media/","url":"https://davidbrownman.com/blog/2018/06/05/on-the-rating-of-media/","date_published":"2018-06-05T03:00:00-04:00","tags":["movies","Airtable"],"content_html":"<p>Once I started tracking media in earnest, I found myself in need of a consistent way to rate what I had watched and played. There&#39;s a lot of different ways to rate something, such a 10 star scale, a score out out of five, or a simple thumbs up/down.</p>\n\n<p>My biggest gripe is that none of the scores <em>really</em> mean anything; they&#39;re good for comparing everything someone has scored, but they each have their problems. A 10 star scale is too wide; what sets a 6 star movie apart from a 7 star? The yes/no is informative but has the opposite problem: it doesn&#39;t allow for any striation between good and great. A score out of 5 is closer, but it begets my worst enemy: <em>apathy</em>. I&#39;m ultimately making these lists to help steer the reader towards the good stuff. If I&#39;m neutral on something, it doesn&#39;t provide a definitive signal. Ultimately, none of these scales provided what I needed.</p>\n\n<p></p>\n\n<p>I took inspiration from a system we used to rate applicants at an old job. After an interview, we provided feedback about how well the applicant would do and how much we wanted to work with them. Taking inspiration from <a href=\"https://www.joelonsoftware.com/2006/10/25/the-guerrilla-guide-to-interviewing-version-30/\" target=\"_blank\" rel=\"nofollow\">Joel Spolsky</a>, a &quot;I think they&#39;d do well, but I don&#39;t want them on my team&quot; was a &quot;no&quot;. That approach helped guide me: no signal was bad signal.</p>\n\n<p>With this in mind, I arrived a my definitive <strong>4 Point Rating System</strong>:</p>\n\n<ul>\n<li>A <strong>4</strong> is the highest rating. It&#39;s given to media that excels in multiple areas and has no huge flaws. It&#39;s probably not perfect, but it&#39;s something I recommend emphatically. Examples include <em>Get Out</em> and <em>Spirited Away</em></li>\n<li>Next is <strong>3</strong>. These are still on the top half of the scale, but they have problems. Maybe a good plot with lackluster characters or serious plot holes saved by good characters. Still enjoyable and recommended overall, but doesn&#39;t live up to its full potential. Examples include <em>Doctor Strange</em> and <em>National Treasure</em></li>\n<li><strong>2</strong> is the beginning of the bottom half. Media with this score have more misses than hits, but have their redeeming qualities. Especially if you&#39;re a fan of the genre, you might enjoy watching if you can get it for cheap later. Examples include <em>Now You See Me 2</em> and <em>Thor: The Dark World</em></li>\n<li>Lastly, <strong>1</strong> is an example of something that fails to execute on any level. What good there might be is drowned in a sea of something truly enjoyable. This is a surprisingly tough score to earn because you <em>really</em> have to drop the ball. Examples include <em>Transformers 4</em> and <em>The Hangover Part 2</em></li>\n</ul>\n\n<p>There you have it! Now whenever you see something I&#39;ve rated, you&#39;ll know at a glance how much I enjoyed it and whether I would recommend it to you. Though all my example here were movies, I use the same system for <a href=\"https://airtable.com/shr4iBau1Ewwu5kxB\" target=\"_blank\" rel=\"nofollow\">books</a>, <a href=\"https://airtable.com/shruXSPix7J4EqtWD\" target=\"_blank\" rel=\"nofollow\">TV</a>, and <a href=\"https://airtable.com/shrmtcuqU0Y2hSX3G\" target=\"_blank\" rel=\"nofollow\">games</a> as well. All the scores are subjective, but hopefully we agree enough that you find them helpful as well.</p>\n\n<p>Happy watching!</p>\n","banner_image":"https://i.imgur.com/zhqbTVt.png","summary":"Learn more about how I rank all of the media I track in a consistent manner"},{"title":"David's Definitive Marvel Movies Ranking","id":"https://davidbrownman.com/blog/2018/04/26/marvel-movies-ranked/","url":"https://davidbrownman.com/blog/2018/04/26/marvel-movies-ranked/","date_published":"2018-04-26T03:00:00-04:00","tags":["movies","marvel","Airtable"],"content_html":"<p>We&#39;re fast reaching the climax of the most ambitious film projects ever conceived: 18 movies over the course of 10 years, ranging from &quot;really good&quot; to &quot;I wish they hadn&#39;t made this, but here we are&quot;. To properly prepare myself for <em>Infinity War</em>, I went back and watched the entire canon of MCU movies. It was the perfect opportunity to compile my personal power ranking for all 18 films, which I&#39;m pleased to present to you now.</p>\n\n<p>While building this list, I watched each movie in order. Movies were judged loosely on categories such as humor, action, cohesiveness, and writing. Then I decided where it fit in based on those I had watched already.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup> All movies I watch fall into one of four categories: Awful, Bad, Good, and Great, which is also how I bracketed these. You probably won&#39;t agree with everything, but this is my list. If you need a refresher of what all the movies are, check out <a href=\"https://en.wikipedia.org/wiki/Marvel_Cinematic_Universe#Feature_films\" target=\"_blank\" rel=\"nofollow\">Wikipedia</a>.</p>\n\n<p>Without further ado, from worst to best, here&#39;s every Marvel Cinematic Universe film (so far).</p>\n\n<p></p>\n\n<p><strong>NOTE: EXTREME SPOILERS</strong> for all (pre-<em>Infinity War</em>) Marvel movies follow. Proceed at your own risk!</p>\n\n<p><img src=\"https://i.imgur.com/9YMqqIg.png\" alt=\"9ymqqig\" /></p>\n\n<h2 id=\"the-bad\">The Bad</h2>\n\n<p>With 18 films, there are bound to be some stinkers. For whatever reason, the following movies just don&#39;t stand up to the rest (or even as films as a whole).</p>\n\n<p><img src=\"https://i.imgur.com/0V8EMCt.png\" alt=\"0v8emct\" /></p>\n\n<h3 id=\"18-the-incredible-hulk\">18. The Incredible Hulk</h3>\n\n<p>Every series has its worst one, and I&#39;m glad we got the MCU&#39;s out of the way early. Watching it now, I can see what they&#39;re going for. They&#39;ve got Ed Norton, a great actor. They do the &quot;monster movie&quot; right by not really showing him until the end. There are some cute cameos and they reference Iron Man on a TV crawl. On the other hand, despite having a great leading actor, they do a lot of the storytelling via chat logs and the whole thing starts with a 3 minute flashback zooming (at high speed) how the Hulk was created. Plus, the animation hasn&#39;t aged well and it&#39;s hard to care about him or his lady-friend. A well deserved spot at the bottom of the list.</p>\n\n<p><img src=\"https://i.imgur.com/4Z0xqT4.png\" alt=\"4z0xqt4\" /></p>\n\n<h3 id=\"17-ant-man\">17. Ant-Man</h3>\n\n<p>Let me start by saying - I like Paul Rudd. He&#39;s a good actor and seems like a chill dude. That&#39;s why it pains me to see him flounder so spectacularly here. The tone is inconsistent (some of the family drama is <em>very</em> dramatic while everything else is pretty light). Michael Peña is hilarious, but we didn&#39;t get enough of him. There&#39;s an incompetent sub-villain in the ex-wife&#39;s husband and the character who is presumably the female lead feels like an afterthought. There&#39;s really only one good fight scene (the climax in the kid&#39;s bedroom is a neat backdrop!) while the rest are him running around while small. Definitely a cool perspective, but garner nothing more than a &quot;huh, that&#39;s kind of cool&quot;. Not to mention, there&#39;s gross bugs running around the whole time. NEXT.</p>\n\n<p><img src=\"https://i.imgur.com/lqM3J93.png\" alt=\"Lqm3j93\" /></p>\n\n<h3 id=\"16-thor-the-dark-world\">16. Thor: The Dark World</h3>\n\n<p>Let&#39;s start with the good: the sets are pretty cool and Hiddleston&#39;s Loki is a blast. Past that, this movie is thin. They took all of the worst parts of <em>Thor</em> (the stodginess and seriousness) and just made <em>more</em> of it. Gone is the humor where the God of Thunder is learning his way around Earth customs. Instead, we&#39;ve got his prop-of-a-girlfriend Jane (played by the tragically wasted Natalie Portman) who gets powerful for a bit and honestly, that&#39;s all I can remember about it. I know they kill Thor&#39;s mom, but she also only had a line or two previous, so there&#39;s not much in terms of emotional investment. It&#39;s salvaged above the other contenders by virtue of having some half-decent fight scenes, but the villain and everything else about it is so forgettable that it&#39;s hard to be sure.</p>\n\n<p><img src=\"https://i.imgur.com/LWIAOvb.png\" alt=\"Lwiaovb\" /></p>\n\n<h3 id=\"15-thor\">15. Thor</h3>\n\n<p>As one of the earliest movies (it was the fourth one made), it really shows its age. There&#39;s some cool worldbuilding about Asgard and the sets are more elaborate than other movies. Unfortunately for him, Hemsworth&#39;s first outing as Thor doesn&#39;t create a terribly likable character. His acclimation to earth is cute, but brief. There are multiple fights that feel like the climactic one, but none are satisfying enough (the destroyer, then Loki on Asgard). They spend a lot of time on this boring relationship between him and Jane, but the whole thing is unrealistic. I realize that&#39;s a weird complaint in a comic book movie, but suspension of belief only goes so far.</p>\n\n<p><img src=\"https://i.imgur.com/Q5cxMoo.png\" alt=\"Q5cxmoo\" /></p>\n\n<h3 id=\"14-guardians-of-the-galaxy-vol-2\">14. Guardians of the Galaxy Vol. 2</h3>\n\n<p>If you&#39;ve ever wondered how many competing storylines can fit in a movie, look no further. This 2 hours is <em>busy</em>. Some of the arcs (the Ravagers, Drax // Mantis) are awesome and/or emotional while others (Star Lord &amp; his daddy issues, Gold People) feel necessary, but unfulfilling. Nebula doesn&#39;t do a lot despite being an important character. Character development is surprisingly good amid a barrage of jokes (2/3 of which land). There&#39;s some cool tech, but ultimately this movie is fine.</p>\n\n<h2 id=\"the-good\">The Good</h2>\n\n<p>These are the films that start to put the pieces together and start cooking with gas. They&#39;re made up of good scenes with only a few flaws holding them back.</p>\n\n<p><img src=\"https://i.imgur.com/4IIffc1.png\" alt=\"4iiffc1\" /></p>\n\n<h3 id=\"13-iron-man\">13. Iron Man</h3>\n\n<p>We&#39;re getting there! Now, why is a movie typically so well-regarded so far down on the list? Simply, it&#39;s <em>good</em>. There&#39;s nothing awful about it, but RDJ is so good in all of the other movies he&#39;s in that this one fails to shine. It also feels surprisingly dated. This was apparently before Marvel put a ton of time designing Stark&#39;s fantasy computers. Instead, he&#39;s rocking an <a href=\"https://i.imgur.com/IzQPQpR.png\" target=\"_blank\" rel=\"nofollow\">LG VX9400</a> which is there to feel futuristic and expensive but now comes off antiquated. He&#39;s got a landline phone and makes jokes about MySpace. For all that, Bridges is an awesome villain and there&#39;s some good humor as he&#39;s building the first suits. Marvel has done worse, but they&#39;ve certainly done better since.</p>\n\n<p><img src=\"https://i.imgur.com/JDTGlf4.png\" alt=\"Jdtglf4\" /></p>\n\n<h3 id=\"12-avengers-age-of-ultron\">12. Avengers: Age of Ultron</h3>\n\n<p>This movie had the impossible task of being the sequel to <em>The Avengers</em> (which you haven&#39;t seen on this list yet because it&#39;s very good). It opens on a high note, with the already-together Avengers kicking ass. It&#39;s fun seeing them work together and there&#39;s some great freeze frames. There&#39;s good character work in each of the movie&#39;s vital &quot;small&quot; scenes <sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup> trying to pick up the hammer and the downtime at the farmhouse. Ultron (helped by an <em>exceedingly creepy</em> performance by Spader) is even an interesting adversary. Unfortunately, they spend a lot of screen time here setting up other MCU movies. Sometimes it&#39;s relevant (starting to emphasize personal accountability) but mostly, it&#39;s scenes that feel shoehorned in (Klaue in Wakanda, Infinity Stones in Thor&#39;s dream). Together, they make this movie feel unfocused. It definitely has its high points, but it&#39;s far from a complete package.</p>\n\n<p><img src=\"https://i.imgur.com/1Y7ZqrE.png\" alt=\"1y7zqre\" /></p>\n\n<h3 id=\"11-doctor-strange\">11. Doctor Strange</h3>\n\n<p>The hands down biggest thing this movie has going for it the visual effects. They really went above and beyond with the Inception-esque rotation, folding, and flattening of the world around the characters. I was pleasantly surprised at how utterly unlikable Strange is at the start and how, after seeing him get the snot kicked out of him a few times, we start to sympathize. The humor is great and his supporting cast (Wong, Ejiofor, Mikkelsen, and Swinton) really bring the whole thing together. The fight scenes are mostly hand-to-hand and choreographed well. There&#39;s definitely a lot of hand-wavy science, but given the supernatural nature of the movie, it doesn&#39;t bother me much. When it was all said and done, I was impressed by how well everything came together.</p>\n\n<p><img src=\"https://i.imgur.com/2wCC98b.png\" alt=\"2wcc98b\" /></p>\n\n<h3 id=\"10-iron-man-3\">10. Iron Man 3</h3>\n\n<p>IM3 does a really interesting thing when it focuses on Tony&#39;s problems with PTSD and anxiety, an unusual trait for the lead of a huge franchise. This marks a turning point in the MCU where besides being quality action movies, the films start to explore some emotional complexity that is unusual for the genre. This is one of the few Marvel movies with an actual twist (the identity of the Mandarin, who was awesome). I felt the actual villain (the smarmy dude behind it all) was less compelling. Tony interacting with the kid was great. Unfortunately, despite getting explosion powers, Pepper doesn&#39;t feel like much more than a damsel to be rescued, which is disappointing. The action is par for the Iron Man course and as you&#39;ve read, there are worse movies.</p>\n\n<p><img src=\"https://i.imgur.com/QxwrnC4.png\" alt=\"Qxwrnc4\" /></p>\n\n<h3 id=\"9-guardians-of-the-galaxy\">9. Guardians of the Galaxy</h3>\n\n<p><em>Guardians</em>, like the other movies in this bracket, doesn&#39;t have any glaring faults but doesn&#39;t excel at anything. The characters are actually pretty charming and grow together well. The energy of the soundtrack is infectious and the less traditional take on the humor in a sci-fi universe grew on me. More than anything, I think this willingness to try something out of the box helped them down the line when they were looking for options to salvage the <em>Thor</em> franchise. This also marks the first time Thanos has real dialogue during a movie. John C. Reilly has a great role and watching everyone else in the universe play the <a href=\"https://en.wikipedia.org/wiki/Straight_man\" target=\"_blank\" rel=\"nofollow\">straight man</a> to this gang of misfits is pretty fun.</p>\n\n<p><img src=\"https://i.imgur.com/BQcz3wX.png\" alt=\"Bqcz3wx\" /></p>\n\n<h3 id=\"8-captain-america-the-first-avenger\">8. Captain America: The First Avenger</h3>\n\n<p>Each time I watch this, it&#39;s better than I remember. The 40&#39;s aesthetic is well done and they spend a lot of non-action scenes showing the war effort. I think my biggest gripe here is how long the setup was - between him trying to get into the army, the training, and the showboating, our first big action scene (besides a fairly satisfying chase through the streets of New York) doesn&#39;t come until much later. When we get to him, Hugo Weaving plays a great villain. A lot of good pieces and a great setup of the Cap movies to come.</p>\n\n<h2 id=\"the-great\">The Great</h2>\n\n<p>Here we have them, the cream of the crop. The following films exemplify what a Marvel movie should be.</p>\n\n<p><img src=\"https://i.imgur.com/uPyKg4W.png\" alt=\"Upykg4w\" /></p>\n\n<h3 id=\"7-iron-man-2\">7. Iron Man 2</h3>\n\n<p>Of the three Iron Men, I think the second outing is the one where the pieces really come together. That may come as a surprise since this is widely considered the worst of the three. When I re-watched it, everything clicked. On one hand, you have a Tony who is finally a human. He&#39;s imperfect and dealing with that through the film. You&#39;ve got a great pair of villains in Rourke and Rockwell (who are great on their own but excel together).  This is also the intro of Senator Stern (the Ted Cruz of the MCU), a character I love to hate. It introduces Nick Fury and the Black Widow (the latter of whom spends the first half pretending to be Stark&#39;s assistant, which leads into a great reveal). Later, she helps Pepper (who is an actual character finally). Furthermore, they delve into the theme of accountability, which is important throughout the rest of the MCU. The action continues to be good, but we don&#39;t spend any time in a cave. Instead, we get functional suits, big set pieces, the Roadie we deserve (Don Cheadle), and a satisfying package.</p>\n\n<p><img src=\"https://i.imgur.com/GbOcvEj.png\" alt=\"Gbocvej\" /></p>\n\n<h3 id=\"6-captain-america-the-winter-soldier\">6. Captain America: The Winter Soldier</h3>\n\n<p>There&#39;s a lot going for <em>Winter Soldier</em>. There&#39;s no need to build Cap from scratch, so we get an opening scene of him running (literal) circles around mere mortals. We get Fury being an actual character and Widow with a lot of screen time. She and Cap have good chemistry, so it&#39;s refreshing to see them get to do some actual sleuthing. The Winter Soldier is frightening and capable. Robert Redford and his surveillance state is a surprisingly relevant message, even 4 years after the movie was originally released. Despite being buildup to <em>Civil War</em> (though we didn&#39;t know it at the time), this movie stands on its own legs as an engaging thriller that effectively sets up some of the moral quandaries that show up later.</p>\n\n<p><img src=\"https://i.imgur.com/Q9pSpDc.png\" alt=\"Q9pspdc\" /></p>\n\n<h3 id=\"5-thor-ragnarok\">5. Thor: Ragnarok</h3>\n\n<p>It&#39;s hard to say what went so <em>right</em> here. My only guess is that Marvel looked at the trash heap that was Thor 2 and &quot;let&#39;s do something completely different&quot;. And different they did! Harnessing the comedy genius of Taika Waititi, to throw all of the seriousness out the window and lean into the humor from the first movie. As it is said, &quot;To be born again, first you have to die&quot;. They take his cape, his hair, and his hammer. What&#39;s left is the funniest Marvel movie there&#39;s ever been. The humor is light and moves quickly; it drags remarkably little for a 2 hour movie. Goldblum is a great addition to the tone of the characters. The Asgard/Hela part of the plot is fine, but does give some cool actions. Cinematograhpically, this movie knocks it out of the park. I think it&#39;s second only to <em>Black Panther</em> for art design and sets. My biggest disappointment was that they didn&#39;t use AC/DC&#39;s <em>Thunderstruck</em> during the climax, but it&#39;s hard to go wrong with <em>The Immigrant Song</em>.</p>\n\n<p><img src=\"https://i.imgur.com/RQaop8D.png\" alt=\"Rqaop8d\" /></p>\n\n<h3 id=\"4-the-avengers\">4. The Avengers</h3>\n\n<p><em>Avengers</em> is greater than the sum of its parts and was for a long time, the best Marvel had to offer. Like a lot of the other intro-heavy movies, there&#39;s a lot of setup before we get to the meat of the movie. It&#39;s done well, with each character intro feeling distinct. The play between each team member feels fun. This is also the first time we get Ruffalo&#39;s Hulk, who is a breath of fresh air on an otherwise tough character. He doesn&#39;t transform until 1:15, so there&#39;s a lot of anticipation. His CGI is much more expressive, which helps him be a character both in and out of green mode. Loki is a great enemy who is equal parts cunning and powerful. The climactic fight through Manhattan is a string of compelling vignettes that tie together well. Also, Coulson&#39;s death (while partially expected <sup id=\"fnref3\"><a href=\"#fn3\" rel=\"footnote\">3</a></sup>), never stops hurting.</p>\n\n<p><img src=\"https://i.imgur.com/6qTpNl5.png\" alt=\"6qtpnl5\" /></p>\n\n<h3 id=\"3-black-panther\">3. Black Panther</h3>\n\n<p>On the surface, <em>Black Panther</em> shares a lot in common with <em>Thor</em>. It&#39;s a self-contained story about a ruler who has to come into his rule and there&#39;s a lot of world-building. The biggest difference is that this one is <em>phenomenal</em>. The supporting cast (Nyong&#39;o, Gurira, Freeman, and Wright) have a great balance between humor and action. They play off each other exceedingly well and feel realistic and human. Michael B Jordan&#39;s Killmonger is the most menacing, driven, sympathetic, and threatening villain in the entire MCU. The art direction is unparalleled; every piece of this movie from the costumes to the environments is gorgeous. The biggest knocks against it are some of the hokier scenes (Lion King-esque conversation and when the sister does her Q impression from the <em>007</em> series) and basically all details involving vibranium, but that can&#39;t do much to stop this mag-lev train from rolling toward the top of my list.</p>\n\n<p><img src=\"https://i.imgur.com/oy2BKRU.png\" alt=\"Oy2bkru\" /></p>\n\n<h3 id=\"2-spider-man-homecoming\">2. Spider-Man: Homecoming</h3>\n\n<p>The third time really is the charm. We finally got a Spiderman movie that didn&#39;t spend time killing Uncle Ben, instead replacing it with a great sequence about <em>Civil War</em> from Peter&#39;s point of view. The action is good, the villain is menacing, and the jokes are there. In fact, I think what impressed me most is how funny the supporting cast of high schoolers is without being annoying or overpowering. They all feel like actual high school students, which adds a lot to the environment. I still think Vulture being his lady friend&#39;s dad is a phenomenal reveal and the car ride he takes them on is stress I haven&#39;t felt since <em>Get Out</em>. <em>Spider-Man</em> is everything a Marvel movie should be and I look forward to what they do with him next.</p>\n\n<p><em>I also wrote about <strong>Spider-Man</strong> in my 2017 lookback <a href=\"/blog/2018/02/21/a-few-more-favorites/#movies\">here</a></em>.</p>\n\n<p><img src=\"https://i.imgur.com/xDwjluE.png\" alt=\"Xdwjlue\" /></p>\n\n<h3 id=\"1-captain-america-civil-war\">1. Captain America: Civil War</h3>\n\n<p>Captain America is the poster boy for a series getting better over time. It&#39;s no small feat to construct a movie that&#39;s both so action packed and so emotionally impactful. Though Zemo is clearly the villain, the writers do an exceptional job painting basically everyone as antagonists at some point. The viewpoints of each side of the Accords are well-presented and justified. The anxiety over seeing &quot;parents&quot; fight and neither side being purely right is tough, but rewarding. The airport fight brings a lot of characters together and is satisfying. Spidey and Ant Man have a chance to be funny without getting in the way, and each sequence feels important. The beats in the last half hour of the movie (Roadie getting injured, Stark putting his friends in jail, the reveal about who killed the Starks) are up there with <em>Logan</em>, redefining drama&#39;s place in the superhero genre. The climax with Bucky, Cap, and Stark beating the pulp out of each other feels so raw and driven that it&#39;s impossible to root for either too heavily. Everything about this movie excels, and that makes it, in my opinion, the single best Marvel movie.</p>\n\n<p><em>I also wrote about <strong>Civil War</strong> in my 2016 lookback <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/#movies\">here</a></em>.</p>\n\n<h2 id=\"onward\">Onward</h2>\n\n<p>Watching all these movies has been a blast and a half and I&#39;m really excited about <em>Infinity War</em>. These movies are the most ambitious cinematic undertaking in history and the fact that they&#39;ve grown this universe over the past 10 years is really astounding.</p>\n\n<p>If you want to play with some of this data, look no farther than <a href=\"https://airtable.com/shrlXSYnmHDqOCi11\" target=\"_blank\" rel=\"nofollow\">this airtable</a>, which will let you sort, filter, and group all of my rankings. It also has the stream-of-consciousness notes I took while watching if you&#39;re interested in reading a weird play-by-play of each one.</p>\n\n<p>Anyway, that&#39;s all I&#39;ve got today. Thanks for reading and go enjoy the movie!</p>\n\n<p><em>Big thanks to <a href=\"https://www.reddit.com/r/marvelstudios/comments/8b639o/all_18_title_cards_as_they_appear_in_the_movies/\" target=\"_blank\" rel=\"nofollow\">/u/Ragerodracir</a> for collecting all of the title card images and the inimitable <a href=\"https://vickystein.media/\" target=\"_blank\" rel=\"nofollow\">Vicky</a> for editing this post, wathing all these movies with me, and generally putting up with me.</em></p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1\">\n<p>AKA insertion sort&nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn2\">\n<p>just acting, no action&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n<li id=\"fn3\">\n<p><em>Avengers</em> director Joss Whedon always kills someone in his films. Why does he kill the ones we love the most? Maybe it&#39;s because <a href=\"https://www.reddit.com/r/IAmA/comments/s2uh1/i_am_joss_whedon_ama/c4ani27/?context=3\" target=\"_blank\" rel=\"nofollow\">we love stupid people</a>&nbsp;<a href=\"#fnref3\" rev=\"footnote\">&#8617;</a></p>\n</li>\n\n</ol>\n</div>\n","banner_image":"https://i.imgur.com/okc5zmq.png","summary":"Read my personal ranking of all currently-released MCU Movies. You won't believe how many there are! Seriously, they just keep making these things."},{"title":"A Few More of my Favorite Things","id":"https://davidbrownman.com/blog/2018/02/21/a-few-more-favorites/","url":"https://davidbrownman.com/blog/2018/02/21/a-few-more-favorites/","date_published":"2018-02-21T03:00:00-05:00","tags":["boardgames","books","lookback","movies","television","videogames"],"content_html":"<p>In my advanced age, I&#39;ve found myself with the time and inclination to consume a lot of media. As part of that, I feel like I have am obligation to share the best things I experienced in the past year with you, the loyal reader. I wrote a similar article <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/\">last year</a>, but in case this is your first time (welcome!), I&#39;ll run through the rules for how media qualifies for the coveted &quot;Davy&quot; award:</p>\n\n<ul>\n<li>media qualifies for the list for the calendar year during which I finish it for the first time</li>\n<li>winners are picked based on what I enjoyed most, not what is objectively &quot;the best&quot;. You probably wouldn&#39;t rank stuff the same way, but that&#39;s okay. This is my list, not yours</li>\n<li>if something is critically acclaimed and I&#39;m just getting around to watching it, it probably won&#39;t win. Sorry, <em>The West Wing</em></li>\n</ul>\n\n<p>With that under our belts, let&#39;s dive in!</p>\n\n<p></p>\n\n<p><a name=\"TOC\"></a></p>\n\n<!-- START doctoc generated TOC please keep comment here to allow auto update -->\n\n<!-- DON'T EDIT THIS SECTION, INSTEAD RE-RUN doctoc TO UPDATE -->\n\n<ul>\n<li><a href=\"#board-games\">Board Games</a></li>\n<li><a href=\"#videogames\">Videogames</a>\n\n<ul>\n<li><a href=\"#home\">Home</a></li>\n<li><a href=\"#mobile\">Mobile</a></li>\n</ul></li>\n<li><a href=\"#movies\">Movies</a></li>\n<li><a href=\"#television\">Television</a>\n\n<ul>\n<li><a href=\"#newly-aired\">Newly Aired</a></li>\n<li><a href=\"#ended\">Ended</a></li>\n</ul></li>\n<li><a href=\"#books\">Books</a></li>\n<li><a href=\"#a-look-back\">A Look Back</a></li>\n<li><a href=\"#thats-all\">That&#39;s all!</a></li>\n</ul>\n\n<!-- END doctoc generated TOC please keep comment here to allow auto update -->\n\n<h2 id=\"board-games\">Board Games</h2>\n\n<p>Though I love my remote job dearly, without a doubt the biggest downside is the inability to play games in the office. I&#39;ve got some local friends I meet up with infrequently, but nothing beats a regularly-scheduled Tuesday evening at the office. That said, I&#39;ve still had time to squeeze in some games and try out some new ones.</p>\n\n<p><br />\nWinner: <strong>Secret Hitler</strong></p>\n\n<p>In college, I lived in an amazing <a href=\"https://www.google.com/search?ei=KXZYWoj4Ls_OjwOxw4LoAQ&q=the%20burrow%20ann%20arbor&npsic=0&rflfq=1&rlha=0&rllag=42292958,-83707167,3202&tbm=lcl&rldimm=9798493477036629649\" target=\"_blank\" rel=\"nofollow\">house</a> with 7 other friends. Our social nature lead to us playing a lot of <a href=\"https://en.wikipedia.org/wiki/The_Resistance_(game)\" target=\"_blank\" rel=\"nofollow\">The Resistance</a>, a simple game that leans heavily on being able to deceive your close friends. For years I considered it my favorite game- it was fast to play, high tension, and lead to really memorable endings. It was my favorite right up until I had the chance to play <em>Secret Hitler</em>.</p>\n\n<p>The game pits two teams against each other: the liberals and the fascists (the latter of whom have all of the info). They take turns nominating a government, which in turn lays a tile on the board that grants a point to one of the two teams. There&#39;s a little luck involved with which tiles are drawn (the deck is heavily stacked for the fascists), but members of both teams can pass legislation (tiles) belonging to each side of government. This uncertainty paired with a good bit of bluffing makes for a very compelling 45 minutes of gameplay.</p>\n\n<p>The lying, betrayal, and explosive resolution really sell this game for me. It&#39;s been an absolute hit at my remote company (when we see each other in person). The components are high quality and travel well. The theme is well-executed, but also easy to rework should it make you uncomfortable. On each level <em>Secret Hitler</em> succeeds.</p>\n\n<p><br />\nRunner-up: <strong>Fugitive</strong></p>\n\n<p>Ever since I moved in with my SO, I&#39;ve been looking for straightforward two-player games that I can get to our (card) table. I like asymmetric games, so the <a href=\"https://www.kickstarter.com/projects/fowers/fugitive\" target=\"_blank\" rel=\"nofollow\">Kickstarter</a> for <em><a href=\"https://boardgamegeek.com/boardgame/197443/fugitive\" target=\"_blank\" rel=\"nofollow\">Fugitive</a></em> from <a href=\"https://www.fowers.games/\" target=\"_blank\" rel=\"nofollow\">Tim Fowers</a> (who previously made <em>Burgle Bros</em>) was a no brainer.</p>\n\n<p>The game is straightforward - both players stockpile cards from a segmented deck. The more the fugitive has, the more options they can employ when laying cards to escape. The more cards the agent collects, the more information they have about the possible hideouts the fugitive could be escaping via. There&#39;s also a mechanic of event cards, but we&#39;ve had so much fun with the base game that we haven&#39;t even used them yet.</p>\n\n<p>If you&#39;re looking for something with a bit of bluffing, great art, compact size and very few &quot;bits&quot;, I can&#39;t recommend this enough.</p>\n\n<h2 id=\"videogames\">Videogames</h2>\n\n<p>This was an interesting year for me as far as videogames were concerned. I made a bet last December (2016) that I would be able to resist the siren call of the Steam sale and forgo all game purchases in the 2017 year. Not one to lose a bet, I stuck with it.</p>\n\n<h3 id=\"home\">Home</h3>\n\n<p>In the absence of a stream of new games I wasn&#39;t going to play, I turned my eyes towards my oft-neglected Steam backlog. There&#39;s a great set of games I had never touched (thanks, Humble Bundle), and I&#39;m glad I had the opportunity to get into them this year.</p>\n\n<p><br />\nWinner: <strong>Talos Principle</strong></p>\n\n<p>I had seen a lot of talk about<em>The Talos Principle</em> and heard it described as &quot;portal-like&quot;. That&#39;s a fair comparison, but there&#39;s a lot more going on here. It&#39;s a more serious game. Instead of a snarky computer, you&#39;ve got an omniscient voice directing you through pristine levels. Similar to <em>The Witness</em> (a favorite game from last year), the game has a lot of exploration and emergent narrative. The biggest (and best) difference is that <em>The Talos Principle</em> actually has a story when it&#39;s all said and done. It explains who you are and why you&#39;re solving, which provides much needed closure. The story is delivered in a series of text files and audio recordings that you find, which is really cool. It&#39;s centered around some event that happened in the past and the role of autonomy/life in robots (which is immediately relevant, given that you play as a robot).</p>\n\n<p><img src=\"https://i.imgur.com/ID0sVGw.jpg\" alt=\"Id0svgw\" /></p>\n\n<p>There are distinct named puzzles that involve manipulating an increasingly complex set of objects (fan, cube, etc) to reach your goal (a tetris piece).Though some of the later puzzles are pretty tough (especially when they throw in time manipulation), the game feels rewarding. There&#39;s a good sense of progression as the puzzle elements become more connected.</p>\n\n<p>The game looks great and the atmosphere is enjoyable. If you want a solid puzzle experience, look no further than <em>The Talos Principle</em>.</p>\n\n<p><br />\nRunner-up: <strong>Else Heart.break()</strong></p>\n\n<p><em>Else Heart.break()</em> takes some time to get rolling, but once it does it&#39;s a pretty cool experience. The story is largely forgettable, but the standout feature is that there&#39;s an entire programming language embedded in the game and every object is &quot;hackable&quot;. While a door&#39;s default behavior is to take you to what&#39;s on the other side, they can be modified to take you anywhere if you know the memory address.</p>\n\n<p>The biggest thing holding this back is the lack of a compelling story (it gets neat towards the end, but it takes ages to get there) and the unused potential. For such a cool idea, the practical uses of the hacking is fairly limited. Maybe that&#39;s for accessibility sake (non-programmers can still play this), but it limits what this game could have achieved.</p>\n\n<p><br />\nHonorable mention: <strong>Recettear, an Item Shop&#39;s Tale</strong> for cute writing and an original concept and <strong>Little Big Planet</strong> for some truly stylized levels and a &quot;whoa dude&quot; moment on the <a href=\"https://youtu.be/aNRPH3-h6yQ?t=4m24s\" target=\"_blank\" rel=\"nofollow\">large rotating wheel</a>.</p>\n\n<h3 id=\"mobile\">Mobile</h3>\n\n<p>This section is different from the others in two important ways: it&#39;s harder to track playtime on mobile games and as far as I can tell, I didn&#39;t play a lot of mobile games this year. When I&#39;m on the go and have time to kill I&#39;m usually reading. I play some tablet board games, but not much like my gaming experience home. That isn&#39;t to say I don&#39;t have anything to recommend, but take it with a grain of salt. I think these are the only two mobile games I played through this year.</p>\n\n<p><br />\nWinner: <strong>Pokémon: Sun</strong></p>\n\n<p>I&#39;ve been catching <em>most of &#39;em</em> since elementary school. I haven&#39;t played every single <a href=\"https://en.wikipedia.org/wiki/Pok%C3%A9mon_(video_game_series)#Generations\" target=\"_blank\" rel=\"nofollow\">generation</a> (I missed the past few), but I&#39;m glad I got back into the series in time for <em><a href=\"https://www.pokemon-sunmoon.com/en-us/\" target=\"_blank\" rel=\"nofollow\">Pokémon: Sun</a></em>. It was the first game I played on my new 3DS (I&#39;m very <a href=\"https://www.reddit.com/r/patientgamers/\" target=\"_blank\" rel=\"nofollow\">patient</a>) and it made a statement right away that it was <em>different</em>. Most notably, it removed HMs, the unforgettable moves your Pokémon had to know to explore new areas. No longer do I have to base my team on where I&#39;m going to explore. That&#39;s right, I get 6 Pokémon, all ready for battle. They also tweaked battle experience distribution it so everyone in your party gets some, meaning no one Pokémon falls too far behind; a welcome boon. The graphics took a big step up and the world felt dynamic and explorable. Not being locked onto a grid helped with that, as did the multitude of biomes and Pokémon available to find.</p>\n\n<p>Improvements aside, the game wasn&#39;t perfect. For a story-focused outing, the story is on the weaker side. It&#39;s a little hokey and the talking Pokédex gets old quickly. The cities are fairly forgettable. The inconsistent nature of the island trials (the replacement for the gym system) was frustrating. The battle trials were cool, but the &quot;wander around and pick up item&quot; trials were not.</p>\n\n<p>When it came down to it, for all its faults, <em>Pokémon Sun</em> felt new and improved, an impressive feat after 20 years of games.</p>\n\n<p><br />\nRunner-up: <strong>Klocki</strong></p>\n\n<p>It&#39;s a tough balancing act to present a puzzle concept and build on it on a good curve. Impressively, <em><a href=\"http://klockigame.com/\" target=\"_blank\" rel=\"nofollow\">Klocki</a></em> does just that. The puzzles have clear objectives and the tactile-ness of their presentation feels great. Tiles spin, swap, shift, and rotate performantly and the sound effects pair nicely. It&#39;s short and sweet and well worth a few stints-before-bed of your time.</p>\n\n<p><img src=\"https://i.imgur.com/UUwbrP0.png\" alt=\"Uuwbrp0\" /></p>\n\n<p><br />\nHonorable Mention to <em><a href=\"http://altosadventure.com/\" target=\"_blank\" rel=\"nofollow\">Alto&#39;s Adventure</a></em>, which has beautiful graphics and music. Gameplay is pretty good and generally non-frustrating for an endless runner. The snowboarding theme is delivered well and its a pleasure to zoom down a mountain in search of llamas.</p>\n\n<h2 id=\"movies\">Movies</h2>\n\n<p>What a year for movies. Of all the sections, I had the most trouble picking the winners for this one.</p>\n\n<p>Winner(s): <strong>Spider-Man: Homecoming</strong>, <strong>Get Out</strong></p>\n\n<p><img src=\"https://i.imgur.com/Ab8yfOg.jpg\" alt=\"Ab8yfog\" /></p>\n\n<p>Let&#39;s get the biases out of the way- I love Spider-Man and I&#39;ve enjoyed nearly every modern modern Marvel movie. Even before seeing any trailers, I knew I would enjoy Peter Parker&#39;s first solo outing in the MCU. Never in my cautious optimism did I think it would be <em>this</em> good.</p>\n\n<p>I was most impressed by the pacing and balance of humor against drama. Peter Parker is finally a high school student (played by someone very near that age). His friends feel realistic, and his funny friend has great lines without trying to steal the show. The rest of the supporting cast complements him perfectly. Since this incarnation was introduced in Civil War, We got a full movie without them having to re-kill Uncle Ben. Nevertheless, we got a great character arc as Parker comes into his own as an avenger. They feature Robert Downey Jr well, but he doesn&#39;t overshadow anyone.</p>\n\n<p>This movie excelled on every level and I hope we see more films like this in the MCU.</p>\n\n<p><img src=\"https://i.imgur.com/42djrTL.jpg\" alt=\"42djrtl\" /></p>\n\n<p><em>Get Out</em>, on the other hand, is outside of my comfort zone. I don&#39;t frequently watch horror movies and probably would have skipped this entirely if not for my love for Jordan Peele and how good everyone said this was.</p>\n\n<p>What made the most lasting impression on me was how uncomfortable this made me feel. The way they communicated Daniel Kaluuya&#39;s feeling of being an outsider and an object were unsettlingly impressive. Every line in this movie was deliberate and purposeful, something that really sinks in the more times you see it. The rest of the cast, is great as well. The movie is just funny enough to not be terrifying the whole time. It delivers on every level and is most deserving of this (very prestigious) honor.</p>\n\n<p><br />\nRunner-up: <strong>Hidden Figures</strong></p>\n\n<p>I&#39;ve been making an effort to see more movies by and about people of color. Their experiences can differ so greatly from my own. Plus, I&#39;m a sucker for sure triumphant space movie. This also showed some cool computing history, so it checked a lot of boxes for me.</p>\n\n<p><br />\nHonorable mention for <strong>Logan</strong>, for showing that superhero movies can be so much more that just that; this was a standout drama.</p>\n\n<h2 id=\"television\">Television</h2>\n\n<p>This was the toughest section to write purely because it&#39;s unclear what exactly belongs in it. TV is changing and while some shoes air through the school year, others run over the summer or are released in a batch online. In the effort of simplicity, here&#39;s some shows that are online or completed an entire season in 2017. If you want new network shows, check out AV CLUB.</p>\n\n<h3 id=\"newly-aired\">Newly Aired</h3>\n\n<p><br />\nWinner: <strong>The Guest Book S1</strong></p>\n\n<p>Having been a frequent visitor of a <a href=\"https://en.wikipedia.org/wiki/Estes_Park,_Colorado\" target=\"_blank\" rel=\"nofollow\">small mountain town</a> much like the setting of <em>The Guest Book</em> in my youth, I was excited to see it explored in a comedy. I haven&#39;t watched Garcia&#39;s other popular show (<em>My Name is Earl</em>), but his reputation precedes him and I was excited for limited run. The show is framed around a consistent set of characters (the residents of fictional Mount Trace) and their interactions with the curious cast of folks that rent the vacation cabin each week. What follows is a delightful mix of thing-a-week, blackmail, misunderstandings, and a cute love story. Not needing to develop the weekly characters for more than 15 minutes leads to some really wonderful and light plots (that all interweave well with the local, ongoing plot lines). It&#39;s a taste of summer and the first season was an enjoyable run.</p>\n\n<p><br />\nRunner-up: <strong>The Orville S1</strong></p>\n\n<p>If you had told me the network sci-fi series I would be most excited about when the fall rolled around wasn&#39;t the triumphant return of Star Trek (to be honest, I haven&#39;t started it yet), but the Seth MacFarlane semi-parody? I don&#39;t even like him that much. Well, spoiler, past-me. <em>The Orville</em> hits a really good balance between seriousness and fun. It&#39;s got a lot of the same campy humor as TNG (unsurprising, given MacFarlane&#39;s history), but with some great plot lines. It took a couple of episodes to get rolling and not every episode was the best, but there were absolutely some standouts. I enjoyed the serial format, where each episode was mostly standalone. I&#39;m excited to see where they take the show when it returns in the fall!</p>\n\n<p><br />\nHonorable mention to <strong>Powerless</strong>, for being a breath of fresh air in the superhero genre. Great to see the world from &quot;our&quot; side. Like many beloved shows, it was canceled.</p>\n\n<h3 id=\"ended\">Ended</h3>\n\n<p><br />\nWinner: <strong>Galavant</strong></p>\n\n<blockquote>\n<p>Will all the singing kill our Nielsen ratings?</p>\n</blockquote>\n\n<p>What if you took the musical genius behind some of the best Disney movies and instead had them write a bawdy medieval musical? You get Galavant.</p>\n\n<p>I fell in love with the show from the pilot. The music is phenomenal and the lyrics are clever as heck (related, I recommend you watch with the subtitles on). The show does a great job of subverting expectations at every turn. It does away with tired tropes like the damsel in distress and the evil king.</p>\n\n<p>The second season does a great job expanding on the plot set out by the first. Even though the show was canceled after the second season, it still manages to build to a great climax. In classic &quot;we&#39;re probably canceled so let&#39;s mostly wrap up except for some lose ends to build next season on just in case&quot; fashion, there&#39;s some cool potential for growth if it ever returns (hello, Netflix!). Add all that to the stream of delightful guest stars (Weird Al and John Stamos to name a few), and you&#39;ve got the read deal.</p>\n\n<p>Even after months, I still listen to the <a href=\"https://open.spotify.com/user/1286017453/playlist/4TPdCE51zxM4QA8pzuf1SQ\" target=\"_blank\" rel=\"nofollow\">soundtrack</a> weekly. There&#39;s something about a self-aware musical that just does it for me, and hopefully it&#39;ll do it for you too.</p>\n\n<div class=\"embeded-iframe\">\n  <iframe src=\"https://open.spotify.com/embed/user/1286017453/playlist/4TPdCE51zxM4QA8pzuf1SQ\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n</div>\n\n<p><br />\nRunner-up: <strong>Scooby-Doo Mystery Inc</strong></p>\n\n<p>Let me start with this preface: <em>Mystery Inc</em> is super weird. They&#39;ve made some interesting character choices, namely Fred&#39;s near-sexual level of attraction to traps and how Shaggy and Velma start out dating. The show follows a monster-a-week blueprint, but also has an overreaching ark that ties the whole show together. It rises to a significant scale, especially for something that, on the surface, is a kid&#39;s show. There&#39;s a lot of jokes aimed at adults that keeps audiences of all ages on their toes. Consider me pleasantly surprised.</p>\n\n<h2 id=\"books\">Books</h2>\n\n<p><br />\nWinner: <strong>Mistborn 1: The Final Empire</strong></p>\n\n<p>There is something to be said for reading a thick fantasy paperback in a cabin in the wilderness. Whether its childhood memories or just the whole <em>vibe</em>, this is my ideal way to take in a new fantasy series. I won&#39;t pretend the environment didn&#39;t influence how much I enjoyed the first installment of <em><a href=\"https://brandonsanderson.com/books/mistborn/the-final-empire/\" target=\"_blank\" rel=\"nofollow\">Mistborn</a></em>, but to do so would devalue how great the book actually is. Though the book&#39;s size (and that of the huge world that all of Sanderson&#39;s novels inhabit) was intimidating, it flies by. The tone strikes a really good balance description an action, so no part of it really drags. The world he paints feels vibrant, the magic well-thought out (an easy thing for a fantasy author to mess up), and the city alive. There&#39;s a great sense of scale, both in the seriousness of the plot locally (in the capital city in which it mostly occurs) and how it affects the world around it (that we don&#39;t see much of). To my friends that recommended this so heartily: thank you, and I&#39;m sorry it took so long.</p>\n\n<p><br />\nRunner-up: <strong>Artemis</strong></p>\n\n<p>I really enjoyed Weir&#39;s previous book, <em>The Martian</em>. My biggest complaints were that it was a little drawn out, repetitive, and mathy (I appreciate explanation, but don&#39;t need an entire proof on the subject). <em><a href=\"http://www.andyweirauthor.com/books/artemis-hc\" target=\"_blank\" rel=\"nofollow\">Artemis</a></em> addressed each of these complaints and wrapped the whole thing in a moon heist. I really enjoyed the way Weir expanded on the day-to-day challenges of living on a moon base and how Earth culture might adapt. Characters were fun, diverse, and expressive. It was paced well with good suspense. Characters were likable and the conclusions was satisfying. Overall, highly recommend.</p>\n\n<p>Honorable mention to <em>Shadow of the Wind</em> because it was both good and very different from what I&#39;ve read before. A change of pace, but an enjoyable one!</p>\n\n<h2 id=\"a-look-back\">A Look Back</h2>\n\n<p>A year (ish) out from <a href=\"/blog/2017/02/11/a-few-of-my-favorite-things/\">last year&#39;s post</a>, here&#39;s a quick look back to much I&#39;m enjoying some of the media that was awarded a coveted &quot;Davy&quot; award last year.</p>\n\n<p><em>Factorio</em> is still awesome. The devs put out a weekly <a href=\"https://www.factorio.com/blog/\" target=\"_blank\" rel=\"nofollow\">blog</a> detailing their progress for the week. I follow the game, but have to play it only once in a while, lest I get sucked in and lose all other productivity. <em>The Witness</em> received an iOS port, opening it up to a whole new audience. My SO is a prime example of someone without the inclination to sit down in front of her computer for a long game, but is never without her with. Due to this port, she&#39;s been able to play through one of my favorite games from last year. The game looks great on her phone, and the island is a pleasure to explore.</p>\n\n<p>I got the expansion for <em>7 Wonders: Duel</em> which, impossibly, improves on a really fun game. It incentivizes some of the tiles that were previously less desirable and opens up new avenues for points if you&#39;re crafty with your card selection. If you enjoyed the base game, this complements it well. Lastly, <em>The Good Place</em> is halfway through its second season (and has been <a href=\"https://www.avclub.com/shrimp-for-everyone-the-good-place-is-forking-renewed-1820650663\" target=\"_blank\" rel=\"nofollow\">renewed</a> for a third). It&#39;s still forkin&#39; great and I&#39;m excited to see what&#39;s coming next.</p>\n\n<h2 id=\"thats-all\">That&#39;s all!</h2>\n\n<p>Putting together this article every year has encouraged me to track everything I read/watch/play more dutifully, a hobby I&#39;ve put an embarrassing amount of time into. <a href=\"https://airtable.com/invite/r/7A1YRa26\" target=\"_blank\" rel=\"nofollow\">Airtable</a> is key for this, and I&#39;ll be detailing my use of it in an upcoming post.</p>\n\n<p>Until then, enjoy what you watch and let me know if you&#39;ve got any recommendations!</p>\n","banner_image":"https://i.imgur.com/NwGZMyR.png","summary":"A look back at some of my favorite media in 2017"}]}
