{
  "basics": {
    "name": "David Brownman",
    "label": "Senior Software Engineer, Tinkerer, Enthusiast",
    "email": "beamneocube@gmail.com",
    "url": "https://xavd.id",
    "summary": "I specialize in crafting exquisite developer experiences, especially on the command line. I have experience both leading and participating in technical product teams. I have also provided formal mentorship to many up-and-coming engineers who went on to be valuable members of our team.",
    "location": {
      "city": "San Mateo",
      "region": "California"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "xavdid",
        "url": "https://github.com/xavdid"
      },
      {
        "network": "Stack Overflow",
        "username": "xavdid",
        "url": "https://stackoverflow.com/users/1825390/david-brownman"
      },
      {
        "network": "Twitter",
        "username": "@xavdid",
        "url": "https://twitter.com/xavdid"
      },
      {
        "network": "Linkedin",
        "username": "xavdid",
        "url": "https://www.linkedin.com/in/xavdid"
      }
    ]
  },
  "skills": [
    {
      "name": "Top Programming Languages",
      "keywords": ["Typescript", "Python", "Rust", "Ruby", "Go"]
    },
    {
      "name": "Top Frameworks",
      "keywords": ["Django", "React.js"]
    },
    {
      "name": "Other Technical Expertise",
      "keywords": [
        "Zapier",
        "AWS Lambda",
        "Web API Design & Implementation",
        "Open Source Development",
        "Technical Documentation",
        "Automation",
        "Distributed Systems",
        "Database Schema Design",
        "Airtable",
        "Community Moderation"
      ]
    }
  ],
  "work": [
    {
      "name": "Stripe",
      "position": "Senior Software Engineer, SDKs",
      "website": "https://stripe.com",
      "location": "Remote",
      "startDate": "2022-06-27",
      "summary": "I lead the SDKs team. We're responsible for maintaing idomatic packages in seven different languages that provide superb developer experience when integrating with Stripe. We work closely with developers to ensure we're serving their needs.",
      "highlights": [
        "From June 2022 to May 2024 I was on the Sandboxes team, where I shipped a brand new isolated testing experience to all dashboard users. I also:",
        "Led a project to improve the UX of every setting in the Stripe Dashboard.",
        "Worked across all layers of Stripe's service-oriented-architecture. Stood up a bridge service that used protobufs to facilitate communication between our Java service and our Ruby monolith."
      ]
    },
    {
      "name": "Zapier",
      "position": "Senior Software Engineer, Developer Platform",
      "website": "https://zapier.com",
      "location": "Remote",
      "startDate": "2016-09-19",
      "endDate": "2022-05-31",
      "summary": "One of a team of 6, I maintained and actively expanded the Zapier Developer platform, which powers nearly all of the 4,000+ Zapier integrations.",
      "highlights": [
        "Served Zapier's developers by triaging issues, providing technical support, and turning their feedback into actionable tickets on our end.",
        "Helped drive the evolution of the Zapier Platform to support changing product requirements and the future of integration development.",
        "Managed the orchestration and execution of millions of AWS Lambda functions daily.",
        "Provided technical mentorship in Zapier's inagural \"Path into Engineering\" cohort by explaining a wide range of full-stack topics and best-practices.",
        "Supported the Legacy Web Builder and participated in a years-long effort to convert legacy apps to modern ones. This involved a compatibility layer, migration tooling, automated error rate monitoring, and more.",
        "Wrote foundational pieces of Zapier's functionality, such as the Slack integration and (unnamed upcoming release)",
        "Helped scale the engineering team from fewer than 20 members to more than 100 throughout my tenure. I helped structure onboarding plans, interviewed applicants, improved our take-home test, and wrote guidance for future interviewers.",
        "Promoted to Senior Engineer Dec. 2019."
      ]
    },
    {
      "name": "Salesforce",
      "position": "Software Engineer - Internal Tools",
      "location": "Palo Alto, CA",
      "website": "https://salesforceiq.com",
      "startDate": "2014-05-19",
      "endDate": "2016-05-18",
      "summary": "Created internal tools that supported the productivity of other employees, both technical and non-technical. Also worked directly with the CTO to quickly roll out (mostly) pre-alpha and MVPs of new projects.",
      "highlights": [
        "Joined RelateIQ, later SalesforceIQ. RIQ was acquired by Salesforce 3 months after joining.",
        "Re-wrote internal information site in the interest of stability and user experience.",
        "Created a full-featured Ruby SDK to access our API.",
        "Architected a testing framework from scratch to provide unit tests for our Zapier integration.",
        "Maintained a set of Ruby and JavaScript-based processes that drove business operations."
      ]
    },
    {
      "name": "International Referee Development Program",
      "position": "CTO",
      "location": "Remote",
      "startDate": "2014-03-20",
      "endDate": "2016-11-06",
      "summary": "Technical lead responsible for the creation and maintenance of the IRDP website.",
      "highlights": [
        "Worked closely with the International Quidditch Association to power worldwide referee certification tools.",
        "Internationalized most of the site into 3 languages.",
        "Used Parse to implement backend and authentication and expanded Parse Ruby Gem to fit site needs.",
        "The organization was acquired by the IQA and I transitioned off the project."
      ]
    },
    {
      "name": "backstitch",
      "position": "Software Development Intern",
      "location": "Detroit, MI",
      "website": "https://backstit.ch",
      "startDate": "2013-05-15",
      "endDate": "2013-08-15",
      "summary": "Full stack web development, focusing on Rails. Created webpages from mockups, improved data processing for external links, and social media management.",
      "highlights": [
        "Learned Ruby/Rails, Javascript, and HAML on the fly to be able to be a productive member of the team.",
        "Aided marketing intern in the production of Google ADWords campaigns, demographic targeting, and UX design."
      ]
    },
    {
      "name": "Fetchnotes",
      "position": "Software Engineer Intern",
      "location": "Ann Arbor, MI",
      "website": "https://fetchnotes.com",
      "startDate": "2012-05-15",
      "endDate": "2012-08-15",
      "summary": "Backend development on a Python/Tornado stack. Developed on the API and improved object oriented design of storage objects.",
      "highlights": [
        "Expanded upon a flexible API to afford access to Mongo objects both internally and (eventually) other developers."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Michigan",
      "website": "https://umich.edu",
      "startDate": "2010-09-04",
      "endDate": "2014-05-02",
      "area": "Social Computing Informatics",
      "studyType": "Bachelor of Arts",
      "summary": "My informatics degree was the better part of the Computer Science curriculum coupled with the breadth of knowledge one gets from a typical Liberal Arts education. See below for a link to a more complete description of my coursework."
    }
  ],
  "projects": [
    {
      "name": "david.reviews",
      "url": "https://david.reviews/",
      "summary": "An automated media review site powered by Airtable."
    },
    {
      "name": "Advent of Code",
      "url": "https://advent-of-code.xavd.id/",
      "summary": "Solved a increasingly-difficult series of programming tasks. Each day, I wrote a detailed explanation of how/why my solution worked in an effort to each computer science concepts to others."
    },
    {
      "name": "See also: the projects page on my website",
      "url": "https://xavd.id/projects"
    }
  ],
  "publications": [
    {
      "name": "My Individual Contributor README",
      "website": "https://xavd.id/blog/post/my-ic-readme/",
      "summary": "A cheat-sheet for how I work and what drives me."
    },
    {
      "name": "More Information About my Degree",
      "website": "https://xavd.id/blog/post/nothing-whats-informata/"
    }
  ]
}
